[{"review_id": "WbRXI_z018D2ZapCXKrmAw", "user_id": "-HF0n5zD34iTRrQLmZeR-A", "business_id": "QlcQ6cBSKfK_upcBhAt8Yg", "review": [["I stopped here to pick up dinner a \"gobbler bowl.\" There was no one there except for one other person. I placed an order using the touch screen and proceeded to browse and look around as I waited. After a few minutes, the guy putting the order together called the other persons number and then went about doing nothing. A few minutes later i look over and there's my dinner and I had to ask what number that was and sure enough it was mine. No problem\n\nI get home to eat and notice the cranberry sauce was missing.  Fine. I was hungry so when i got to the bottom I was eating stuffing and not exactly chewing. When I went to swallow there was some big piece that felt a little sharp and flat lodged in my throat. I proceeded to try to cough it up or vomit but it was too late. I felt it slowly going down my esophagus. \n\nIf i had to guess I would say there was a piece of plastic in my food that I had swallowed. I will never stop by this WAWA again. \n\nAvoid or eat with caution"]], "date": "2020-11-26", "time": "22:47:14", "categories": "Automotive, Restaurants, Coffee & Tea, Sandwiches, Gas Stations, Food", "city": "Edgewater Park", "state": "NJ", "stars": 2.0, "business_review_count": 12, "predit_yelp_score": 0.8500000000000001, "actual_yelp_score": 1.0}, {"review_id": "UgL0WFFGZnGlWQN1PiDk0w", "user_id": "CmytirOPsZg6jHTX0fMQzA", "business_id": "BrD8yPqnivir_-PpZ8pjQA", "review": [["Holy cow is this a tasty place for breakfast. I'm talking the best coffee, fantastic food, nice service.  The seating is very limited but wait. It is worth it. The corned beef was incredible...so very fresh and salty...perfect. The potatoes and sausage were just incredible. I'm so infinitely sad that we were visiting. It's almost worth flying in just to eat there. Not joking..."]], "date": "2020-11-30", "time": "22:39:05", "categories": "Food, Desserts, Breakfast & Brunch, Internet Cafes, Coffee & Tea, Restaurants", "city": "Boise", "state": "ID", "stars": 4.0, "business_review_count": 69, "predit_yelp_score": 2.3, "actual_yelp_score": 5.0}, {"review_id": "AgzM69BugUqdOZaqRdf20Q", "user_id": "Iu7mYJi-UWK9OOWK5Jx5vQ", "business_id": "IYzqGs1e28misAwcZvf8yg", "review": [["This aquarium is one of the most beautiful ones I ever been to, they follow very strict COVID rules, and they are remembering everyone to wash their hands every 30 min.\nTheir splash park and playground outside are sanitized every hour.\n\nWe are definitely going back pretty soon"]], "date": "2020-11-29", "time": "01:31:05", "categories": "Active Life, Day Camps, Aquariums, Venues & Event Spaces, Event Planning & Services, Arts & Entertainment, Education, Wedding Planning, Local Services, Botanical Gardens, Elementary Schools, Community Service/Non-Profit", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 624, "predit_yelp_score": 3.0250000000000004, "actual_yelp_score": 5.0}, {"review_id": "NLOWTrTcFFPvTiIHA1Pw-A", "user_id": "TzsOYZcPi1_8UEs866hYBw", "business_id": "skY6r8WAkYqpV7_TxNm23w", "review": [["Dined here twice on a recent trip to Santa Barbara.\nThere is usually a waiting list...for good reason.\nThe food is outstanding and the service is good.\nThe atmosphere is excellent, right on the beach\nWould definitely recommend"]], "date": "2020-11-18", "time": "01:13:50", "categories": "Seafood, Restaurants, Hawaiian, American (New), Breakfast & Brunch", "city": "Santa Barbara", "state": "CA", "stars": 4.0, "business_review_count": 2536, "predit_yelp_score": 2.6500000000000004, "actual_yelp_score": 5.0}, {"review_id": "K02m8cR6M3GMPm8__xLlSQ", "user_id": "m9jd6E7ymtISFsxTlEJdUQ", "business_id": "Wg5h73M2PaGJzlYFTj7LKw", "review": [["Pizza was very yummy and the servers were very kind. Christmas Eve they gave out 200 FREE pizzas and I was fortunate to get way. They have given so much to our small community and continue to do so in the midst of hardship."]], "date": "2020-12-05", "time": "21:15:18", "categories": "Restaurants, Pizza, Chicken Wings, Sandwiches", "city": "Croydon", "state": "PA", "stars": 3.0, "business_review_count": 25, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 5.0}, {"review_id": "1eMtZ-WyDWCjI52wc97Z9w", "user_id": "MqKH7NcSST6S6ah-fJ0P3A", "business_id": "cB_9eHHfo9me96cZup-lZQ", "review": [["Nothing nice to say.  No bottled water in the entire hotel, no beer or wine until 6 pm, old, dingy, seedy place.  Cant believe it is owned by Marriott.  Extremely overpriced.  Amenities are non existent.  This should be a 3 star property for $179 per night."]], "date": "2020-12-07", "time": "06:24:48", "categories": "Hotels, Venues & Event Spaces, Event Planning & Services, Hotels & Travel", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 316, "predit_yelp_score": 0.65, "actual_yelp_score": 1.0}, {"review_id": "VSwMYn9Bo4N-Pjgto_McTQ", "user_id": "UEClfmKPBYBZJIvQnqqf_g", "business_id": "vgAiij5tNRpdR9yPd6w2mg", "review": [["I love eegees, but this place is awful! I wouldn't even waste your time here, the service is awful. they got my order wrong and when i asked for additional dressing, the lady working gave me the biggest attitude and rolled her eyes at me. Then I get home to see that my order is made wrong, and missing 2 items. When i asked for a refund, they refused because there was no manager on duty and no one knew how to refund. Last time i ever waste my money at this location."]], "date": "2020-11-24", "time": "15:11:04", "categories": "Sandwiches, Juice Bars & Smoothies, Fast Food, Food, Restaurants, Desserts", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 96, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "yNZKBS2CoyPVl4CjdDMrVQ", "user_id": "KuP22KDuE9zS4poP0AXDxw", "business_id": "9f5GXEeTvBWnrZ-AHEjgJQ", "review": [["This place is so adorable! We had the calamari for an app, awesome. My husband had the crab cake sandwich and he loved it. I had the sausage shrimp pasta and it was delicious! Our waitress Jill was excellent! We didn't have to ask for refills or even condiments she was just great. They have a cute gift shop next door that has really adorable baby onesies. We will be coming back next time! If u check in on Yelp you get free onion rings. We weren't in the mood for them today but good to know for next time!"]], "date": "2020-11-23", "time": "16:50:36", "categories": "Food, Seafood Markets, Seafood, Nightlife, Sandwiches, Salad, Specialty Food, Restaurants, Bars, Fish & Chips, Breakfast & Brunch", "city": "Indian Rocks Beach", "state": "FL", "stars": 4.0, "business_review_count": 1144, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 5.0}, {"review_id": "9gEnCMH8yPUUY0yUkbf7Xw", "user_id": "KgeXVxAE1TdYk-rLYeVApA", "business_id": "Y9fDFqOmBLP3edNen-D39A", "review": [["Consistent food, love the wings especially the cucumber wasabi and great beer choices. Always looking forward to wing Thursdays."]], "date": "2020-11-19", "time": "18:09:10", "categories": "Bars, Food, American (New), Barbeque, Nightlife, Beer, Wine & Spirits, Restaurants", "city": "Hermitage", "state": "TN", "stars": 3.5, "business_review_count": 221, "predit_yelp_score": 2.85, "actual_yelp_score": 5.0}, {"review_id": "O9JeIjKfcUCt_emZafDlmg", "user_id": "Dxp82KxFcmisgeCxHomfVg", "business_id": "3_hoUO4wa-4mRUhMxDrXhw", "review": [["This place has the best jerk chicken in indy.. my opinion but definitely a must try.. they are practicing social distancing every well. They have late night hours on the weekends.. I would cautions going in between 8 and 9 thats when the are cooking more for late shift. So ran out of white meat.. but dark meat was just as good."]], "date": "2020-11-19", "time": "03:33:53", "categories": "Caribbean, Restaurants", "city": "Indianapolis", "state": "IN", "stars": 4.5, "business_review_count": 31, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "V5TMTZzxwByRj0Kpnd6PRA", "user_id": "5amQzt9JygNWhx9K_tOjbA", "business_id": "0fa-BS5a45TyhqNVVoKI4A", "review": [["I have never had such a bad experience with an auto dealer. The finance manager was non responsive when we had questions and the General Sales Manager started off helping, but has since gone downhill as well. My Jeep that I bought on 09/25/20 is sitting in my driveway because the temp. tag expired and I cannot drive it. He was reminded about this 11 days ago. Asked if he could send someone out with a new temp. tag so I would not be without a vehicle tomorrow as well and he stated he will mail one out. Worst customer service ever!"]], "date": "2020-11-30", "time": "19:44:01", "categories": "Car Dealers, Automotive", "city": "Madison", "state": "TN", "stars": 2.5, "business_review_count": 29, "predit_yelp_score": 0.9000000000000001, "actual_yelp_score": 1.0}, {"review_id": "ul8UD-0mPErDs4bUZqCiOA", "user_id": "Dh3hd1M6k_x2_HeX32Tx6w", "business_id": "roYn9d8etWQ5qbtGpkt8NA", "review": [["We stopped by for  rentals for Mount Rose.  The staff was really helpful and friendly, very accommodating and offered thoughtful advice.  Ski rental prices are best around,  and equipment was in excellent shape (almost new skis) .  Lots of good gear for sale in case you forgot or need something like we did.  A great experience - highly recommended"]], "date": "2020-12-07", "time": "07:20:55", "categories": "Sporting Goods, Shopping", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 45, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "Hm1OXhvLqUbB-u7gAnYCxQ", "user_id": "PjpW-H8GQAZYg3_ULLh1JQ", "business_id": "iDZjkqdOzH1dvv10E2YPSQ", "review": [["We booked a private swing dance lesson and was directed to this studio. Nice studio with good sound system.\nThis location used to be an old firehouse."]], "date": "2020-12-01", "time": "04:09:14", "categories": "Arts & Entertainment, Cultural Center, Event Planning & Services, Performing Arts, Venues & Event Spaces", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 7, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "BjiO62KNy2gl4dskdma9mQ", "user_id": "3BJE0ob2oqdA-BvHs4Xo2A", "business_id": "Y0FScnd6UD3g_tUfy2jWuQ", "review": [["Really disappointed, I must admit WAY better experience in greenwood, the only thing that came out right were the mix drinks , our Nashville hot wings had a drizzle of sauce shakes on, it was so bad the bartender brought us to sides of the sauce, I ordered the ribeye an 2 sides steak was suppose to medium it was burnt in one side an rare on the other guess that's how you cook medium a medium steak, my girlfriend order ribs an fries, needed extra sauce for the ribs an the  fries were cold as outside, had them take the steak back an to just put it simply I waited   15 mins for a 8 min steak before I decided to just ask for my tab, I could see if it was the weekend but we walked right in an sat down my girlfriend was like oh they only have 3 stars now we see why, the bartender did her best to accommodate us so the service was good, the food an quality was less than desirable,  good luck  with your experience mine well make me think twice before coming back"]], "date": "2020-12-09", "time": "01:32:38", "categories": "Restaurants, American (New), Gluten-Free, Pizza", "city": "Avon", "state": "IN", "stars": 3.5, "business_review_count": 207, "predit_yelp_score": 2.15, "actual_yelp_score": 2.0}, {"review_id": "kPaz9esAXW5jjL7f_wtMjA", "user_id": "zEvmkpJcth-LaW3hBD4kmA", "business_id": "v-Qba5-vGYD309R6zgciww", "review": [["Just trying to look at engagement rings with my girlfriend and the sales women was super pushy and made the experience awful and uncomfortable."]], "date": "2020-12-06", "time": "02:04:53", "categories": "Jewelry, Shopping, Watches", "city": "Greenwood", "state": "IN", "stars": 2.5, "business_review_count": 7, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "ZomSqkhsNMORiKQBzLmjcA", "user_id": "VpaAH49zEKexTBsLqz0enA", "business_id": "Ak4vFqHZUWU5KXONRnuieQ", "review": [["Very good!  And when they say Diablo, they mean it!  I had Shrimp Diablo and it was delicious and super spicy!!   Accompanying beans were lovely.  The only think I didn't love was the seafood appetizer as the sauce it was in was quite sweet.  The seafood in of itself was delicious and fresh.  Everyone in my family enjoyed theirs respectively - enchiladas, tacos and burritos."]], "date": "2020-12-09", "time": "20:29:31", "categories": "Mexican, Breakfast & Brunch, Restaurants, Seafood", "city": "Santa Barbara", "state": "CA", "stars": 4.0, "business_review_count": 166, "predit_yelp_score": 2.1, "actual_yelp_score": 4.0}, {"review_id": "D7r8T9aStfR69ZMk97Bheg", "user_id": "E779Ae4dKcXshIAZBOkFcQ", "business_id": "SYHDOHRNAH-2xsw3XB5qbg", "review": [["We came here twice in 5 days. The food is so darn good!  Very casual setting, like diner vibes. Some inside but mostly outside seating. Pick up window style. There's a good chance there will be a line  in the AM (nothing too crazy),  bc everyone in SB is aware The Shop is the place to be for a delicious start to the day\n\nWe lovvvvvvvve The Shop Kitchen"]], "date": "2020-11-29", "time": "03:50:11", "categories": "American (New), Food, Restaurants, Coffee & Tea, Breakfast & Brunch", "city": "Santa Barbara", "state": "CA", "stars": 4.5, "business_review_count": 1108, "predit_yelp_score": 2.575, "actual_yelp_score": 5.0}, {"review_id": "HeEGcA9Ws0lYFuxZoOFrKA", "user_id": "eeErZzgWenz9ck7FGdFUfw", "business_id": "CTZEnTsW2JYN2NH1BCAaZw", "review": [["Fancy and nice establishment I visited with my family a few years ago. \n\nService and food was solid. Was kinda forgettable if I'm ebony honest. Of all the places i visited on my business trip to Nashville this was the one I keep forgetting about. I do remember the prices were very high and the food while dresses to look pretty didn't have the taste to match the price."]], "date": "2020-12-01", "time": "22:47:11", "categories": "American (New), Restaurants, Nightlife, American (Traditional), Bars, Lounges", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 809, "predit_yelp_score": 1.3250000000000002, "actual_yelp_score": 3.0}, {"review_id": "pnptNnZMVUp1i2TMrvBoCg", "user_id": "2jCrH48LDG4c3ja4CLh0qg", "business_id": "eLjXnfYwkr8zz0VhwMhOGw", "review": [["You truly can't go wrong with Pizza Dominica! Not only can you place an order for delivery through a third party service; however, you can enjoy your food for carry out or now dine-in (since it's COVID and all).\n\nI love their garlic knots and the burrata dipping sauce.\n\nTheir pizza sauces are delicious and I'm definite I'll be back."]], "date": "2020-11-19", "time": "15:33:57", "categories": "Italian, Pizza, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 419, "predit_yelp_score": 2.75, "actual_yelp_score": 4.0}, {"review_id": "m9C-TYRCqGW45_1fVoOk3g", "user_id": "U20nmFu9R1F4OJ2P6v-f7Q", "business_id": "lpiPm0DZxdvwoba5Z7XAuQ", "review": [["What a supercute shop!  They have a very nice selection on vintage dresses and shoes.  I grabbed a very nice dress.  it's a little big in the waist, but I'm going to have it taken in.  Overall, a great selection and everything was very clean.\n\nThey have a BOGO (buy one get one) rack and I didn't find anyting there, but next time I'm in Tampa, I'm heading back to Valhalla and have another look!"]], "date": "2020-11-18", "time": "06:53:57", "categories": "Women's Clothing, Thrift Stores, Fashion, Used, Vintage & Consignment, Shopping", "city": "Tampa", "state": "FL", "stars": 5.0, "business_review_count": 14, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "npMQtSfGWqh2dd_NrB9F8A", "user_id": "z9dMbLy0nCY1eUKMVGiryQ", "business_id": "mNhDpyTBjJ1vJaYeqmkfew", "review": [["WOW! I recently went to a different salon (a week ago) to get dip. After a week, my nails had already chipped. I knew I had to make an appointment at American because of all the terrific things I have heard...and they did not disappoint!!! I had a short wait but also came the day before Thanksgiving. My other was removed nicely with no pain. When I first picked out my color, my nail tech Kim checked to make sure I liked it. It wasn't the color I was hoping for, so she removed it and made a recommendation based off of what I told herI was looking for. She the continued to do a near perfect job. Some highlights: she did not take away any of my natural length as requested, no bumps, lowest possible edges near cuticle, even lengths, whole nail colored. My total was $37 cash. So impressed. Overall, salon was very nice too. Only thing is I have a very small (only noticeable to me smudge).Also would like a hand massage; all things considered, forgoing a massage was a reasonable price to pay for a perfect job. Thanks Kim!!!"]], "date": "2020-11-26", "time": "14:20:45", "categories": "Nail Salons, Beauty & Spas", "city": "West Chester", "state": "PA", "stars": 3.0, "business_review_count": 88, "predit_yelp_score": 2.425, "actual_yelp_score": 4.0}, {"review_id": "jmetJdRohHT1golUsZ44HQ", "user_id": "RiCjTnl38bulXHFyXCsxew", "business_id": "py2wfbOhB1gRAP7N1CzK6Q", "review": [["My son lived in Studio Plaza and he was very comfortable there.  There was always plenty of parking and the monthly parking fee is very reasonable.  The grounds are kept nicely maintained and the complex is quiet and safe.  The best part about the complex is the manager Felipe.   He is very responsive, flexible, professional, and kind.   He usually answers the phone right away or returns calls immediately.  He keeps things running very smoothly!"]], "date": "2020-12-06", "time": "00:24:47", "categories": "Home Services, Apartments, Real Estate", "city": "Goleta", "state": "CA", "stars": 4.5, "business_review_count": 32, "predit_yelp_score": 2.55, "actual_yelp_score": 5.0}, {"review_id": "acR7x4VJhDAY1hEDGDQawA", "user_id": "DOrXzGTrLZlPRkFA6nlsyw", "business_id": "0jpFptAehZhLl3nkhHDanA", "review": [["Everything was delicious, from the bread, drinks, meal, and dessert. We ordered the seared wild salmon and pasta with miso butter. Everything was perfectly cooked  and seasoned. The drinks were strong yet flavorful. The Goleta lemon dessert was worth the $14. Service was excellent and the outdoor heaters kept us warm."]], "date": "2020-11-18", "time": "18:33:15", "categories": "Restaurants, Event Planning & Services, Hotels, Hotels & Travel", "city": "Santa Barbara", "state": "CA", "stars": 4.0, "business_review_count": 331, "predit_yelp_score": 2.5999999999999996, "actual_yelp_score": 5.0}, {"review_id": "Fyjikxza3LzSrpgTOvsssA", "user_id": "R2487925nS1v6I0bPfFUCw", "business_id": "NxCSxeL-OG2WHYtaB8lKUQ", "review": [["Ordered a large order through door dash a week ago. Was informed this MORNING the order could not be completed. Then we tried to place an order for pick up online and couldn't.  So we then called to see if they had the product we wanted. We're put on hold immediately TWICE. Waited for about 8 minutes to then speak with the RUDEST most unhelpful old country ladies I've ever spoken too. She wouldn't even listen to the order we were trying ask about. Kept interrupting us and eventually told us she had a \"multitude of things\" and we should just come into the store. This was easily one of the worst customer service experiences I've ever had. I wanna buy the ham just to throw it at that lady then never shop with y'all again."]], "date": "2020-11-25", "time": "18:14:30", "categories": "Specialty Food, Restaurants, Event Planning & Services, Food, Meat Shops, Cafes, Caterers, Sandwiches, Delis", "city": "Metairie", "state": "LA", "stars": 4.0, "business_review_count": 18, "predit_yelp_score": 0.35000000000000003, "actual_yelp_score": 1.0}, {"review_id": "dHn7rn0d1sHZwC62kTHOGg", "user_id": "5P7aZ4HEiYSP64VYqt321g", "business_id": "OHIEmhBx2SezWLaHPUljdA", "review": [["Do yourself a favor and go in.  You will not be disappointed.  Pizza, lasagna and fettuccine was all wonderful and generous!!!"]], "date": "2020-12-09", "time": "19:22:24", "categories": "Cafes, Italian, Restaurants", "city": "McCordsville", "state": "IN", "stars": 4.0, "business_review_count": 78, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}, {"review_id": "6-oV59DHel6XO-19CuIysQ", "user_id": "3saqeX35XN_Lg8gYX2A1BQ", "business_id": "cEN8j6jL0OJ0zhe-AX58Hw", "review": [["Amazing quality ice cream with fun flavors.\n\nRushed over to this location for a late dessert run and arrived just 5-10 minutes before they closed. I was worried we weren't going to make it since there were a handful of parties in front of us but rest assured, they were willing to serve everyone who got in line before closing time!\n\nI tried:\n- Churro - This flavor contains churro chunks which absolutely blew me away! Really unique and perfectly executed. Definitely ordering this again! I would imagine it pairs well with any other flavor.\n- Turkish Coffee - Really bold flavor, great for coffee lovers who appreciate a strong coffee taste\n- Earl Grey & Shortbread - Also had a pretty bold flavor (can definitely taste the earl grey), yet it was still light on the tongue since it's based on tea, which was a nice touch. Contains floral notes. I ordered this with the Turkish coffee but I'm not sure if I would do that again since both flavors were strong but in different ways if that makes any sense? Not the best combination.\n\nAnyway, the ice cream was the perfect consistency. Nice and creamy with prominent yet balanced flavors. McConnell's knows how to do ice cream right."]], "date": "2020-12-03", "time": "07:02:06", "categories": "Ice Cream & Frozen Yogurt, Food, Desserts", "city": "Santa Barbara", "state": "CA", "stars": 4.5, "business_review_count": 156, "predit_yelp_score": 1.7500000000000002, "actual_yelp_score": 5.0}, {"review_id": "tWzfCbsIMR8ri8YGE_Sd_A", "user_id": "yFKla-hVwDrv7Szfgf6wXA", "business_id": "LF345DbujTmE6r3roQtB_A", "review": [["These guys did a great job dealing with my 2004 Toyota which had numerous diagnostic code issues. Ivan was professional, personable, and patient in getting the issues resolved! He fixed the problems which the Toyota service shop was never able to do, at a much more reasonable price."]], "date": "2020-12-03", "time": "01:23:27", "categories": "Auto Parts & Supplies, Automotive, Transmission Repair, Hotels & Travel, Car Rental, Tires, Auto Repair", "city": "Santa Barbara", "state": "CA", "stars": 5.0, "business_review_count": 17, "predit_yelp_score": 1.775, "actual_yelp_score": 5.0}, {"review_id": "jYsFwXFcTjA1eoucikiKSw", "user_id": "M6GhCo2b6PjirUSLb0IgZg", "business_id": "qXkrrQPVesVxJwEfhFYH2g", "review": [["This was my first time back to this location for nearly a year. That time and the couple times before it service wasn't very good. Nowhere near what I've come to expect from Chipotle. I'm happy to report that, at least during this visit, the service has improved. The employees were friendly and not rushing me along like they used to.\n\nMy only complaint was that they were completely out of both white and brown rice (which are the main base of the burrito bowls). I ordered them anyway but it did have an effect on the overall taste (I probably should've just went with actual burritos instead). The \"new\" queso, while an improvement from the old version, still wasn't that great and about a third of the chips I received tasted stale."]], "date": "2020-12-07", "time": "22:23:00", "categories": "Restaurants, Mexican, Fast Food", "city": "Sparks", "state": "NV", "stars": 3.0, "business_review_count": 116, "predit_yelp_score": 1.05, "actual_yelp_score": 3.0}, {"review_id": "aZTL_uQbbgKhYOaxwnRqig", "user_id": "23Q0Mw3XtJe7nDkGynOj8Q", "business_id": "hDSyFEF7yP1l1mdEQcOl9g", "review": [["Thank you Jordan for going above and beyond to remedy my dilemma yesterday evening. I appreciate your professionalism, customer service and courteous nature. Sarah, Sharon and Todd the manager were all very welcoming and accommodating as well during our visit to the Hyde Park Village Pottery Barn Kids location. I will continue to recommend this  location to family and friends."]], "date": "2020-12-06", "time": "21:34:57", "categories": "Baby Gear & Furniture, Home & Garden, Furniture Stores, Shopping, Home Decor", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 20, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "295NNsaAGjvKiAnauRKy6Q", "user_id": "hRh68PE5x9ilwPf0EoIAww", "business_id": "yM-yQ1u68d_ePTxI6d0dcw", "review": [["There was a repeated lack of effort I observed here. Unless I spoke to staff first I was not acknowledged. They shut off the ice machines rather than clean them.  The \"COVID-19 Breakfast\" consists of your choice of two muffins, yogurt, and hard-boiled eggs. Oh, and a bottle of warm water. They don't even chill it, it just sits by the muffins. Remember, no ice! No cereal, juice, or milk. All of which can be individually packaged.  Coffee is available during breakfast as well but too much effort to keep it in the lobby for guests beyond 10am. Sorry, nothing for the long trip ahead. Worst Hampton Inn experience I've had."]], "date": "2020-12-10", "time": "04:27:41", "categories": "Hotels & Travel, Event Planning & Services, Hotels", "city": "King of Prussia", "state": "PA", "stars": 3.0, "business_review_count": 53, "predit_yelp_score": 0.35000000000000003, "actual_yelp_score": 2.0}, {"review_id": "P3PgoxZ-V0UWnqpCwC_49A", "user_id": "OgCfT9K8ZUOrObMQCAqR9Q", "business_id": "UQ8UKfNSUT0aKu4naioVqw", "review": [["I absolutely love tortorices!! amazing italian sandwiches - great bread and quality of meats and cheeses. My favorites are the Morti and the Matteo and i also love the sundried tomato spread. You can really tell they put a lot of love into these"]], "date": "2020-12-03", "time": "00:28:37", "categories": "Event Planning & Services, Food, Italian, Coffee & Tea, Sandwiches, Restaurants, Caterers, Delis", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 101, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "XpCUwg34WufbMduN9ZkxSg", "user_id": "xchs6nVsO0h8H6UPV5cJFw", "business_id": "YiuvwMY1Ay5H1_cURsD6_Q", "review": [["After seeing many pictures posted on FB I finally convinced my husband to go pick up dinner from Italy to Go.  We got a large cheese pizza and Fettuccine Alfredo dinner.  My husband who eats a cheese pizza twice a week said it was amazing and my pasta dinner portion was huge! I ate leftovers for 2 more days. We will be back food was fantastic"]], "date": "2020-12-06", "time": "03:43:17", "categories": "Italian, Restaurants, Pasta Shops, Pizza, Seafood, Food, Specialty Food", "city": "Glen Mills", "state": "PA", "stars": 4.5, "business_review_count": 5, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "dBSwnlnSTWZQHh2aZArm3w", "user_id": "emSOfiEiYi1op3cE774guQ", "business_id": "OXu8MennU1TFqkHLW9oSTA", "review": [["We stopped by this \"hole in a glass-wall building\" that we knew to be a former spot for a quick bite of bbq and the side fixens' (directly across the street from The Village Inn on Gall Blvd., Zephyrhills, FL).  While I don't recall seeing a sign for it as we were approaching (it's on the right side of the street if you're south-bound), the lights were on, and people were inside and outside (appropriate social distancing).  \n\nAs we entered, we were greeted by the vibrant Owner and Chef, Orlando.  We learned that he purchased the restaurant just 3 weeks ago; it was obvious that he and his crew were working hard \nto get things up-and-running with freshly painted bright yellow walls, \"fun reggae music\" playing, a bright painting of Bob Marley on the wall and the delicious smell of BBQ as soon as we exited our car.  \n\nBe sure to check out the picture of my ribs.  That massive serving was only $17.00.  I will get 3 meals from them.  I chose steamed cabbage and yellow rice as well.  While the serving sizes are large, the rich flavors are even larger!!!  The food was absolutely superb and cooked to perfection!!!  The meat literally fell off the bones.....YUMMMM!!!\n\nBe sure to bring cash, because at this point, they do not accept credit cards.  \n\nBe sure to give this new restaurant a try!  Let's support our \"Mom and Pop\" restaurants and stores; particularly during this time of Covid!\n\nAlexis B.\nZephyrhills, FL"]], "date": "2020-11-18", "time": "00:54:25", "categories": "Grocery, Food", "city": "Zephyrhills", "state": "FL", "stars": 4.0, "business_review_count": 8, "predit_yelp_score": 2.45, "actual_yelp_score": 5.0}, {"review_id": "ASOWcHxqpwhKJRQZXTw4xQ", "user_id": "WRppcPasBFcQV8KLXj3jnQ", "business_id": "GwKila2gkEAmYadVFvazNw", "review": [["Sad.  We went because we heard great things, but it's just Boca with another name...literally.  Started hubbys graduation dinner with him covered in my cocktail thanks to a very sweet and apologetic waiter.  Management was very nice and though hubby wanted to leave we stuck it out.  But the steaks and sides we solidly meh.  There's no kids menu and the Mac and cheese was SO garlicky our 6 year old would not eat it.  I like the Brussels but hubby thought they were more mush than char.  The dessert menu was all bourbon which we don't care for.  The cheese board was SUPER disappointing except for the honey and soft cheese which was magnificent...unfortunately the cheese was so hard we couldn't really eat it.  Service was solidly meh as well. I hope they bring this place around bc it has such amazing potential.  Side note the manager did comp our meal so we may give it another go."]], "date": "2020-12-06", "time": "00:16:54", "categories": "Restaurants, Nightlife, American (Traditional), Bars, Steakhouses", "city": "Riverview", "state": "FL", "stars": 4.0, "business_review_count": 235, "predit_yelp_score": 1.2, "actual_yelp_score": 2.0}, {"review_id": "8IPsmaqhByKz-S_jTW2N9A", "user_id": "vn0v-mxWSrOjKNemT0r04Q", "business_id": "gF89sbV7mr0SYBKetRFwwQ", "review": [["Boise River Greenbelt is Amazing! I've walked a lot of it. I've ridden my bike on a lot of it. It never gets old. Seeing the seasons change is one of the fun parts. It's a great walk for dogs on lease. The open air allows for social distancing, which means no mask during Covid, although some choose to wear a mask.\n\nRecently I came across a special area where someone put a container of chalk for writing. Many had taken this as an opportunity to put into words their feelings. It was obvious the Greenbelt has impressed many. See the pictures below to see a few of the comments. \n\nAnd it you want to come add your own... I would encourage you to do so."]], "date": "2020-12-04", "time": "21:29:55", "categories": "Parks, Active Life, Hiking", "city": "Boise", "state": "ID", "stars": 5.0, "business_review_count": 55, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "SA70qVgs9phwENFL4c8JwA", "user_id": "LqWjijDBYSFiqHqzELwc9A", "business_id": "V4WIP6XR8cF-vj2GpwhDhw", "review": [["POOR CUSTOMER SERVICE!!!  I ordered a delivery and when my order arrived, part of the order was missing.  I called the restaurant and the person who answered the phone said I had to go online again and place another order and they would put the missing item with that order.  I explained that I didn't want to place and pay for another order to get my missing items.  They had no other solution and Carlos, the manager was too busy to talk to me.  I left my phone number, but have not received a return call."]], "date": "2020-12-02", "time": "05:15:43", "categories": "Restaurants, Southern, Fast Food, American (New), Chicken Wings, American (Traditional)", "city": "Sparks", "state": "NV", "stars": 2.5, "business_review_count": 149, "predit_yelp_score": 0.42500000000000004, "actual_yelp_score": 1.0}, {"review_id": "JhDk4StUjqp7nuxRVFtH_g", "user_id": "XExKZQpwYhUzG-a2Mtk1bw", "business_id": "-lhHSR1Aws4CyYC1XOPVTw", "review": [["I am obsessed with their Greek salad. Yum yum yum best Greek in Tampa! My 8 months pregnant self has craved this every week."]], "date": "2020-12-03", "time": "16:32:39", "categories": "Greek, Restaurants, Sandwiches, Cafes, Salad", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 156, "predit_yelp_score": 2.275, "actual_yelp_score": 5.0}, {"review_id": "Ty2uTadnhV5JC4tVnpk_IQ", "user_id": "n4kAJbiZZhD7Aj4qfyueyw", "business_id": "x1IQQIcAwdmknhiZOi95Pg", "review": [["This was very tasty! We had a free Spicy Garlic Shrimp sandwich and Truffle Fries, so we decided to add two other sandwiches and another side: Thai BBQ Pork and Chicken Teriyaki Katsu with a side of the Sunomono (pickled cucumbers). All three sandwiches were toasted on delicious bread and stuffed perfectly. The Thai BBQ Pork had a pickled cucumbers, daikon, carrots, and Jalapenos. It had a great crunch and was a perfect blend of sweetness sand tanginess. This was my favorite out of the three!\n\nWe also enjoyed the Spicy Garlic Shrimp. It was similar to tempura shrimp with not too much batter (which I really like) and paired well with the arugula and sweet & spicy aioli. The Chicken Teriyaki Kastu was stuffed with a lot of lettuce and coleslaw and had a sweet sauce and much better than a typical fried chicken sandwich! \n\nThe cucumber and fries were a nice side addition. I wasn't a huge fan of the truffle fries, but loved the Sunomono! It was sweet and tangy and went well with all sandwiches. We will definitely be back to try some other dishes (the ramen sounds good too :-)). \n\nThanks for partnering with Yelp and giving us a chance to try this delicious food!"]], "date": "2020-11-22", "time": "15:59:15", "categories": "Restaurants, Korean, Cheesesteaks, Barbeque, Sandwiches, Ramen, Asian Fusion, Japanese", "city": "St Louis", "state": "MO", "stars": 4.5, "business_review_count": 84, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "ZXHVpo992YOmoPN_5UV_FA", "user_id": "zbkG42YPwnwwHJCH-MTpug", "business_id": "DaCMNepPCk3XxFh8dAiX_w", "review": [["A little too crowded for my comfort level but a nice bike path trail with some great views of the river, peaceful, quiet and serene. Some sand and some root branches growing underneath path. Watch some path areas carefully."]], "date": "2020-11-26", "time": "15:03:19", "categories": "Parks, Hiking, Active Life", "city": "Riverview", "state": "FL", "stars": 4.0, "business_review_count": 11, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "3KhjxHP1pA_JO2JQmL6rog", "user_id": "M9TN0AsrwHEs5h8xOsdaCQ", "business_id": "AWXIXCNv-UlMIrksJNfzXg", "review": [["I had a very mixed reaction to the pet mechanic Fishtown. I had an appointment for my dog to get his booster shots, but the night before I noticed his eye was  red so I called to see if they can take a look at it the next day while he was there for his booster, the guy I talked to said yes, it shouldn't be a problem. \nWhen I got there the next day the tech came to get him for his booster and I mentioned the eye and she told me that there was no way they could look at it since it was a appointment for a booster; to get his eye looked at I would need to make a separate appointment. I said if you could just look at his eye, I'm not asking you to do anything, just look into is high and make sure it's not scratched. She informed me again (kinda rudely) that that was some thing I would need to make a separate appointment for, and pay a separate exam fee for. I was pretty upset at that point but luckily the lady at the Front desk was really nice and gave me some suggestions of what I could do and what I could look for to make sure that nothing was scratched. Luckily she was there to make up for the disappointment I had. \n\nMy other experiences with the vet have been good,"]], "date": "2020-12-09", "time": "02:27:24", "categories": "Veterinarians, Pets", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 11, "predit_yelp_score": 1.55, "actual_yelp_score": 3.0}, {"review_id": "wkDVE-OIiBK6BvxgGQBmPg", "user_id": "dDVZQ2ilDyuWvALycHwQHw", "business_id": "wTDuyCnQuPEvArtcX46FFQ", "review": [["A favorite breakfast spot of mine. Lots of options to choose from, and the portions are huge. Everything is so fresh and tasty!!"]], "date": "2020-12-05", "time": "20:18:48", "categories": "Restaurants, Breakfast & Brunch, Cafes, Mediterranean, American (New), Pizza, American (Traditional)", "city": "Clearwater", "state": "FL", "stars": 4.0, "business_review_count": 25, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "_ckoXbrh6gj_sf5TcUkA4w", "user_id": "1Os5zImBF5dOrYdGOU-2Xg", "business_id": "YT1oM3AlNSCjzKvbH8MPWA", "review": [["Love juniper! Delicious, creative food and very warm and friendly service! Excellent cocktails too. They are working so hard to outlast COVID! This local restaurant is worth a visit."]], "date": "2020-11-28", "time": "01:24:37", "categories": "Restaurants, Bars, Southern, American (New), Nightlife", "city": "Saint Louis", "state": "MO", "stars": 4.0, "business_review_count": 407, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "9Uxy6oHtQ8Z1pIQC4crB7g", "user_id": "OdDajy5bPsgB6hp48V8y1g", "business_id": "gytqFU8j-b6dpNcLEwMDYQ", "review": [["If you love Chinese bakeries, then Sweet Buns Bakery is definitely the right place to go for all your favorite savory and sweet buns and other yummy pastries. I love Asian bread from these kind of bakeries - they really have something for everyone. \n\nSometimes I crave sweet red buns which they have - but I recommend getting their fresh baked red bean bun instead of the pre-packaged one that they also sell. When I took home the pre-packaged one, it just crumbled and was kind of hard when opening it. Choosing a red bean bun from the window display is a much better (and fresher) choice. Their Almond Taro buns are also awesome - not too sweet which is how I like it :) When I'm craving something savory, they have these breakfast egg and ham breads that are pretty tasty. The hot dog one is my favorite savory one there. \n\nThe price of each bread item is really affordable, especially for the quality and quantity that you get for it. This is definitely good news for college students, especially USF students - this location is just minutes away from the Tampa campus."]], "date": "2020-11-17", "time": "18:27:01", "categories": "Custom Cakes, Restaurants, Chinese, Food, Bakeries", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 151, "predit_yelp_score": 2.25, "actual_yelp_score": 4.0}, {"review_id": "SsdheDKcL6v2XcMzghhBbg", "user_id": "Os9tf455ZiCXYl94Tc7mCQ", "business_id": "gWtfAb3VVOSApDXrlOg5Aw", "review": [["Good service but I was astounded to observe dogs running loose which is a violation of Fl law with serious fines."]], "date": "2020-12-07", "time": "19:45:18", "categories": "Hair Removal, Waxing, Nail Salons, Beauty & Spas, Eyelash Service", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 155, "predit_yelp_score": 0.025, "actual_yelp_score": 2.0}, {"review_id": "LwBjyqYg-ktJBKKi8slQSQ", "user_id": "ponsuLTjeP_Bs0quJA5spA", "business_id": "VGzkEiZz7gqK_SYW86GlaA", "review": [["Visiting Nashville for 2 days and had to eat here TWICE. I couldn't leave before eating this again. Service is great, very friendly and helped with understanding variations of dishes. We tried the steak noddles which were delicious, but the dumplings is where it's at! Steamed buns hit the spot too, for a cold wintery night. Don't forget to try with their hot oil/chili oil sauce- sichuan peppers for the win !"]], "date": "2020-12-07", "time": "13:10:31", "categories": "Noodles, Restaurants, Szechuan, Chinese, Juice Bars & Smoothies, Dim Sum, Food", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 320, "predit_yelp_score": 2.125, "actual_yelp_score": 5.0}, {"review_id": "QHnpjc57RaYklsB-vNrcyA", "user_id": "iPkdNziqnhNukjnmsrSzmg", "business_id": "tKokqylsnieTLhDbWxZgfQ", "review": [["Juanita's is one of three restaurants operating inside the old Urban Eats café. There is a bakery and a Saturday pop up taqueria. Juanita's is the largest.Carry out only at this time for all three. \n\n I had the sweet potato soup, it was much thicker than a soup, but vegan with coconut milk and absolutely delicious.  It could also be used as an interesting side dish to a meal.  Yum.  The shrimp po boy was good and reasonably priced.  The masque choux (creole corn) was also a delicious side.  Portions were large.  Service is a little slow as it's one guy cooking and taking orders most of the time. However, if you call your order in ahead of time you will have much better luck. Very nice, super large portions, and affordable. \n\nRecommend."]], "date": "2020-11-22", "time": "23:39:09", "categories": "Cajun/Creole, Restaurants, Seafood, Soul Food", "city": "St. Louis", "state": "MO", "stars": 3.5, "business_review_count": 18, "predit_yelp_score": 2.325, "actual_yelp_score": 5.0}, {"review_id": "ECtIrOXyUCbdWCrdPFiRDw", "user_id": "u2rlo2GIzJw88yrrfsgzEg", "business_id": "VaO-VW3e1kARkU9bP1E7Fw", "review": [["Great dinner spot! Oysters were great and fried shrimp were perfect! Luckily there was no wait for us at 430."]], "date": "2020-12-05", "time": "21:56:55", "categories": "Restaurants, Sandwiches, Seafood, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 3966, "predit_yelp_score": 2.425, "actual_yelp_score": 5.0}, {"review_id": "RUxCbxfpoGBnXGvnwptdsw", "user_id": "w5TqpDnJ7BExQXI-2d8ZEw", "business_id": "wyPU3aFPNn7AO83de3tPMQ", "review": [["This is solid place for a game night with friends or a date. I always receive great service at each outlet (bar, bowling, arcade, etc.) \n\nI tried their BBQ Bacon Cheddar burger and I was not impressed at all and the fried pickles were extremely salty so I'm not sure if I caught them on an off day or the food is just a hard pass.  \n\nThe arcade games are fun and the card prices are pretty feasible. They also have discount days (Tuesday/Wednesday) that really allow you to get the most bang for your buck.\n\nOverall, I think it worth the money for the experience and it's also well maintained."]], "date": "2020-11-23", "time": "05:30:01", "categories": "Arts & Entertainment, Active Life, Venues & Event Spaces, Event Planning & Services, Bowling, Arcades", "city": "Smyrna", "state": "TN", "stars": 3.0, "business_review_count": 30, "predit_yelp_score": 2.025, "actual_yelp_score": 4.0}, {"review_id": "hnOPGhI9AJ0m1kGku1deyQ", "user_id": "Gw_PUqVT9e4AiC_kj9BJJw", "business_id": "n9uQrKjd7Yn35NA3vGRtpw", "review": [["Stopped in for lunch with my wife. I have been there before, but it had been a while. Buffet was busy, but not crazy. All the food seemed to be fresh, but lacked any sort of flavor. Lo Mein tasted like oil and plain noodle. The mei fun tasted like cardboard. Besides those two items, and the sushi, there were no other oriental foods present today. One of the worst buffet food experiences I've had."]], "date": "2020-11-29", "time": "19:21:56", "categories": "Buffets, Restaurants, American (Traditional), Chinese, Japanese", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 420, "predit_yelp_score": 0.7000000000000001, "actual_yelp_score": 1.0}, {"review_id": "ILrZcW0VYv7klL5StOZivQ", "user_id": "9-dMJvut-u1nZRy0e_yp6Q", "business_id": "8tJWgFe3ztfxYg3YWcw3rA", "review": [["The ladies hooked me up ! They are so kind helpful , and meticulous in their care of my nails ! I am very picky and I am so happy with the  service here , highly recommend to you !"]], "date": "2020-11-17", "time": "00:58:35", "categories": "Eyelash Service, Nail Salons, Beauty & Spas, Hair Removal, Waxing, Permanent Makeup", "city": "Goleta", "state": "CA", "stars": 3.5, "business_review_count": 201, "predit_yelp_score": 2.8249999999999997, "actual_yelp_score": 5.0}]