[{"review_id": "dxD1Q1gflTPCRuUB-Vb2-A", "user_id": "DaUNgt5cEguvgzH_bHNDoQ", "business_id": "VHw4q0f8WmajCUD2wGXBDA", "review": [["Great food, hipster vibe atmosphere, good service, and awesome value. My daughter had the avocado toast and the bread was amazing. My cousin's omelette was a generous portion with immaculate presentation. I enjoyed the lemon dressed greens and a vegan friendly quinoa bowl."]], "date": "2019-12-07", "time": "23:53:01", "categories": "Breakfast & Brunch, Restaurants, Cafes, American (Traditional)", "city": "Hermitage", "state": "TN", "stars": 4.0, "business_review_count": 369, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "r8h0Ex9BriqEBFc20xH5xA", "user_id": "7zUYzHfjVdln5TYgkazgDg", "business_id": "E1R5kDIN-ij1--MAD2qmHA", "review": [["I like the food. It's one of the better Italian/ pizza places around here. They used to have their own delivery drivers not too long ago, and now they use DoorDash and other delivery services instead, which I'm not a big fan of personally. I ordered an entree tonight that came with a salad, and my salad was open and dumped out in the bag. I was a little disappointed with the customer service when I called the restaurant and let them know, and they were not apologetic but instead the person on the phone just said \"the box was closed when I put it in there.\" Nothing was offered to me for the inconvenience and food I couldn't eat, and when you order through their online platform the order isn't on your doordash account to request a partial refund or anything. I had to ask them if I'd be able to get another salad next time or something, which is kind of ridiculous and they should have offered a replacement or a partial refund for not receiving a component of my entree at the very least. I probably will not order delivery from them again, but I may dine in. I've never done that before, so I wonder how the customer service would be in person, though."]], "date": "2019-12-05", "time": "00:23:14", "categories": "Seafood, Restaurants, Cocktail Bars, Beer, Wine & Spirits, Pizza, Greek, Food, Bars, Italian, Nightlife", "city": "New Port Richey", "state": "FL", "stars": 3.5, "business_review_count": 118, "predit_yelp_score": 2.0, "actual_yelp_score": 3.0}, {"review_id": "wAYM2qPKMp5XYHGNRwnRpQ", "user_id": "wfNBNCgw0V_VqNidUYtG5g", "business_id": "dIlBaGLoCFL9e8gNy4Y07Q", "review": [["Food is fantastic. However, I would suggest eating at the restaurant as opposed to ordering for delivery. I have had my order cancelled no less than 5 times since this place opened and the frustrating part is that the restaurant waits until 30 minutes after your order is placed before letting you know the order can't be fulfilled. Again, food is great but they have a long way to go when it comes to customer service and consistency of service."]], "date": "2019-11-21", "time": "01:45:20", "categories": "Restaurants, African", "city": "Ferguson", "state": "MO", "stars": 4.5, "business_review_count": 17, "predit_yelp_score": 3.3000000000000003, "actual_yelp_score": 3.0}, {"review_id": "xHNmmvZEAU8gTa6qePdgxA", "user_id": "V7ZazFPTA7VGWGhK8DguNQ", "business_id": "Ko7_LgCXdFDzj2t0trVvWw", "review": [["I believe this to be a true hidden gem in St. Pete. It's almost tucked away from everything. It's felt like I was entering a secret garden. Upon entering, I loved the ambiance and noticed it would be a superb party space. As we walked around, the ping pong table, arrange of board games, and comfy couches signaled to my wife and I that we would have a great time. As we approached the counter, we were told that we would be our own beertenders. I clapped my hands with excitement despite my age. I loved this concept and couldn't wait to begin. \n\nHow it works: 1. you show your IDs. 2. Get cool bracelets that act as your tab. 3. Provide card to hold on file 4. Get a wristband 5.Grab a glass 6. Pour, Pour, Pour 7. Have Fun! \n\nIt was so awesome. I would definitely go again. You will loved the vibe. We had a great night and at the end they close out your tab from your wristband."]], "date": "2019-11-28", "time": "20:27:52", "categories": "Beer Bar, Nightlife, Bars", "city": "Saint Petersburg", "state": "FL", "stars": 5.0, "business_review_count": 75, "predit_yelp_score": 4.7, "actual_yelp_score": 5.0}, {"review_id": "rNXp5SFH6Bf5tQB2NrUpMw", "user_id": "5Ovru0RwEPc5WAN6uZ4vpg", "business_id": "bj0RCI6nDYcaJfWQk377Zw", "review": [["I love noodles & Co, it's one of my favorite places to eat. But the past 2 times I've been to this location I've had a bad experience. The past two times I've ordered something I don't normally order & the cashier asked me what was in it, what size it comes in, as if I was supposed to know the answers to that ? Then today when I came In I walked right up to the cashier & she told me someone else would take care so was patiently waiting because the she was counting her drawer. And there were 4 or 5 others standing right behind her talking. After a minute or two one of them turns around & says she can take care of you. It became sort of awkward because the cashier got mad that she couldn't continue counting her drawer. I just think management needs to work with their staff."]], "date": "2019-12-11", "time": "16:47:31", "categories": "Comfort Food, Fast Food, Specialty Food, Pasta Shops, Food, Restaurants, Salad, Chinese, Noodles, American (New), Asian Fusion, Italian", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 84, "predit_yelp_score": 2.2, "actual_yelp_score": 2.0}, {"review_id": "KuZNabsuZnB6OGxpla4XvQ", "user_id": "5Sj_hfndtgBrHhBhJ3Bl1Q", "business_id": "qaFizW202p1-BJzmai_Z_g", "review": [["This place RULES! Danielle, Joe, & Tim made my week with their amazing customer service and super fast work on my car. Few places really take the extra time to make you feel at ease, and to help you out, and this is definitely one of those places."]], "date": "2019-11-22", "time": "21:50:51", "categories": "Auto Repair, Body Shops, Automotive", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 33, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "wD3viOfw3WFMrwHzwDXZ8Q", "user_id": "chq0Ycuf0tTbX-7FaqD3uA", "business_id": "VRbgrqNCR5914pV-KWBwYQ", "review": [["Great service and prices. Avi and Gabe are amazing. Jeff students get $5 discount. Highly recommend this place. I have been going there for the last 3 years"]], "date": "2019-11-23", "time": "15:46:40", "categories": "Barbers, Beauty & Spas", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 133, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "_fWVRdhXWvxq12XWS7VmTA", "user_id": "SKaMg0OgwfOERtHvG23nSg", "business_id": "31SiCMlOzoEXj03BrOIDkg", "review": [["We had our home inspected by TriCounty (we were the sellers). Among other things, they left the heat on and set to 80 degrees in our living (in mid-August) which caused the air conditioning unit to malfunction, which we'll now have to repair (the unit had just been serviced a few weeks earlier), they left a screen off a downspout on the roof, left a diverter off the house's main drain pipe, left our master bathroom window ajar and, perhaps worst of all, left a door off a crawl space in the basement and left the crawl space itself a mess. \n\nThey also incorrectly concluded that a radiator had leaked (we've never had a single radiator leak) because the carpet near it was damp -- the carpet had just been shampooed. Besides, it was mid-August, the radiator wasn't even on!\n\nI've bought and sold several homes and am a licensed realtor. I have never seen a more unprofessional inspection. Not even close."]], "date": "2019-12-06", "time": "19:11:03", "categories": "Home Services, Home Inspectors", "city": "Morrisville", "state": "PA", "stars": 2.5, "business_review_count": 10, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "DCqpcNAsMWLKReRjKT_eFg", "user_id": "6Bmj0mnzg4465hdkfgtvyg", "business_id": "ZBTVbCcc8OabC9Q5rIaGlw", "review": [["Upon the request of restaurant management to give them a second try after our first experience, my family decided to stop by today (11/20/19) to do so. \n\nToday's experience was SO much better than our initial experience. Our waitress provided better service. The wait time for both service and food was very reasonable this visit."]], "date": "2019-11-20", "time": "19:45:35", "categories": "Cafes, Restaurants, Breakfast & Brunch, American (Traditional)", "city": "Riverview", "state": "FL", "stars": 3.5, "business_review_count": 29, "predit_yelp_score": 4.95, "actual_yelp_score": 3.0}, {"review_id": "XYBMlCP5g7_ocZaoyqwKgg", "user_id": "tLCYcCehQbZ8bpa8rrApkg", "business_id": "QKMcd70-hcc23OzOoBIItQ", "review": [["I made an appointment at the last minute the week before.  I was really happy with my cut and highlights. Tiffany did a great job on my hair and the cut looks like something I can do on my own. Close to home and more affordable than other salons.  Glad I found a place in my area!"]], "date": "2019-11-27", "time": "03:01:40", "categories": "Hair Removal, Hair Stylists, Hair Salons, Waxing, Beauty & Spas, Barbers, Tattoo, Nail Salons, Makeup Artists", "city": "Lutz", "state": "FL", "stars": 5.0, "business_review_count": 11, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "77s_GxgmHga8BuzhCmIkkQ", "user_id": "dvuk2AH4MSH5gWln1WwKAg", "business_id": "Zmd_cArjIEkAKlJE35iOkg", "review": [["Came in for lunch with a colleague around 12pm and was able to walk right up to the register. The place is definitely well staffed. Ordered and got clarification about options with easy. Place was clean but definitely busy. Food came out quickly and was good. Will return."]], "date": "2019-12-12", "time": "22:22:36", "categories": "Sandwiches, Soup, Food, Breakfast & Brunch, Bagels, Salad, Delis, Restaurants, Bakeries", "city": "Pinellas Park", "state": "FL", "stars": 3.0, "business_review_count": 59, "predit_yelp_score": 4.175000000000001, "actual_yelp_score": 4.0}, {"review_id": "XKpJW35QV88HNzAsXqCYwA", "user_id": "KR5jXb96ao9MNcbazoUu2g", "business_id": "qrN2KI5z4PJJ3kWwfatNWA", "review": [["This place is just awesome--best bagels in South Jersey! We've been coming here for 5+ years now (so this review is clearly long overdue).\n\nTheir breakfast sandwiches are incredible! My go-to is the Pork Roll, Egg Whites, & Pepper Jack Cheese on a Toasted & Scooped Egg Bagel with Black Pepper & Ketchup (complicated, but they manage to get it right...deliciously right!). They have a wide array of bagels, deli meats, muffins (Double Chocolate muffin here is amazing!), fresh squeezed orange juice (as in they make it when you order it), coffee, and all the likes.\n\nReasonably priced phenomenal bagel sandwiches...YUM!"]], "date": "2019-11-22", "time": "00:32:44", "categories": "Food, Bagels", "city": "Swedesboro", "state": "NJ", "stars": 4.0, "business_review_count": 40, "predit_yelp_score": 4.6499999999999995, "actual_yelp_score": 5.0}, {"review_id": "ppF84LTyD607awKryyOLRw", "user_id": "fmlY1qpx3NZknWaacMuQ1Q", "business_id": "CANuOWl6Z4soWkK2_1NWcw", "review": [["Grabbed a snack after a walking tour. Timely and tasty cup of gumbo was a yum. Crawfish etoufee was very good, one of the better Inhave tasted. Crawfish balls to make sure I got fried food for my balanced diet. \n\nPeople behind us had some massive seafood platter of fried goodness which made me salivate. Absolutely would return.\n\nhttps://www.tripadvisor.com/ShowUserReviews-g60864-d15190554-r731239119-Deanie_s_Sea_Food_Kitchen-New_Orleans_Louisiana.html#"]], "date": "2019-12-11", "time": "22:10:45", "categories": "Restaurants, Seafood, Mexican, Southern, Cajun/Creole, Tacos", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 167, "predit_yelp_score": 4.15, "actual_yelp_score": 5.0}, {"review_id": "G3fp9gaHhAL5wBk6NF6yHw", "user_id": "0v3qJP6FunM4wN-o-xdqFg", "business_id": "_iDDqhphfpvrDxKjFa9Ofw", "review": [["I dropped by after work to try a couple of the baked goods. I've had the La Parisien before and it was good so I was optimistic. I got the chocolate tart and the egg nog cheesecake. I was definitely disappointed. The chocolate tart was bitter almost like it was made with unsweetened (not even semi-sweet) chocolate. They don't have descriptions on the desserts, so I'm not sure if that is the intended flavor or if the chef forgot the sugar and vanilla. The egg nog cheesecake was equally as disappointing. WAYYY too much nutmeg. The texture was good though so MAYBE the vanilla cheesecake is better ‍ I gave them 2 stars instead of 1 because I only tried two of their desserts and the La Parisien was satisfying. Maybe I made poor choices, maybe they're just not good. I don't know."]], "date": "2019-12-07", "time": "01:42:06", "categories": "Bakeries, Sandwiches, Food, Restaurants", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 386, "predit_yelp_score": 1.275, "actual_yelp_score": 2.0}, {"review_id": "1RdO3sESyEsqF42tNj1zrw", "user_id": "xETfyiW7Uhwcr5pBptpOIg", "business_id": "kuUgMFCIQAGFZX4rk4jj0Q", "review": [["I've passed this place a few times in the PHL airport but I've always been in a rush to catch a flight until today! I was SOOOOO EXCITED to try it because the menu sounded delicious and their specialty is fried chicken  (& I mean, fried chicken, DUH)! So, having time today before my flight I said let me stop in....and even though fried chicken was what I thought I'd be having, I saw a TRUFFLED ASPARAGUS GRILLED CHEESE ON SOURDOUGH on the menu so I immediately said CHANGE OF PLANS! (I will make it my business to come back again for the chicken). Again, super excited for this sandwich  because I mean grilled cheese, but on sourdough and with TRUFFLED asparagus (& onions and mushrooms). When it came out I was still excited because of the presentation....however, upon trying to take these pics of it, I realized there was literally NO DAMN CHEESE  ! Then upon biting in there was NO TRUFFLE ANYTHING!!!!! UGHHHHH!!! I could've should've wish I would've had the damn fried chicken anything . Food Disappointment at its \"Best\".... Oh, but the chicken noodle soup was chicken noodle soup and was decent. That's what's saving the review along with the thick cut sourdough bread the veggies and cheese essence of my \"truffled grilled cheese\" was on. Guess I'll go catch my flight"]], "date": "2019-11-24", "time": "19:33:34", "categories": "Breakfast & Brunch, American (Traditional), Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 46, "predit_yelp_score": 2.6499999999999995, "actual_yelp_score": 3.0}, {"review_id": "lmpXp1OMFOgPfL2E03ZFIQ", "user_id": "Svf4lN5iZMYf7KMkJ4Y0nA", "business_id": "uJxUDvRd89bHePJOD0-n3g", "review": [["Not quite ready for prime time.  We appreciated the space which is beautifully done, but ambiance is just one part of the story.  What is very lacking here is the service.  We witnessed the sommelier and the hostess exchanging words multiple times and without a care that we could hear them fighting.  Keep this stuff in the back of the house, not in front of patrons.  Service was quite slow, empty glasses of wine and plates left on the table, pretty basic stuff. We received a dish that we didn't order, they took it back but it was on the bill anyway....and $26 for a six ounce piece of swordfish seemed excessive. Hopefully the service improves soon."]], "date": "2019-11-29", "time": "18:32:13", "categories": "Italian, Breakfast & Brunch, Restaurants, Wine Bars, Nightlife, Bars", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 62, "predit_yelp_score": 1.4, "actual_yelp_score": 2.0}, {"review_id": "UV6jYGJIejqqHRx0fCHN0A", "user_id": "kwJYlr64RQ5FPtSmrFnIQA", "business_id": "T96tXd8JRog5KfbGSTDNdA", "review": [["Delivered gorgeous arrangement for my birthday. Extremely conscientious about trying to reach me to hand it off in person safely."]], "date": "2019-12-07", "time": "06:54:33", "categories": "Shopping, Florists, Floral Designers, Flowers & Gifts, Event Planning & Services", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 69, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "EBrsYSI0Fb9WpLwxyZVUSg", "user_id": "fMQl2L4JlYeG_LulySON4g", "business_id": "ASZHu03cP_-ozRGpjokCRQ", "review": [["The best Mercedes mechanic I know. Better than Mercedes themselves. I trust Brian with my sprinter in every way. He takes the time to explain the repairs in detail and reviews everything with you. Mercedes of Santa Barbara does not work on sprinters so go see Brian at Autohaus."]], "date": "2019-11-26", "time": "11:49:37", "categories": "Auto Repair, Automotive", "city": "Santa Barbara", "state": "CA", "stars": 5.0, "business_review_count": 14, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "qnEaPlRDXSxBDQfWlejjlA", "user_id": "_P27j69aQCKDp8D2pDy-0Q", "business_id": "d9bcNc20M6jXF5V1PiujgA", "review": [["Kevin, the bartender is amazing - attentive, warm and kind. 5 Stars!!\n\nSuch a cute spot!\nTwo drinks for $19 - what a steal. \n\nNext time I'm in Philly, I'll be returning to this hidden gem!"]], "date": "2019-11-25", "time": "15:04:21", "categories": "Comedy Clubs, Music Venues, Nightlife, Jazz & Blues, Arts & Entertainment, Lounges, Bars, Performing Arts, Dance Clubs", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 229, "predit_yelp_score": 3.9250000000000003, "actual_yelp_score": 5.0}, {"review_id": "oo_E-30nnGUHdtcxWDwR9g", "user_id": "mqLj6CxvCJ17XyA7mwogkw", "business_id": "5xRmemqmR89BpGoOA25hqA", "review": [["Best Dim Sum. The staff members are friendly and the food is unmatched. Do yourself a favor and put in an order for the molten cake with matcha ice cream upon arrival as it is known to sell out."]], "date": "2019-12-01", "time": "23:13:55", "categories": "Dim Sum, Chinese, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 389, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "nA1ozAjyVkKcK89pZY523A", "user_id": "DBYhpb5hrAYgQjQaMhNYyQ", "business_id": "mPZuMGNWXMnaAOBiVG7jxQ", "review": [["Visited for a birthday party and loved it.  It's well organized from a party perspective.   Staff was friendly and responsive to concerns.  \n\nMy son can't wait to.go back.and run around. He spent a lot of time on this jump dodge game. They do offer a food court and adult beverages as well.\n\nTip: dress your kid in something easily recognizable.   The place is huge and the playground can be hard to find them at times.  A bright shirt or shorts will help."]], "date": "2019-12-01", "time": "12:36:40", "categories": "Active Life, Trampoline Parks", "city": "Noblesville", "state": "IN", "stars": 3.5, "business_review_count": 30, "predit_yelp_score": 3.75, "actual_yelp_score": 5.0}, {"review_id": "TrzgmkxnwFf-K3U_D_tKZw", "user_id": "RlVZdaAqGbkJuXRW6vylkw", "business_id": "pTXFZ_KhkLP4gy6KLRqmhQ", "review": [["We've already filed a complaint with Banfield / Management but felt we should post about our experience in case it helps other pup owners. We have tried 2 locations in the area - the first one was an OK experience but we live closer to this location and thought we'd give it a try based on reviews we'd read. \n\nOur puppy is 3 months old and went in for vaccinations recently. The vet seemed very young and inexperienced. When asked about a medication, she had to go consult someone else. (Our first red flag). When they suggested de-worming, I brought up that she had already had many rounds (this was round 5) and the fecal exam didn't show any last time. (Second red flag) Then when it came time for shots, she injected into a bad location which caused our puppy immense pain that night and into the following day / evening. By the time we got her home, she had started yelping with walking, moving that leg / shoulder, when sleeping and changing positions she'd wake up and yelp and limped. I understand shots can cause a little soreness (just like in humans) but this was not a mild reaction. We have a good size dog (she's over 25lbs already) and was still, eating her peanut butter treat, during the shot. We used the vet chat after hours to get help and then next day when the follow up call came, we felt as though it was brushed off as  just \"something that happens\" with no offer to have her seen or any advice / apology. (Third red flag) \n\nWe have already put in a request to cancel her puppy plan and change to a local vet, not nationwide chain. I'm sure there are a lot of great vets throughout this practice but in middle TN, we are not confident in their abilities."]], "date": "2019-12-04", "time": "18:18:47", "categories": "Pets, Veterinarians", "city": "Smyrna", "state": "TN", "stars": 2.5, "business_review_count": 6, "predit_yelp_score": 0.8, "actual_yelp_score": 2.0}, {"review_id": "Tq_KjDaAebFndg7N5oGffQ", "user_id": "r2ReblfSwWvVIHXK6i6l2g", "business_id": "GBTPC53ZrG1ZBY3DT8Mbcw", "review": [["LA Gulf Oysters just okay. The ones we had were lifeless and not that salty. Nothing like Martha's Vineyard oysters.  The hot quail was just okay too. The ambiance is 4+! Chill music. Good service. The carb bisque--B. Not that thick on the sauce."]], "date": "2019-11-30", "time": "19:32:10", "categories": "German, Restaurants, Seafood, Cocktail Bars, French, Brasseries, American (New), Nightlife, Bars, Cajun/Creole, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 4554, "predit_yelp_score": 3.125, "actual_yelp_score": 3.0}, {"review_id": "U8cJ64F5blyjbiDzZmTamQ", "user_id": "uaccB9kzDcvxYE6QX389ig", "business_id": "k_-2RlfuhX4Jl9OaJaSO9w", "review": [["Kudos to the developers of this hotel. It is absolutely beautiful! We are so excited to have this in our neighborhood. \n\nThe hotel is a wonderful homage to WW2. We ate and had drinks at Kilroy's. The bartenders, Nathan and Kelly were so welcoming and helpful. The menu has such a good variety that we couldn't narrow our choices down. We ordered the Brussels sprouts and crab beignets and both were amazing!!! \n\nWe also went to check out Rosie's on the Rooftop, which seemed like a great spot to hang out with a group of friends, with a fantastic view of the city. We can't wait to try out coffee at Provisions and visit this place all the time!"]], "date": "2019-11-26", "time": "23:00:12", "categories": "Hotels, Bars, Event Planning & Services, Nightlife, Hotels & Travel", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 27, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "OwUI69nXourBKGttKORaQA", "user_id": "vwYG3DobzfdWU6p9juvoOw", "business_id": "X_X2BU-GfaflVrXRFWZkhQ", "review": [["Don't Waste Your Money\n\nI really should have read the reviews before trying this nail salon - my experience was absolutely HORRIBLE!\n\nMy daughter pointed out when we got to the car that one of her nails had already chipped...so back in we went to have it fixed (which they did).  This also gave me a moment to better inspect my own nails - they were horrible!  The paint was extremely thick and uneven, and one nail had been filed down to the quick.  It was late, and honestly, I didn't have time for my entire set to be removed and redone -I was willing to live with it.  However, after both my AND my daughter's freshly painted gel nails (which should last 2-3 weeks) chipped after 24 hours, I called the salon to both complain and request they either refund my money or repaint my nails.\n\nI was pleasantly surprised that the owner called me, and after reviewing the pictures of our nails, offered to redo them for free the next weekend.\n\nAfter reluctantly returning to West Nashville - and waiting an HOUR for them to soak off my nails, it was that thick - we left with newly polished gel nails and hoped for a better experience.\n\nIt is now the Wednesday - 4 days after our new polish - and my daughters nails are chipped up AGAIN.  Clearly, they are not using good product.\n\nI might have given them 2 stars because the owner was amicable to rectifying the problem, but it really didn't solve the issue.   \n\nBottom Line...Don't waste your money!"]], "date": "2019-11-20", "time": "21:39:20", "categories": "Beauty & Spas, Nail Salons", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 118, "predit_yelp_score": 1.625, "actual_yelp_score": 1.0}, {"review_id": "LbFv84poOscETTo3m1rzig", "user_id": "2KEbiCJVkzXWQeIXFTTOBw", "business_id": "6a4gLLFSgr-Q6CZXDLzBGQ", "review": [["When we were in town for a bachelor party back in October, this was our one \"nicer\" meal, and it did not let us down. We came in around 9pm (having calmed at 6pm to secure the table), and started out with some fried gator and cocktails. We had to. We could have started with beer, but the cocktail names were on-point and funny. Everyone loved their mains and dessert too."]], "date": "2019-12-06", "time": "12:36:18", "categories": "Cajun/Creole, Seafood, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 4421, "predit_yelp_score": 4.325, "actual_yelp_score": 4.0}, {"review_id": "xrGLnSsd6BboFxXupVrVxQ", "user_id": "1aaoxDif7veNL1RFdZ0uXQ", "business_id": "DmulwmgbC7Qs1BfB7wx5tA", "review": [["Two stars for the food, 0 stars for service. 5 people at the counter and with the exception of one person, they all looked miserable and we're rude to their customers."]], "date": "2019-12-11", "time": "14:27:45", "categories": "Fast Food, Breakfast & Brunch, Burgers, Restaurants, Chicken Shop", "city": "Kenner", "state": "LA", "stars": 2.5, "business_review_count": 62, "predit_yelp_score": 1.1, "actual_yelp_score": 2.0}, {"review_id": "q7ATCSk3IKPjcSxOh281Dw", "user_id": "3Wo25Eb-5K3Kj9nQNOhyvg", "business_id": "I_mCFePUG2MGuH-zuws7bA", "review": [["I just wanted to say that the vegan ruben is so delicious it is now my fav sandwich in town and I cant stop thinking about it and I had it yesterday and I want it again and and and..."]], "date": "2019-11-20", "time": "20:52:47", "categories": "American (Traditional), Breakfast & Brunch, Desserts, American (New), Restaurants, Vegan, Gluten-Free, Food", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 1227, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "6BAJQqT24MxVlRTRau4SKg", "user_id": "hT2tO5UMxv_XRBkE3C6Cgg", "business_id": "0RuvlgTnKFbX3IK0ZOOocA", "review": [["I suggest taking a friend with you and sharing one sweet and one savoury. Their food proportions especially in the sweets, are huge! Loved both menus that I got esp the Red velvet pancake. Although I didn't try, they have varieties of drink selections as well. Big place, nice people. Loved it."]], "date": "2019-11-29", "time": "17:34:27", "categories": "Restaurants, American (New), Diners, Breakfast & Brunch", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 2679, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "yb2ss50XtIUyy7Reh2vw1A", "user_id": "2vqnHDWKYzzbydKhMJhWhg", "business_id": "wb9P0ipW4ysbgNA9jIl3bg", "review": [["Love this place!!! Great vibe, friendly bartenders... amazing food and prices."]], "date": "2019-12-10", "time": "23:21:17", "categories": "American (Traditional), Burgers, Restaurants, Sandwiches", "city": "Summerland", "state": "CA", "stars": 4.0, "business_review_count": 178, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "dr09xmkV9TIaiehZ6K73cA", "user_id": "wuibbsTCVhNhJzcYTsfu7w", "business_id": "ubrkUuNeJpGegZfpmMLJFA", "review": [["I have stayed at this hotel twice since April, both extended stays for medical reasons (Barnes Jewish Hospital is literally across the street.) In April, we were placed in a room with the IDEAL layout for someone recovering from surgery, with surgical drains still in place - so when I returned in November, I asked for a room of the same layout. \n\nI made the reservation on August 29, for 2 weeks, asking them to please place me in one of the rooms with that layout - and I called at least 7 times in the months leading up to checkin to ask. Each time I was told it wouldn't be an issue. I called the night before and was given the same answer - in fact, the employee went so far as to tell me that they were still empty. \n\nThen, I get there the next day at 3:45 (checkin is at 4:00) and I get told that all those rooms were given away before I got there. The front desk attendant (Karen) was very rude and obviously did not care that I had made the request so far in advance, involving such an extended stay. When I tried to ask if we could simply switch rooms once one of the others became available, she told me to check with her tomorrow. I was going to be in surgery starting the next morning, so I was trying to get it all straightened out for the person who was going to be helping me. However, when I called the front desk to ask how that would normally work out (hypothetically, do we move our belongings? when would we need to be there? etc) she actually told the employee who answered my call to tell me, \"You don't need to worry about moving your stuff anyway.\"  How do I know it was the same person? 1. I could hear her in the background. 2. I asked the poor young man if it was the same woman I spoke with in person earlier that evening and he confirmed it.\n\nAfter all that, while I was in surgery the next day and unable to assist with anything, I was told you did (after you were asked again) offer a move to one of the rooms I initially asked for, but you didn't make the process easy at all - and the person helping me has a prosthetic leg and couldn't deal with all of that on top of my medical issues. He declined the move to preserve his own health (physical and mental at that point.) \n\nI will be returning to St Louis multiple times a year, for extended periods each time - but I will not be returning to this hotel."]], "date": "2019-11-24", "time": "06:59:56", "categories": "Event Planning & Services, Hotels & Travel, Hotels", "city": "Saint Louis", "state": "MO", "stars": 3.5, "business_review_count": 74, "predit_yelp_score": 1.275, "actual_yelp_score": 1.0}, {"review_id": "ry-4qhWPTXsTeCv5SbHVEw", "user_id": "QVIJkkiCZeQZ3JIknVMZXg", "business_id": "9bdM82knQS2q2qLdzst0Qw", "review": [["IF I COULD PUT 0 I would! DONT RENT FROM THESE PEOPLE!! It has been a pain just to get them to fix my heater! I have 2 kids at home, and it's been over a week and it's still not fixed. I have been trying to contact them on several occasions but they show little concern about this. I give them a 0.. Looking for a new place as we speak! DONT RENT FROM THEM!!"]], "date": "2019-12-03", "time": "02:24:38", "categories": "Home Services, Real Estate Services, Real Estate, Commercial Real Estate, Property Management", "city": "Reno", "state": "NV", "stars": 1.0, "business_review_count": 6, "predit_yelp_score": 0.4, "actual_yelp_score": 1.0}, {"review_id": "gG0wk5eUdWmyfAo95vYTaA", "user_id": "BeyW974sLONVz9mNc64lvQ", "business_id": "ww3YJXu5c18aGZXWmm00qg", "review": [["I came alone on a Friday night and this place didn't disappoint. I didn't have a reservation but was seated quickly. I was going to get the shrimp and grits but they had a special for lamb chop and grits which I couldn't pass up. It also had roasted vegetables as well as an amazing sauce. Honestly this was the best meal I have ever eaten in my life. If this was near me, I would eat here all the time! So amazing!"]], "date": "2019-11-25", "time": "19:01:57", "categories": "Southern, American (New), Breakfast & Brunch, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 2756, "predit_yelp_score": 4.525, "actual_yelp_score": 5.0}, {"review_id": "r9DP5EXTtypOnmRwmrt9gA", "user_id": "DGiUO23D5vLVo-0ehsHeJQ", "business_id": "qKtq_mAOMLBonDn73AKXzQ", "review": [["Favorite Thai place.  Very vegetarian friendly. Excellent service.  We always come back and we love bringing guests. We would highly recommend."]], "date": "2019-11-25", "time": "00:32:08", "categories": "Restaurants, Thai", "city": "Goodletsville", "state": "TN", "stars": 4.0, "business_review_count": 192, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "rG75dKUe4iqgJ9cPwre_LQ", "user_id": "uchbOzIZYtaJOjFACygmFw", "business_id": "nhIffYn3kMRlHeClz0az1g", "review": [["Wow. One specific lady working here should not be in customer service. Short hair and front bangs. So rude to people. You should not think demeaning guests by waving papers in front of their faces is okay. So gros. Incident occurred  November 26th at noon. Don't know if she is the manager or not but she is not adequate."]], "date": "2019-11-26", "time": "20:39:27", "categories": "Trains, Public Transportation, Transportation, Hotels & Travel", "city": "Santa Barbara", "state": "CA", "stars": 3.0, "business_review_count": 105, "predit_yelp_score": 0.4, "actual_yelp_score": 1.0}, {"review_id": "UCPSTzT4NpBeQotROMj-oA", "user_id": "kPIL_1TWfmaVS2GycN_TIg", "business_id": "oy90OmKptr51LU2UIj2j9A", "review": [["Very poor customer help from top to bottom. We started on line as directed, bought our own (correct) equipment but install failed to connect. First 2 calls didn't help and he had to go to this store, wait like 30 minutes to get THEIR modem-router. Opps. Didn't have one. Charged immediately for their modem AND he upsold on plan before we could try smaller planes! Service charges started at that point. Next day, install their router (almost identical to ours), no go. Lots of 'try this'. Finally gal just said she'd send a tech out next day. NEVER mentioned that would cost us. It was settings she could have told us to try. Now WE have to drive out, wait and return equipment for credit(funny that takes 72 hrs) and I must call Cox call center to ask for refund service fee they didn't say would cost (unlikely, these people wring every cent they can from customer) AND get them to give us a new start date. Why should they get paid before service is on? I've lived here a short time and I now appreciate my spectrum service provider. Cox on line ad is extremely misleading. Nothing is $29.99 or even next level up. I heard a year from now they automatically jump your rates too. Great. Hot spot might be way to go."]], "date": "2019-11-27", "time": "13:03:06", "categories": "Internet Service Providers, Television Service Providers, Home Services, Professional Services, Security Systems", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 46, "predit_yelp_score": 1.6, "actual_yelp_score": 1.0}, {"review_id": "CIT7lX4mhODvRbZLqMh4Pg", "user_id": "FwBM8RjkXsG2t_QSosG_Pg", "business_id": "Wq_MeFAx6VajWrUogYSjQQ", "review": [["Give these place a 3 star. They messed up my order for take out 4 times even if i give them the correct number in the menu, so check your food before you leave."]], "date": "2019-11-26", "time": "02:19:27", "categories": "Noodles, Chinese, Szechuan, Restaurants", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 168, "predit_yelp_score": 0.07500000000000001, "actual_yelp_score": 3.0}, {"review_id": "n603FniRzjYrH2ExqY4a8Q", "user_id": "sFLKJ1qZ_nGYTuWTbPOVkg", "business_id": "4VXVP21v4Xec6C2mnnBnGw", "review": [["All throughout college, Archie's was a staple! Actually, thinking back Archie's was the first restaurant I went to after I had my initial tour of the campus. Wow. \nSince then, my family always looked forward to going to this hot spot. It's a typical college town burger stop, except the burgers were phenomenal. Juicy, cooked to perfection. The fries were hot, which was a perfect contrast to the cold Reno winters. The breakfast plates were great too! \nThe parking lot is small and fills up fast on game days or popular times of day, so get there early. 10% off for students, so bring a student with you!"]], "date": "2019-12-07", "time": "01:35:39", "categories": "Food, Restaurants, American (New), Bars, Burgers, Coffee & Tea, Sports Bars, Nightlife, Breakfast & Brunch", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 597, "predit_yelp_score": 4.800000000000001, "actual_yelp_score": 5.0}, {"review_id": "ETNfgRXX596oLZmBSOifZw", "user_id": "ti4qZhbom115c0_xr2ZIBA", "business_id": "8wktEb-euuXOi4fq1K4uGQ", "review": [["Great price, and good food. Well worth the value and will return!! Small place and has roughly 9 tables. Well cleaned, has a tv to watch sports on. They also have a salsa bar. And they have different aguas frescas including guava!!!"]], "date": "2019-12-11", "time": "20:03:49", "categories": "Mexican, Restaurants", "city": "Sparks", "state": "NV", "stars": 4.0, "business_review_count": 131, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "fQLxKhXrE5nSCuyIuNeiCQ", "user_id": "iErdndancK03fmXpzHimtA", "business_id": "QTbahs-GVuWYL5yfdjH34A", "review": [["Here boarding American airlines and from the moment we checked in we received so much attention even though there were many a people in the airport and in line the last who checked us in was so careful with us. Gave us their individual attention as if we were the only ones there. Then in checking through the security, they were so careful with each of us and so kind and considerate. Moving on to boarding our flight,  OMG we were treated with such kindness and care. Two thumbs up to American airlines."]], "date": "2019-12-08", "time": "23:56:32", "categories": "Car Rental, Airlines, Transportation, Airports, Hotels & Travel", "city": "Indianapolis", "state": "IN", "stars": 4.0, "business_review_count": 947, "predit_yelp_score": 4.55, "actual_yelp_score": 5.0}, {"review_id": "BLVyEJAU4wGQzHsxRemLJw", "user_id": "v38iWCrZLFaMwUiHxcP7GA", "business_id": "Cn4Q8Hh6d7OThmPRyVaP2Q", "review": [["It's that time of year, all boys and girls want to see Santa! Directly outside the Von Maur store, the Christmas wonderland is set up for pictures with Santa.  \n\nThe Christmas village is beautiful, Santa is great with kids ( not so much babies), the quality of the pictures is awesome, but the packages are slightly pricey! Very nice, patient and professional staff."]], "date": "2019-12-02", "time": "14:12:32", "categories": "Fashion, Shopping Centers, Shopping, Department Stores", "city": "Greenwood", "state": "IN", "stars": 3.5, "business_review_count": 56, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "2oacjj9AgSxpyPw9ZdFV3A", "user_id": "xdWnjqfqtgBpWfs1OYyz1Q", "business_id": "q8Rlb1rPFcGP1Fu7gGiJDQ", "review": [["So we went here the night before thanksgiving. Only have been open for business 3 days. Packed. Everybody and I mean everyone could not have been nicer. We had a small problem with two meals. Everyone mobilized to make it right. And they made it right! Managers were called in. Apologies abounded. We were well taken cared of. Far more than we ever could have expected. And we enjoyed our meals. Had the salmon cooked just right with broccoli. The pig burger( huge and good) meatloaf and a cheesesteak. I would not hesitate to recommend this place based on their exceptional customer service and delicious food.Kudos, Desiree and Connor and our server Siobhan."]], "date": "2019-11-28", "time": "16:28:48", "categories": "Restaurants, Bars, Nightlife, Chicken Wings, Sports Bars, American (Traditional)", "city": "Wesley Chapel", "state": "FL", "stars": 4.0, "business_review_count": 70, "predit_yelp_score": 3.775, "actual_yelp_score": 5.0}, {"review_id": "imOoDecGy-IIBAISN_hrjA", "user_id": "zNjHlalrHfm0PKoSabnMyg", "business_id": "qmHjwQ-xgD_V_DLE15Wv_w", "review": [["BEWARE...I've just learned a huge lesson when it comes to purchasing appliances at Lowes.  Make sure that the company does NOT contract with one company for their deliveries.  And that they also have their own truck.  Once you purchase that appliance, Lowes shucks any responsibility for completing the job and passes any issues off to the delivery company.  There is no communication and minimal effort to assist the customer even when the delivery company does not follow through (XPO)."]], "date": "2019-12-12", "time": "17:46:56", "categories": "Home & Garden, Hardware Stores, Building Supplies, Shopping, Home Services, Nurseries & Gardening, Appliances", "city": "Brandon", "state": "FL", "stars": 3.0, "business_review_count": 49, "predit_yelp_score": 0.1, "actual_yelp_score": 2.0}, {"review_id": "J1jmy77oDG5-cskDDOLRBg", "user_id": "kc4kn028zSyl7NPvxJ47KA", "business_id": "5xIcqp5q-6mw1FKaKpRCxw", "review": [["When I entered the restaurant, it looked comfortable and clean. My friend and I were shown to a booth. They had some high-seating available, too. The served was friendly and brought us out drink refills. \n\nI ordered the fig and prosciutto flatbread and the the street corn. The server gave me a sample of corn pudding. The flatbread was just fair. It was a pretty good crust, but the fig spread was too sweet  Therefore, if you don't like a sweet flatbread, don't order this. The street corn was a bit too spicy for me, but it could be good for someone who liked spicy foods. The corn pudding tasted like creamed corn. \n\nMy friend had a turkey burger and she said it was just fair. Our meal came to about $40.00. \n\nWe tried four separate foods, and none of them were good. It was my first and last time here. If I were a heavy drinker, the alcohol choices looks lovely. Go to this restaurant if you are a heavy drinker."]], "date": "2019-12-12", "time": "20:01:51", "categories": "American (New), Restaurants", "city": "Pike Creek", "state": "DE", "stars": 4.0, "business_review_count": 132, "predit_yelp_score": 3.4749999999999996, "actual_yelp_score": 2.0}, {"review_id": "M1dkBcqsZ05nsWFvEaVrCg", "user_id": "g6A4RVkbnZwsyq4Ie956rw", "business_id": "PlaECqs3oPBRo47p85zkzw", "review": [["Fried bar food. Would be a cool place to watch football but it closes early and we always have to leave second half and go somewhere else, especially when watching Sunday Night Football, MNF, BCS Championship, etc"]], "date": "2019-11-21", "time": "08:07:59", "categories": "Soup, Breakfast & Brunch, American (New), Chicken Shop, Chicken Wings, Southern, Restaurants, Nightlife, Bars, American (Traditional), Cocktail Bars, Sports Bars", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 1600, "predit_yelp_score": 4.35, "actual_yelp_score": 3.0}, {"review_id": "gCcB7-9xhPcV3NSvBQ38qQ", "user_id": "FBrUg2K_HPvUPjKWbz1hFQ", "business_id": "wIz_tZ88bj4W3VlrJTiiqQ", "review": [["Ok. Well, we're visiting from out of town, disclaimer we're from the SF Bay Area. That doesn't mean that we expect more, it just means that we've experienced some really well made dishes, and just overall experiences. My wife and I were hopeful with Edison, with Chef Pierola, James Beard etc. Maybe she was out that night. At any rate, let's get started.  \n\nOverall, the aesthetics of the interior are very welcoming, warm, edgy, a bit on the dark side, but we enjoyed the scene. Very few people that night, so we thought we would get great service, not the case. The Host was cool, sat us quickly (reservation), and we looked over our menu(s). Matthew was our server. Really nice guy, and explained each menu well, and we started with a few drinks. For the record, the place had very few patrons, and we waited 10+ minutes for drinks. I've dined in South America, Spain, etc, so I'm ok with long waits, if that's the norm, but it's not the norm here, so we waited. \n\nDrinks were outstanding. I would come back for the drinks. We ordered our food, and our server asked how we'd like it to come out, and I requested it to be staggered, not many patrons, slow enjoyable evening. The dishes essentially came out on top of each other, not how I like to spend a night eating an anniversary dinner. Quality just wasn't there. Bone marrow, sub par, Charred Octopus (I love octopus) ashy and just lacking, foie gras dish was probably the winner of the \"hot starts\", as all the components worked well with each other. We did have a \"cold start\" beets and goat cheese, started out good, but something was overly tart about the dish, and the beets weren't roasted enough, way too firm.\n\nHad the Duck for the main course. Again, just ok. Had some strange cannoli cookie thing, doughy, and just out of place. So...\n\nThumbs up for the drinks!! Service, food, not so great. \n\nFood, all around was a miss. This restaurant is marketed/advertised as an innovative, trending hot new(ish) place to eat in Tampa. The shell might be there, but missing the inner workings. Again, not sure if the 5X James Beard Semifinalist was out, or is an infrequent guest Chef, but somethings is a miss here. \n\nBest of luck in the future."]], "date": "2019-11-27", "time": "18:14:40", "categories": "American (New), Restaurants, Wine Bars, Beer Bar, Bars, Nightlife", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 848, "predit_yelp_score": 2.75, "actual_yelp_score": 2.0}, {"review_id": "un5oaad-fDjdal7S6cr7cA", "user_id": "ivggqiPNEOqLDhX7_RlPYQ", "business_id": "MiPN-oUTmplbe9LTxDmkag", "review": [["Omgoodness! This was such a sweet find. Tracey, Caitlin, and their staff are amazing. The atmosphere, the food, and the service are above bar. We will make this one of our regular stops when we're in Reno."]], "date": "2019-11-21", "time": "05:11:54", "categories": "Food, Specialty Food, American (Traditional), Event Planning & Services, Restaurants, Cheese Shops, Caterers, Soup, Beer, Wine & Spirits, American (New)", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 171, "predit_yelp_score": 4.85, "actual_yelp_score": 5.0}, {"review_id": "EbwSFSr1HHpZbVVX1yTLiw", "user_id": "oxJJ0N82GFZeBCxBi6vH1A", "business_id": "SwDn4LYC7uzQMmIz8RMBBg", "review": [["Small spot in Wilmington with a cozy atmosphere and quality food.  They have a nice happy hour with a seasonally rotating list of bottle/can beer, and draft list.  The food specials also change daily and glancing over the menu... each day of the week looks like an awesome choice.  The burrata appetizer was a great start to the meal.  Two huge balls of burrata on top of a bed of baby greens with a balsamic drizzle - stunning.   I ordered the lobster mac and cheese that was cheesey with al dente noodles huge hunks of lobster topped with a crispy panko like herb topping.  Wifey ordered the salmon over risotto and remarked how she could have eaten 2 more of them (I know it was delicious but I think that was the pregnancy talking haha).  For dessert, we both ordered the creme Brule and it did not disappoint.  One of my all-time favorite desserts and it was GREAT!  The price was on the higher side but you definitely pay for what you get here, fresh, quality ingredients prepared correctly with skill.  Worth the short drive down from Philadelphia."]], "date": "2019-12-09", "time": "16:17:12", "categories": "American (New), Restaurants", "city": "Wilmington", "state": "DE", "stars": 4.0, "business_review_count": 200, "predit_yelp_score": 4.824999999999999, "actual_yelp_score": 4.0}, {"review_id": "QNFSefnPYGPzvXbLxmmVtQ", "user_id": "2z33HuYX4ozoLjcsw57XQQ", "business_id": "WiNoxZh6YWlvqt45-L00UA", "review": [["Dr. Donn came to my rescue a couple of years ago when I had a dental emergency and I've been with him ever since!  Really glad someone recommended him!  \n\nI've always been impressed with how caring and thorough Dr. Donn is in terms of discussing the finding of the dental x-rays, suggested treatment and making sure everything is done properly the first time!\n\nBoth Holly and Dawn are exceptional Dental Hygienists!  Not only are they friendly and conversational, but they go out of their way to make sure that you're comfortable and answer any questions you have (Ditto for Dr. Donn himself!).\n\nWhat I also find extremely helpful is that you can schedule an early morning appointment during the week at 6 or 7 am, for example. so that you can get a cleaning or other work done without having to take a half-day or sick day from work.  \n\nKeep up the good work, Dr. Donn and all of the staff ..and Thanks for being there!  You are very much appreciated!"]], "date": "2019-11-28", "time": "14:12:43", "categories": "Dentists, Cosmetic Dentists, Pediatric Dentists, Periodontists, General Dentistry, Health & Medical", "city": "Cherry Hill", "state": "NJ", "stars": 4.0, "business_review_count": 23, "predit_yelp_score": 4.324999999999999, "actual_yelp_score": 5.0}, {"review_id": "FdcNxGTtuvAsXCruLfjDlw", "user_id": "a4EDXJqa6YvE0PpeA4T4Ow", "business_id": "5TSYMfTMdLvmgmKZkzKNnA", "review": [["We've been having a great experience working with Lindsay on in-home trainings. As first-time dog owners (aside from family dogs) she's been an invaluable resource of advice and guidance. We rescued a 4-yr-old pit bull mix who definitely has some baggage in terms of anxiety likely in relation to her abandonment and Lindsay is giving us all the tools to help our dog. Behavioral training is a long journey which can be frustrating and discouraging at times, but Lindsay does a fantastic job of keeping us positive and celebrating small achievements. We feel confident having her in our corner as we work to get our dog as comfortable and confident as possible in her new life."]], "date": "2019-12-03", "time": "14:51:52", "categories": "Pet Training, Pet Services, Pets", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 24, "predit_yelp_score": 4.275, "actual_yelp_score": 5.0}]