[{"review_id": "ST8i1vq1YfpSUkp37ryOgQ", "user_id": "Y_xMGVNGeuftiTj2_IDZ4g", "business_id": "MyFC2F-5SXwXTLR99UWiqA", "review": [["I have long been on the lookout for that singular establishment that will support my simultaneous drive to both work online AND imbibe. (Because sometimes answering emails requires a glass of wine.) The Vintage is that rare place that can take you from morning coffee fix to happy hour without missing a beat. \n\nThe only con I'd note is that the coffee bar and adult beverage bar are two separate..bars? So you have to order at the appropriate counter. \n\nOtherwise, I feel like Goldilocks, having finally found a work space that's juuuuuuust right."]], "date": "2018-11-19", "time": "19:19:51", "categories": "Restaurants, Cafes, Nightlife, Cocktail Bars, Bars, Wine Bars, Coffee & Tea, Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 344, "predit_yelp_score": 2.9250000000000003, "actual_yelp_score": 5.0}, {"review_id": "3EOwS-10xEmMeNIVOsYfYg", "user_id": "V5rXlnLgCdH09L0AeyHpMA", "business_id": "BCc22qCuePzF3j2AVvrkxg", "review": [["This is definitely a place I will be coming back to. We had a dinner party for a friends birthday and the staff was truly amazing. I big on ambience and vibe and they exceeded my expectations. They went above and beyond for us. David and Daniel handled the end of the table I was on and they were great. The food was DELICIOUS  from the garlic bread to the who DAT shrimp, crab cakes, ah gratin potatoes and the med well ribeye steak."]], "date": "2018-11-11", "time": "03:20:28", "categories": "Bars, Restaurants, Steakhouses, Seafood, Nightlife", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 347, "predit_yelp_score": 2.55, "actual_yelp_score": 5.0}, {"review_id": "F0ZcNR_zrk4yfjQNIR2hjw", "user_id": "ZLVKk5MAND6u7SNMH1r8NQ", "business_id": "czJM3pm_cAbz8Ohr7vGtJQ", "review": [["The wait was a bit long for what we ordered. When the food was served, it was all cold. The other people in my party didn't want to send their meals back, because they were fearful of what the cook would do to it. I took my chances, because I didn't want to eat cold food. This is the 2nd time I've been to this Dave & Buster's in 2 years. I don't want to come back."]], "date": "2018-11-03", "time": "18:30:20", "categories": "American (Traditional), Arts & Entertainment, Restaurants, Cocktail Bars, Eatertainment, Nightlife, Bars, Arcades, American (New)", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 282, "predit_yelp_score": 1.375, "actual_yelp_score": 2.0}, {"review_id": "SvZML_jwWDpRccThMrU2ZQ", "user_id": "zqayVknSOU7ZNEopxdH5eQ", "business_id": "0CHIbqSkGWBr2KMkIUocEA", "review": [["Great service and food. The environment was excellent, especially for us that were with a newborn there."]], "date": "2018-11-20", "time": "02:24:29", "categories": "Breakfast & Brunch, Venues & Event Spaces, Peruvian, Event Planning & Services, Bars, Nightlife, Latin American, Restaurants, Cocktail Bars, Seafood, Tapas/Small Plates, Mexican", "city": "Santa Barbara", "state": "CA", "stars": 3.5, "business_review_count": 659, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "-1876jTY9od_1q1Pvg2feQ", "user_id": "nxI8n6lARJpMP5SI8U9S6w", "business_id": "wzE61ThXOdrSegvwSOzf5w", "review": [["We stopped for an early breakfast passing though Nashville.  You order at the counter and seat yourself. Biscuit Love gets pretty busy and a line to the door formed by the time we left.  \n\nI opted for the banana foster oatmeal, fresh orange juice, and an al a cart biscuit because of course I need to try one.  My husband got the hot chicken biscuit sandwich.  Water is serve yourself and is available in still and sparkling, which was nice. My oatmeal was really good and the juice serving was large and refreshing.  My husbands sandwich was huge and he enjoyed it.  The biscuits, however, were a disappointment.  These are not flaky biscuits that you've seen, well, just about anywhere else. They are more like spongy rolls. I didn't even finish my single biscuit with jam. The consistency was bizarre.  I felt like this should be their highlight and it ended up being the disappointment of the meal."]], "date": "2018-11-04", "time": "22:01:34", "categories": "Southern, Breakfast & Brunch, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 578, "predit_yelp_score": 1.25, "actual_yelp_score": 4.0}, {"review_id": "jNN4oML8vP28zMKcVHs0Jg", "user_id": "WHVr26riyHtvQOVPjUB63g", "business_id": "IkHWq7zYfptopd9MdzS0eg", "review": [["Have ordered from Amber Asian in the past.   They make a good Pad Thai.  I ordered dinner this evening at 6:12 pm for delivery.   I called back 50 minutes later - hadn't even started my order.  Here we sit at 8 pm - still NO FOOD.   SORRY Amber Asian.   You just lost out business.   Nobody wants to wait 2 hours for dinner to be delivered.  If you can't deliver - how bout - just be honest."]], "date": "2018-11-10", "time": "00:50:44", "categories": "Restaurants, Japanese, Sushi Bars, Thai", "city": "Lansdale", "state": "PA", "stars": 3.5, "business_review_count": 77, "predit_yelp_score": 0.9, "actual_yelp_score": 1.0}, {"review_id": "VTv1PdxI7rAAXhLC7-Nf4w", "user_id": "asFJcKE-UAzgmzOT3QG--Q", "business_id": "xowF0NCQ74qopUqm2N1AXQ", "review": [["I've been coming to this Hooters for two decades and as the 'Original', it is a place to put on the list if you are a chicken wing fan, or a fan of Hooters in general. \n\nThat being said, I don't see anything outstanding or noteworthy about this location when compared to other Hooters or local WingHouse locations. In fact, being the 'Original' I would love to see the service, food, wait times, at their very best but I cannot say this is the case. \n\nWe have had both positive and negative encounters with wait staff but having been here so many times, it's a wash. \n\nIn summary, it's a wing place... and in some regards... THE wing place but nothing too stellar or exciting overall. Parking can get very busy during football game days but the parking lot does extend into the nearby corporate headquarters so there is always a place to park.\nThe prices are the same as all Hooters, neither good nor bad and on average with other chain restaurants."]], "date": "2018-11-28", "time": "14:16:04", "categories": "Restaurants, Barbeque, Nightlife, American (New), Bars, American (Traditional), Chicken Wings, Burgers, Seafood, Sports Bars", "city": "Clearwater", "state": "FL", "stars": 3.0, "business_review_count": 206, "predit_yelp_score": 1.075, "actual_yelp_score": 3.0}, {"review_id": "eAdxBNaoNcHJf9TJdpYVIA", "user_id": "T4Dsv8xVIr4bMsbgPaTWsw", "business_id": "GXFMD0Z4jEVZBCsbPf4CTQ", "review": [["The breast-wing combo was perfect, but the two side wings I ordered had obviously been sitting around - they were lukewarm."]], "date": "2018-11-28", "time": "02:46:54", "categories": "American (Traditional), Chicken Shop, Southern, Restaurants, Chicken Wings, American (New), Soul Food", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 6093, "predit_yelp_score": 2.3499999999999996, "actual_yelp_score": 4.0}, {"review_id": "EbpGXmhKJWYGVIhw7yVh2w", "user_id": "22ml-CTcoabnc-uu4WXXOw", "business_id": "snUaY-_QQLghIA2ybk0vCw", "review": [["Relaxing late lunch on beautiful fall Saturday. Beer pairings came easy to our server and the manager made sure the tots were hot. Very enjoyable. We'll be back for sure!"]], "date": "2018-11-03", "time": "18:02:03", "categories": "Breweries, Food", "city": "Fishers", "state": "IN", "stars": 4.5, "business_review_count": 86, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "FsgDUQ4fWXFJpotlyCYxjg", "user_id": "NAJgBheNVQ6DudaLCBrJyw", "business_id": "tQIw_BZzfjh8UC4Eqhd0XQ", "review": [["White sands, gorgeous sunsets, mostly clean beach. It's a beautiful place to be. Since the beach is located just off the main road (Golfview Blvd), there is easy access to shopping & dining nearby. \n\nParking (paid lot or metered street spaces) can be a pain when it's weekends or holidays. But if you go during the week, when it's cool & windy, more beach and parking space will be available."]], "date": "2018-11-19", "time": "19:31:10", "categories": "Beaches, Active Life", "city": "Clearwater Beach", "state": "FL", "stars": 4.5, "business_review_count": 601, "predit_yelp_score": 1.9000000000000001, "actual_yelp_score": 5.0}, {"review_id": "QpnMb2QoM6eMiKe27UKtqQ", "user_id": "lNn7V9EZrLObnsb62HlBAg", "business_id": "drrx9_VlTo9so8FPV4hMdA", "review": [["Restaurant attached to the Best Western hotel. Quaint 70's style, with great service and ok food.\n\nNegative: after dinner, I got a serious stomachache. Not sure if it was the Brussels sprouts/bacon or the tuna. Food poisoning was not on my agenda for the evening and I didn't appreciate it..."]], "date": "2018-11-11", "time": "03:49:40", "categories": "Event Planning & Services, Bars, Lounges, Karaoke, Restaurants, Comfort Food, Nightlife, American (New), Hotels & Travel, Hotels, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 73, "predit_yelp_score": 1.3, "actual_yelp_score": 2.0}, {"review_id": "yoACLujkN-BTuCi0c8evVg", "user_id": "VnH7NVnI6v9t7PngtCv2_A", "business_id": "wjfMz__91zzbMvuArE6dwA", "review": [["The smell of smoked meat hits you when you first walk in and it doesn't disappoint. The brisket and spicy sausage was delicious. The salad was enough for two."]], "date": "2018-11-18", "time": "18:26:24", "categories": "Caterers, Beer Bar, Salad, Nightlife, Restaurants, Event Planning & Services, Barbeque, Burgers, American (Traditional), Sandwiches, Specialty Food, Bars, Food", "city": "Meridian", "state": "ID", "stars": 4.0, "business_review_count": 204, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "KbUkoJdtVmV_eEfDBk_LLw", "user_id": "t3qoId4cctJuuqOcYZSY9g", "business_id": "1E21KhW87jqQGuzYSxG_xQ", "review": [["This is the quintessential Chinese-American food restaurant. I have to hyphenate because no other country has this type of cuisine, not even China. As far as I know. After living in Japan for three years it was sourly missed. I will leave out atmosphere and décor evaluations because, let's face it, it's fast food. Although, the lady behind the cash register was hilarious. She cared about one thing, getting your order as quickly as possible. She was not rude just overly expedient than normal. It was if she had 10 seconds to complete every individual order. Anyway, on to the food.\n\nWe had our food there at the restaurant. The tables were clean-ish. It took about 10-15 minutes for our order to be prepared before we had to go back up to the speed queens throne to retrieve our food. I guess she didn't have time to bring it to our table but like I said, it's fast food. At first glance I noticed that the takeout containers, without the top lid, were stuffed with food. That's a big plus so since I usually start with five stars on my evaluations and mark down from there, I have to mark up from five to six stars (don't worry it'll make since in a minute). \n\nI ordered the General Tso's chicken combo (fried rice and 1x egg roll/1x crab rangoon (CR). They have it listed on the menu as something spelled slightly different but I knew it would be the same. I've had this many times before and sometimes they use very low quality chicken but not here. The sauce was the perfect blend of sweet and spicy for this dish. I have to deduct a star (5 star) because the chicken was not as crispy as I like but it was good. The pork fried rice was average but a little dry. My wife ordered the seafood combo with large chunks of \"crab meat\" but the artificial taste made them inedible. I have to deduct another star (4 star) for the \"crab meat.\"   \n\nThe best part of the dish was the CR. Although I always opt to get CR instead of an egg roll whenever possible I also ordered an entire order of CR (4 piece) as a side. I was pleasantly surprised with how large these CR were. The wontons were crispy, a little chewy and not overly greasy. Probably the best CR I've had in a long time. This calls for another star to be added (5 star). Oh, if you go, make sure to get \"red sauce\" with your CR. It's 85 cents extra but it's worth it. \n\nI will definitely return."]], "date": "2018-11-27", "time": "21:11:20", "categories": "Chinese, Restaurants", "city": "Saint Louis", "state": "MO", "stars": 3.5, "business_review_count": 64, "predit_yelp_score": 1.9500000000000002, "actual_yelp_score": 5.0}, {"review_id": "6ZsOoqqZ3QLYxCZ2rclmQw", "user_id": "NmWq8MYyckcaiSJS9nG8wg", "business_id": "uNTT5JHQsL781H_v4A4LoA", "review": [["The new owners are not doing a good job. I have a feeling that this store will close soon. No one is bringing in clothes - just look at the pipe racks - nothing on them. The crease on my pants now have a double crease because the presser did not line up the original crease."]], "date": "2018-11-12", "time": "14:59:31", "categories": "Laundry Services, Dry Cleaning & Laundry, Dry Cleaning, Local Services", "city": "Springfield", "state": "PA", "stars": 2.5, "business_review_count": 8, "predit_yelp_score": 0.0, "actual_yelp_score": 2.0}, {"review_id": "E1jEykigxjGpsaJbbkSX2g", "user_id": "DdrP5ng377vmc8vEePLcDw", "business_id": "JEY_IuBUJ0U0cIHTNMfIGg", "review": [["I found this place to be no better or worse than any other pizza place I've been to around here. My issue is the price. They charge $2 per topping which is a little outrageous. It's the same price for me to get black olives as it is for someone to get pepperoni. I'll stick to the places by me"]], "date": "2018-11-22", "time": "03:56:09", "categories": "Sandwiches, Pizza, Italian, Restaurants", "city": "Port Richey", "state": "FL", "stars": 4.0, "business_review_count": 48, "predit_yelp_score": 0.0, "actual_yelp_score": 2.0}, {"review_id": "P14oFwVxyV2gsiTgf--giA", "user_id": "rogKKU3AHpkH383y7PFQ1A", "business_id": "MFHsaLHnXpi43mJ51gjljQ", "review": [["We recently went to City Buffet for lunch.  I have to say that for a buffet, the food was fresh, had good flavor, and a quick and efficient staff that was polite and always had a smile.  The mushrooms were excellent, the pot stickers were tasty, teriyaki chicken skewers were outstanding, and the wonton soup was excellent.\n\nI would definitely recommend this restaurant if you're wanting a buffet of Chinese and American foods."]], "date": "2018-11-03", "time": "22:51:48", "categories": "Restaurants, Buffets, Chinese", "city": "Boise", "state": "ID", "stars": 3.0, "business_review_count": 90, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "9FpC7b1RwigaCxOhC7XgUw", "user_id": "QkmL3jPECtIyl3G-F-ksrQ", "business_id": "AFk6UXFbH-idH31KhFQVCg", "review": [["One of the best places in town to grab a cup of caffeine. The coffee is roasted in house, and the baristas know what they're doing. They also offer a good selection of dairy alternatives. Definitely a must-go-to spot."]], "date": "2018-11-17", "time": "15:47:38", "categories": "Restaurants, Coffee & Tea, Food, Cafes, American (Traditional)", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 250, "predit_yelp_score": 3.125, "actual_yelp_score": 5.0}, {"review_id": "2BtmFU4MzRCIzoGOOwhXUQ", "user_id": "H4KGptsE41UXAJW_XRkYRg", "business_id": "qU04_z622p49wEIFB-9U5w", "review": [["This was my first time trying Roman end it was absolutely delicious! I got the mushroom Ramen and loved it. The food  came out quickly. I will be back again soon for this flavorful Meal!"]], "date": "2018-11-04", "time": "21:08:52", "categories": "Restaurants, Japanese, Ramen", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 147, "predit_yelp_score": 2.6500000000000004, "actual_yelp_score": 5.0}, {"review_id": "3YtUA5t0K_4knW5NcbFO_A", "user_id": "TEtqq6O5LnbMULvo1QwTaA", "business_id": "4As-DeKQELpu0JCqBAP4kA", "review": [["Kevin killed it! If your in the STL area go to This salon and get your nails done by him. He's so talented and can do anything beyond in love with my nails thanks again :) \nI booked an app not knowing what I wanted and told\nHim do you boo. And let me just say I will forever be getting my nail done by him."]], "date": "2018-11-10", "time": "18:26:49", "categories": "Beauty & Spas, Waxing, Hair Removal, Nail Salons", "city": "Saint Louis", "state": "MO", "stars": 4.0, "business_review_count": 113, "predit_yelp_score": 1.25, "actual_yelp_score": 5.0}, {"review_id": "uVnrhHfdoWtDswb5xs0K9Q", "user_id": "p1f1fh8Yp94Qa8l4hgk2_A", "business_id": "m6XlborETiPuT7bgph0g0Q", "review": [["Garret was a pleasure to work with! My husband and I couldn't have been happier with our choice. We found Garret on Facebook and we really liked the look of his work, so we had a meet with him. We met at a Starbucks and Garett was so easy to talk to. Super personable! He answered all of our questions and had some extra perks we liked. He was easily our favorite vendor throughout our wedding planning process! He is quick on response times and always willing to answer questions. \n\nSome things we personally loved that he did was at the reception he put up some of the photos he took throughout the wedding so our guests were able to see them! We got a lot of compliments on that. Guests loved it! Another thing was that he worked hard at remembering our bridal party's names. My matron of honor and I were both really impressed by that! It made taking the photos a lot more fun. He also stays ALL day. He doesn't put a time limit on the event. We loved that. Time limits can be stressful because you're trying to get all the photos done before they have to leave. All he asks is for a meal for him and his assistant. The last and biggest thing we loved was that he helped side step a problem. My dad forgot his tie, but before I could have a mini panic attack that we were out a tie, my mom came in and told me that the photographer offered his grey tie to my dad. His tie matched really well with the suits and it was perfect! It was very kind and caring of him to do that. My husband and I were really grateful!\n\nWe did pay more than what we planned for Garret, but we have no regrets about that! The photos came back quickly and are amazing! We loved working with Garret and definitely recommend him to anyone and everyone!!!"]], "date": "2018-11-25", "time": "14:50:35", "categories": "Event Planning & Services, Event Photography, Photographers, Session Photography", "city": "Indianapolis", "state": "IN", "stars": 5.0, "business_review_count": 10, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "lQvXm9cd5foubzgyJdT6Qg", "user_id": "GaQsJbLswvZsD52InhJupA", "business_id": "3AZjEgNM6CiOePDKKAQWgA", "review": [["Wonderful food!! I have ordered just about everything on the menu and have not had a bad meal. This is my brother's preferred take out when he comes home for college breaks.\nRestaurant is clean, and the menu is clear and fun to look at! \nGreat spot for Vietnamese food!\nTry the Vietnamese egg rolls!!"]], "date": "2018-11-20", "time": "20:24:16", "categories": "Restaurants, Chinese, Barbeque, Noodles, Fast Food, Vietnamese, Salad, Vegetarian, Vegan", "city": "Maryland Heights", "state": "MO", "stars": 4.5, "business_review_count": 260, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 5.0}, {"review_id": "Q0FfUGTV1lmMOSpsI1mDmw", "user_id": "xaSrSIlh2LQABgeGRIQg0w", "business_id": "cJQps1v1Bbx-jhx1KS2rww", "review": [["Had a small problem and one of the dash error lights kept coming on. Brought my car in and they were able to quickly diagnose and address the issue."]], "date": "2018-11-13", "time": "17:00:48", "categories": "Tires, Automotive, Auto Repair, Auto Parts & Supplies", "city": "Clearwater", "state": "FL", "stars": 5.0, "business_review_count": 14, "predit_yelp_score": 0.775, "actual_yelp_score": 5.0}, {"review_id": "R7nakCaHyBgcNMTJb-HyXw", "user_id": "zoSTt-SjdmAa82E0H1sspQ", "business_id": "r3X75SK37buS94mDls3q_Q", "review": [["This place is awesome! My boyfriend is keto and I'm vegetarian and the menu accommodated both of us perfectly. There are vegan options too! Everything tasted fresh. \n\nOne of the girls who works here (I dont remember her name but she has long dreads and the nicest smile) recommended a fall inspired kombucha for me to try and it was delicious! She has great customer service skills! I wish I knew her name-- thank you if you're reading this! The little things make such a difference :)\n\nWill be back the next time we're in town!"]], "date": "2018-11-09", "time": "20:49:23", "categories": "Vegan, Gluten-Free, Salad, Restaurants, American (Traditional)", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 279, "predit_yelp_score": 2.6499999999999995, "actual_yelp_score": 5.0}, {"review_id": "g8gvc7GdzJ57B_oO5yjtpw", "user_id": "Kvp8hkXUhChtDetRxehOhQ", "business_id": "Nxa362GcR1WWK2og8uJ_sQ", "review": [["We went there for a Sunday Breakfast. They had our reservation wrong 11/18/18. Disappointed about how loud it was. Chairs are probably the worst chairs I have ever sat on in a restaurant short of McDonalds as a kid. Remember those booths that were flat and hard, These are worse. Food was average. Got the breakfast sandwich, disappointed it was a prefab egg that was reheated. Potatoes were very greasy. Very good cold pressed juice, pre-made also. Make sure you get a booth!"]], "date": "2018-11-18", "time": "15:36:05", "categories": "Food, Coffee & Tea, Sandwiches, Restaurants, Breakfast & Brunch, Italian", "city": "Webster Groves", "state": "MO", "stars": 4.0, "business_review_count": 318, "predit_yelp_score": 0.35000000000000003, "actual_yelp_score": 2.0}, {"review_id": "X-OUZjo3kTGu1CYhDrGWog", "user_id": "DQrezWJv3ZK60bgxKDNaUg", "business_id": "ErkV2AgjH5wSfIcGhfUy9Q", "review": [["I have the worst experience ever they rushed me out of there when I was purchasing the car and then I've had a paper tag from us a month and a half because they haven't given my hard tag yet and on top of it all on my tires have broken belts and I just had the most terrible experience buying a brand new car I think I'm a go back to Toyota of Tampa Bay the only thing the sales guys did was call me about doing me rating my experience there so he can get his hundred bucks and on top of it all I still have my hard plate I still have a paper plate on my car they still haven't call me about my hard plate like I said the worst experience I've ever had and I bought a brand new car for ford I never had this problem \n\n\nToday I went in for service just for an all change it took me two hours my car was already done for 40 minutes they pulled into the driveway twice and then finally after 40 minutes The sale was a visor finally let me know the car was ready when my car has been ready for over 40 minutes this is has been the worst service I've ever had and if I had a chance to go somewhere else I would my name is Charlie Escobar and I have a Nissan Sentra from this place and I'll never buy another car for me"]], "date": "2018-11-25", "time": "01:21:22", "categories": "Auto Repair, Automotive, Auto Loan Providers, Car Dealers, Auto Parts & Supplies, Tires, Used Car Dealers", "city": "New Port Richey", "state": "FL", "stars": 2.0, "business_review_count": 95, "predit_yelp_score": 0.375, "actual_yelp_score": 1.0}, {"review_id": "38Rclgwq3G4ottCRUhDCIg", "user_id": "N1DbQoZlSIRBIeRjgtZuOA", "business_id": "edmCIaOGJVFWM9xiNQaumQ", "review": [["We come here several times a month. Great service and good food. Sushi is better than most in the area and they have a lot of good options for Chinese food. Would definitely recommend!"]], "date": "2018-11-10", "time": "20:31:48", "categories": "Restaurants, Asian Fusion, Seafood, Sushi Bars", "city": "Carmel", "state": "IN", "stars": 4.5, "business_review_count": 112, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "5JMYA6tIxOKcGs7CIxiayw", "user_id": "j7V2db_GrNZgHp0Y_5u_TA", "business_id": "3ZaYy2VND0-VUPc3DqBB_A", "review": [["Absolutely horrible service. Was not even greeted at the window, was not asked for sauce, was not even acknowledged of my existence. Will NEVER be using this location again. I'll probably get a disease eating this food."]], "date": "2018-11-14", "time": "17:37:13", "categories": "Burgers, Tacos, Breakfast & Brunch, Mexican, Fast Food, Restaurants", "city": "Oakville", "state": "MO", "stars": 2.5, "business_review_count": 15, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "JO-K0rMI9_xt2xY-8FTr1Q", "user_id": "-YBLs6HtFOuH3hrY2z5vKA", "business_id": "gyI9J2RSM9b0vV2r4ZVIxQ", "review": [["Don't think I will be going back to this Theater again. The theater it self and the price to see the movie was great . But it costs $33.00 for two 20oz beers and two small popcorns. BTW staff was polite"]], "date": "2018-11-13", "time": "06:37:53", "categories": "Cinema, Arts & Entertainment", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 92, "predit_yelp_score": 1.725, "actual_yelp_score": 3.0}, {"review_id": "6aT5pnw5E60I-0lCvf_BWA", "user_id": "maRu4CwSXpXb90rgrdn3yg", "business_id": "3cyjdxvskRcADylzLI32cQ", "review": [["I love this place! The food is delicious, the service is phenomenal and I love that they have healthy options! I love getting the avocado toast or the chia seed bowl. I'm also obsessed with the Kale Tonic!! The place is clean and the ambiance is refreshing.... I love it!"]], "date": "2018-11-09", "time": "15:44:29", "categories": "Restaurants, Breakfast & Brunch, Cafes, American (Traditional)", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 213, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "YtSWp3HoU8Aj5Wa3eNaqjQ", "user_id": "B25C6zV2bfWb4EfwLhZ2xQ", "business_id": "z67ktHxCJ3-Ebs3zooegSg", "review": [["So sad... This place used to be pop'n with locals and players from U of A BBall team every night.. Under new ownership , just not the same .. No salad bar, TV's  off, deserts look empty.. Almost like their barley holding on.. Staff friendly, but really tight lipped.."]], "date": "2018-11-09", "time": "00:59:57", "categories": "Event Planning & Services, Caterers, Delis, Specialty Food, Seafood Markets, Bakeries, Grocery, Food, Restaurants", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 215, "predit_yelp_score": 1.075, "actual_yelp_score": 2.0}, {"review_id": "UN5jzKaUuo-I2zgsZCKoWg", "user_id": "37ztQXVgezRc6qnYGp--hg", "business_id": "bPVPZeqMuYtU_yGCb4P-jg", "review": [["VEGAN EATERS HERE....Have tried to snag a spot at the FOREVER slammed counter of \"The Bowl\" for a while now and have just ended up leaving for a spot with more instant gratification on offer, there are plenty in SB. WRONG DECISION! After these numerous tries, we finally \"bit the bullet\" and waited and OMFG we were so not disappointed.\n\nEven though the choices are fairly limited for the fatally \"plant based or vegan\" amounts us, (WISH THERE WAS A NOODLE SOUP OR CURRY) the dishes we had were stellar and can't wait to return, my pansit noodles with vegetables and steamed tofu ROCKED all the way to my mouth and beyond.\n\nGreat staff, though harried for the obvious reasons. I hear they're opening in Montecito and that should be equally amazing. BIG fans, only reason for the 4 stars was the stress of the crowd (sue me) and the lack of variety."]], "date": "2018-11-05", "time": "21:22:11", "categories": "Comfort Food, Asian Fusion, Chinese, Tapas/Small Plates, Noodles, Thai, Restaurants", "city": "Santa Barbara", "state": "CA", "stars": 4.5, "business_review_count": 705, "predit_yelp_score": 1.2000000000000002, "actual_yelp_score": 4.0}, {"review_id": "ZKhCRymiiAyQMnqECBwInA", "user_id": "HBzsO7fBN7LMJK06tN5AOQ", "business_id": "UDll78WhTa6Ln4KIHhPNXA", "review": [["Absolutely loved this place, has a great array of skeet ball and arcade games. Tons of TVs for sport games as well. Food is cheap and tasty. Highly, highly recommend."]], "date": "2018-11-25", "time": "01:14:55", "categories": "Pubs, Thrift Stores, Nightlife, Bars, Shopping", "city": "Edmonton", "state": "AB", "stars": 3.5, "business_review_count": 8, "predit_yelp_score": 2.725, "actual_yelp_score": 5.0}, {"review_id": "HMZ2lgzPc3m4iSzwiednvQ", "user_id": "sKTJBqxT6b_XBPFLH4N0-A", "business_id": "Rw8Zf_snPdZO_B3XFOsJ6w", "review": [["I first had food from Duos at an event and it was amazing. This is my first time going in person and it was a great experience. They have a ton of options. There are sandwiches, bowls and a variety of special dishes. There are vegan and gluten free options. It was delicious. I had the smoked turkey sandwich and the killer potatoes... and splurged and got a piece of carrot cake. Everything was delicious. I will definitely go back. There a a lot of seating. The only downside was parking, as the parking lot is small and many spaces are marked as reserved."]], "date": "2018-11-29", "time": "18:02:51", "categories": "Restaurants, Vegetarian, Sandwiches, American (New), Cafes", "city": "Indianapolis", "state": "IN", "stars": 4.5, "business_review_count": 98, "predit_yelp_score": 1.825, "actual_yelp_score": 5.0}, {"review_id": "zeFXw38FSmjHtIYf5kSFtg", "user_id": "xqpIK4PcB7PA21MVEAkqeQ", "business_id": "QnG08fQB37kUxyr_FLMGDw", "review": [["You get a cocktail, you get a cocktail, you get a cocktail. \n\nI've been at west fork whiskey a couple of times. They have seasonal drinks and the fall menu came out a few weeks ago. The drinks I've tried so far were delicious and strong. \n\nThey have a very small food menu - bar snacks and panini's. \n\nThey have trivia on Tuesdays and a small room in the back for private parties.\n\nOnly reason they get 4 stars is because it's pretty small inside. There's seating outside pending weather. I've had to wait for a drink every time I've been. The bartenders are nice and patient though."]], "date": "2018-11-05", "time": "16:26:36", "categories": "Distilleries, Cocktail Bars, Nightlife, Arts & Entertainment, Whiskey Bars, Food, Wineries, Bars", "city": "Indianapolis", "state": "IN", "stars": 4.5, "business_review_count": 149, "predit_yelp_score": 2.1500000000000004, "actual_yelp_score": 4.0}, {"review_id": "rnZBcDxoVwi_yottE1gZMw", "user_id": "ZCc85CfjFaw5v24yoT1koA", "business_id": "ku8cAVBLaF_4rI-yK6gNnQ", "review": [["Where do I start?  This place has been awesome for decades.  I remember eating here in the late 90's, mid 2000's, and again in 2018. Everything is delicious that we had on this trip between my wife, daughter, and me: turtle soup, seafood gumbo, the bread they bring to the table, artisanal eggs benedict, eggs sardou, eggs hussarde, and of course the famous banana's foster.  I don't think you can go wrong with anything.  Just make sure you make reservations (like using OpenTable) in advanced to your trip."]], "date": "2018-11-20", "time": "20:32:00", "categories": "Cajun/Creole, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1598, "predit_yelp_score": 1.725, "actual_yelp_score": 5.0}, {"review_id": "aTKYLkR-C28odOZpjeByZw", "user_id": "f5G1aVE5WL8raIWNa9LWEg", "business_id": "4kfbEcAMepvkjt3H7INYBg", "review": [["Ethan was rad. On top of having a well whiskey that makes every other bar in America look like a chump, this place has the vibe you want without the douchebaggery you'd expect from a hipster spot. Ethan suggested a good whiskey for the lady and myself and even let me taste the one we turned down. I will probably date this girl for a while and he will forever be a part of the story. Please give him a raise. If you don't, I will change my stars. Can't wait to come back."]], "date": "2018-11-28", "time": "04:18:41", "categories": "Cocktail Bars, Lounges, Nightlife, Bars", "city": "Santa Barbara", "state": "CA", "stars": 4.5, "business_review_count": 344, "predit_yelp_score": 2.0, "actual_yelp_score": 5.0}, {"review_id": "K8cf6CPv9koPPB_tfW17gA", "user_id": "ty10E710pzuiajLnpaQZeA", "business_id": "9fk_aoH6bvdv_fJdKjhTWg", "review": [["Let me start by saying, I'm a Mexican from California. This place is seriously hit or miss and I desperately wanted to like it. First, I'm a bit offended that they charge for chips and salsa. Let me tell you why, it's a cultural thing. I don't care where you go in Mexico, in a sit down restaurant there is always something to munch on the table. It's hospitality, we do it to say thank you. Thank you for coming to our business/home. The corn tortillas fall apart! They're warmed up, but aren't properly cooked. The red rice, is usually chewy and hard. The fajitas are pretty good, the steak torta is decent. The enchiladas need to be called something else. They wrap some meat in a tortilla and slather the top with a little bit of sauce and a ton of American cheese. There is an art to enchiladas. They've completely missed the mark. Been here twice, won't be coming back. Nueva Cantina, sure. \"That Mexican Place,\" I don't think so."]], "date": "2018-11-09", "time": "22:30:50", "categories": "Breakfast & Brunch, Nightlife, Mexican, Restaurants, Bars, Cocktail Bars", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 142, "predit_yelp_score": 1.2750000000000001, "actual_yelp_score": 3.0}, {"review_id": "DLUqJvjGgGXmfQYcsAL1WA", "user_id": "Jh-IkvHCi7RQ9oFFqkqGQw", "business_id": "Plnxj-bVj4PyOeL3dykGiw", "review": [["This native Italian LOVES LOVES LOVES this restaurant. THE most authentic pasta sauces,  pasta shapes made here, polenta,and sausages and meatball appetizers. A beautiful rustic newly renovated location. For me... the best Italian restaurant in the U.S. , and I've been to many!"]], "date": "2018-11-19", "time": "00:44:25", "categories": "Desserts, Seafood, Specialty Food, American (New), Italian, Food, Restaurants", "city": "West Chester", "state": "PA", "stars": 3.5, "business_review_count": 117, "predit_yelp_score": 2.6499999999999995, "actual_yelp_score": 5.0}, {"review_id": "-aq0lby-0739aFcXSIRHnQ", "user_id": "QX-B9NbYp9XQJav1oOAPZw", "business_id": "K3RURR9lIEE4JjOaPt99zg", "review": [["Food is pretty good. The wait is beyond ridiculous - had a party of 12 (understanding its a small place, called ahead) and we waited over an hour and 45 min as they sat over 15 tables of 2 who came in an hour after us. \n\nThe staff at the hostess stand wasn't the most understanding or polite. I wish it was different because the food is delicious. Not sure if I will be back."]], "date": "2018-11-17", "time": "17:22:32", "categories": "Vegetarian, Breakfast & Brunch, American (New), Coffee & Tea, American (Traditional), Caterers, Food, Cafes, Event Planning & Services, Restaurants, Diners", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 1176, "predit_yelp_score": 1.25, "actual_yelp_score": 2.0}, {"review_id": "puxhKXIYSUP5TBRZrwoLRA", "user_id": "eIEaC5jozy2QIyHgsBHaeA", "business_id": "ruE_DRE6fTIE6who59hdfQ", "review": [["I brought my future bridesmaids here for a proposal dinner and the service was terrible. This was towards the end of the \"rush\" and the restaurant was not busy so there wasn't a reason for the lack of attentiveness. It took forever to get our drinks, put in or orders, get our orders. Pretty much anything we asked for took forever to get was forgotten about all together. This was not the service I normally receive at this establishment. I hope it's just not going down hill."]], "date": "2018-11-04", "time": "03:32:27", "categories": "Restaurants, Greek, Mediterranean, Nightlife, Bars, Food", "city": "St. Petersburg", "state": "FL", "stars": 3.5, "business_review_count": 403, "predit_yelp_score": 0.125, "actual_yelp_score": 1.0}, {"review_id": "F0PRTjvno2zAAvMz-exA3A", "user_id": "EmlUfB8V2XBeIoyke7r8uQ", "business_id": "0wQCEcpZ57TmTm6EmEDsIw", "review": [["This is one of the worst bbq restaurants I have ever been to. I know my bbq and the first let down was no burnt ends on the menu. I was excited for the fried green tomatoes as well. I should have known this place was going to suck when they charge you for bread and its a damn dinner roll. The brisket sandwich I got was so fatty that it was half the sandwich, I cut off chunks of fat bigger than the meat. Her salad sucked so bad, it was a joke.Only thing I can say was good was the drinks. I liked my gf's paloma, and she liked the Moscow mule I ordered.  I would never go here for those drinks though, nothing else to eat or order to go with it. Stay away. Go to Pappys in the city, I don't have any interest in Pappy, just think its the best. Ive been to sugarfire and that is meeeh. If you want real bbq, go to KC and go to Oklahoma Joes or Jack Stack. That is amazing bbq"]], "date": "2018-11-24", "time": "18:07:33", "categories": "Food, Comfort Food, Restaurants, American (Traditional), Barbeque, American (New), Southern", "city": "St Charles", "state": "MO", "stars": 3.5, "business_review_count": 572, "predit_yelp_score": 1.525, "actual_yelp_score": 2.0}, {"review_id": "AAGBbYysl5JwG2V7cQhwLA", "user_id": "ZXjntGe8B4T5orkZTh_k2g", "business_id": "zMeFNx-CRBBWr-5jESUm2Q", "review": [["Dr. Levy treated me for sore shoulders and lower back.  He was very gentle and informative. He took the time to explain his findings. He educated me on preventative maintenance in the future. I am an accountant and sit all day. He is very professional and knowledgeable in his field. He showed me a roller and educated me on the use of it at home The roller has helped a great deal. I would recommend him to all my girlfriends.  He has the most utmost respect for his patients. I don't know where that other review came from. I think she has the wrong doctor."]], "date": "2018-11-08", "time": "23:48:38", "categories": "Chiropractors, Health & Medical", "city": "Santa Barbara", "state": "CA", "stars": 4.5, "business_review_count": 7, "predit_yelp_score": 2.05, "actual_yelp_score": 5.0}, {"review_id": "JgfV5kzLtHwtWLw1Y0f62g", "user_id": "ci4zheU8LnXIzobMR5855g", "business_id": "sSzqY2DFUp40XxLlR7ZmNA", "review": [["Service is lacking. On the verge of rude. Food was lacking in taste. Coffee was more like brown water. Very disappointed."]], "date": "2018-11-05", "time": "12:28:54", "categories": "Sandwiches, Cafes, Restaurants", "city": "Kenner", "state": "LA", "stars": 2.0, "business_review_count": 71, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "eddLyirnPnnr_gSY52UYng", "user_id": "K6mz_v2RDQ7hiX2uQZOKWQ", "business_id": "o6QW19rG1Xsy_ySsxqkpxg", "review": [["Every time I bite into their sandwich it reminds me of my grandmothers roast beef growing up. No offense to Nick's but this is the best beef in the city. If you are expecting a steakhouse setting with a a bunch of tables this isn't that... this is a small cafe with a huge cut of the best roast beef piled high on a fresh Kaiser roll. The staff here makes you feel at home and I love coming here. I suggest a long hot to accompany this little piece of art ! Extremely addictive."]], "date": "2018-11-15", "time": "19:35:05", "categories": "Coffee & Tea, Sandwiches, Restaurants, Food, American (Traditional), Breakfast & Brunch, Fast Food", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 26, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "Y_T82XpaqxbW_nke-_G0aA", "user_id": "sE652yUHX4qfYVWh6jXBPA", "business_id": "REiAM73RkOxFqCVlEFiRWA", "review": [["Went for food and drinks. My sister got the cotton candy martini which was very cool looking. I got the vegan friend chicken wrap and OMG it was delicious! I plan to travel out there again soon just to enjoy it again! Highly recommended!"]], "date": "2018-11-12", "time": "16:00:53", "categories": "Lounges, Nightlife, Bars, Restaurants, Vegan, American (New), Dive Bars, Sandwiches, Cocktail Bars, Burgers, Local Flavor", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 692, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "AYTa54yhDqluGKN7n_Hb-w", "user_id": "oAqj5kppLSnBpLxZ6Xo5xA", "business_id": "HTDpe_9wVAch0kRZtRmAvQ", "review": [["Checked this place out today after my wife had been to the City Ave location a few times and talked highly of it. To be honest, the food was ok. It was like lunch and a show for the price, which this will focus on. \n\nWe were there around 1:45pm today, Sunday, and it was like opening day. People everywhere waiting for food, for seats to open up, everything.  Online order pickup, dine in pick up, the drink and cutlery station and the only trash can in the entire place was all within arms reach of the main counter which made for a lot of frustrated shuffling amongst customers and the staff. We ordered and found 2 bar stools facing the wall. While my wife kept a seat for me, I waited near the register for our order as employee April running the counter, who appeared to be the manager, was putting minimal effort into using her voice to call names for ready orders. The order screen has the option to put in your phone number to get a text when your order is ready, but we all know that's strictly for marketing purposes and I don't give out my number like that. Frankly, I find it unnecessary in a space that I could walk end to end in 10 seconds. Put in a PA system for when it's busy. \n\nWhile I waited for the food, about 25 minutes, I heard an employee come to who April and say \"we need arugula\", she was to go get it from the refrigerator and the employee said she didn't see any. No remedy attempt made that I heard while I continued to wait so I can only assume there were some unhappy folks who ordered a salad later. Also during this time, I saw 2 different patrons come to the counter to collect their order and pay cash and the same manager, seemingly very annoyed by the customers intent to pay, shrugged them off and told them that the computer system wasn't allowing them to take cash currently, almost in a \"tough sh*t\" tone, then sent them in there way with free food. That looked real good to the 15+ other customers standing around who had already paid with a card. When our order came up, I picked it up and there was only one fountain drink cup while we had ordered 2. I mentioned this to April and asked for a second cup. She told me \"there's only one on the order.\" As I was about to remind her I had just seen her send customers home with at least $60 in free food and I had clearly paid for 2 drinks, even though Honeygrow doesn't print you a receipt to combat the argument, she just slapped one down on the counter and walked away. \n\nPresentation is as important as taste and the taste at the KOP Honeygrow didn't make up for the poor presentation by the manager."]], "date": "2018-11-05", "time": "03:21:10", "categories": "American (New), Restaurants, Vegetarian, Salad, Noodles, Vegan", "city": "King Of Prussia", "state": "PA", "stars": 3.5, "business_review_count": 159, "predit_yelp_score": 1.1, "actual_yelp_score": 2.0}, {"review_id": "D8TpEL5R8CYl2z47LS9RtA", "user_id": "kYNAdzk9ofmaZYmTciYxCA", "business_id": "ExcFu7R8ATHczORJ4opEUA", "review": [["A step above your average diner in terms of variety of dishes. I had the omelette special which had asparagus, ham, and a hollandaise sauce, very yummy! The other special for the day we're Reese's pancakes, sounded divine if not a little too indulgent for me! My son loved the kid pancakes and bacon. Staff was super friendly and attentive, we never even had to ask for refills!  This place is less than two miles from our house so we will definitely be back!"]], "date": "2018-11-18", "time": "16:22:51", "categories": "Breakfast & Brunch, Diners, Restaurants, American (Traditional)", "city": "St. Petersburg", "state": "FL", "stars": 4.0, "business_review_count": 552, "predit_yelp_score": 2.6, "actual_yelp_score": 4.0}, {"review_id": "SnTaCkfPNAp8EvxQWrhisw", "user_id": "jyYFzL9JCJJfejd3lJ-vRg", "business_id": "o8lpZb2Sb4EPFhqFMdy6HQ", "review": [["Fun, affordable, personalized wood sign art. Lots of fun with a group; BYOB and snacks. Bring some friends. You'll be there for 3 hours and they walk you through the whole process without feeling rushed or ignored. Being creative was fun."]], "date": "2018-11-18", "time": "23:37:09", "categories": "Arts & Crafts, Shopping, Arts & Entertainment, Education, Art Classes, Paint & Sip, Event Planning & Services, Venues & Event Spaces", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 6, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}, {"review_id": "7YrMSpCMKIG92Vc_OUIcBQ", "user_id": "IXIOYDH8JgaEZMqhLiGxFQ", "business_id": "ZM46RDLXaFNo_z6t-j_L4w", "review": [["The owner and all the staff of Absolutely Perfect Landscaping were courteous, responsive , professional and friendly. The landscaping and tree removal they did for our property was awesome- beautiful and professionally priced. Im not a fan of YELp as they try to influence you to review positively but trust me these people at Absolutely Perfect are the BEST"]], "date": "2018-11-17", "time": "04:04:46", "categories": "Masonry/Concrete, Gardeners, Lawn Services, Tree Services, Landscape Architects, Home Services, Contractors, Landscaping", "city": "Bensalem", "state": "PA", "stars": 3.5, "business_review_count": 5, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "4Enc5F9Mu36cO0Zj458DOQ", "user_id": "jwzyRCn2MMWigSUJxmLnJw", "business_id": "1E21KhW87jqQGuzYSxG_xQ", "review": [["My mainstay is China King for Chinese delivery but to save a four lousy dollars I ordered from Hon's Wok.   Same dish beef with broccoli, cheaper but inedible.    China King is so much better, my favorites are their beef with broccoli, house soup, crab ragoon, sweet and sour soup, trust me you can never go wrong ordering these dishes.   Not a fan of their egg rolls or sweat and sour anything but I have been spoiled by expecting pinapple and green peppers with the dish, just a suggestion China King as you do vegetables awfully well."]], "date": "2018-11-11", "time": "01:19:32", "categories": "Chinese, Restaurants", "city": "Saint Louis", "state": "MO", "stars": 3.5, "business_review_count": 64, "predit_yelp_score": 1.3, "actual_yelp_score": 5.0}]