[{"review_id": "Vz07-RqbzFMOAYoXKESNNw", "user_id": "oCBqQ2EXU9guijyD_XNDcg", "business_id": "SIiz0OS6tt_Gg2HmGd1CBQ", "review": [["What has happened to this place when Daniel the original Daniel and the young lady who used to be here. It seems like every time I have come in to get something done. I felt like I was a bother so I will be looking for another place. I have been using their services for over 3 yrs. Don't know what u have until u lose it."]], "date": "2021-11-23", "time": "15:11:01", "categories": "Public Services & Government, Local Services, Shipping Centers, Post Offices, Notaries, Printing Services, Mailbox Centers", "city": "Hudson", "state": "FL", "stars": 4.0, "business_review_count": 11, "predit_yelp_score": 0.42500000000000004, "actual_yelp_score": 1.0}, {"review_id": "yeaACJbvSz8Vx3bPMaxCug", "user_id": "5j1JfE-ARcprpqmOP39F4Q", "business_id": "lNkxXDcNoHBpWDNPoZesYw", "review": [["We expected the views to outweigh the overall dining experience but we could not have been more wrong. Amazing dishes, staff and ambiance. Omar and John took fantastic care of us - we will be back and will recommend to anyone that will listen."]], "date": "2021-12-07", "time": "15:14:27", "categories": "Vegan, Restaurants, Italian", "city": "Montecito", "state": "CA", "stars": 4.0, "business_review_count": 88, "predit_yelp_score": 1.675, "actual_yelp_score": 5.0}, {"review_id": "VajeYdvISnheZX9oJD5uzw", "user_id": "rcrYGfPHXAXoE4uW3hSeoA", "business_id": "cdP-dkIqdkmucOxW75JDJQ", "review": [["Small place with great beers to choose from but really didn't see any food being offered. Really appreciate the great customer service and cleanliness of the place."]], "date": "2021-11-16", "time": "18:17:16", "categories": "Breweries, Food", "city": "Saint Petersburg", "state": "FL", "stars": 4.5, "business_review_count": 48, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "H2nCVsJJuAMMvR3NWacA_A", "user_id": "519f9DOnAHjs5L_XIjkBAg", "business_id": "mUkkLhmjiQJ5VXZaDEGaLg", "review": [["I had an appointment at 3:00 for an acrylic full set. I get there on time but they started my set at around 4:00. \nThe guy that did my nails was rude and rough with my nails to the point where the nail filing was burning me. \nI wanted a gel polish and he did it to me, but the edges of the nails were not completely painted and even one of them has a bubble. He was rushing and I got my set done in around 20 minutes, which proves my point that it was not a good job. \nHis table was dirty and he didn't even wear gloves!! \nOverall a bad experience, I won't be coming back to this place and please don't come here!! \nThe prices are cheap but trust me it's not worth it at all. \nI have to say that the lady at the front is very welcoming and nice, but she was taking 3 girls at a time."]], "date": "2021-11-22", "time": "22:18:17", "categories": "Eyelash Service, Beauty & Spas, Hair Removal, Nail Salons", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 49, "predit_yelp_score": 0.47500000000000003, "actual_yelp_score": 2.0}, {"review_id": "j9lQFPHNNFt8qLNsHZ2axg", "user_id": "bNs9SFLTC3Gf1NRk3ga7nQ", "business_id": "5laAS2jqxb1zuXbZbPbgVw", "review": [["i've tried giving this place multiple chances but every time i go i am disappointed with my nails-the prep and shape is always lacking. plus the last time i went the employee kept trying to take my acrylics off with a tip, instead of soaking them which is what i asked for. i said it was hurting my multiple times and they just kept trying to pry my nails off with the tip... 0/10 they just care about getting people in and out rather than quality nails"]], "date": "2021-11-30", "time": "00:30:26", "categories": "Nail Salons, Waxing, Nail Technicians, Beauty & Spas, Hair Removal", "city": "Carmel", "state": "IN", "stars": 3.0, "business_review_count": 71, "predit_yelp_score": 0.6250000000000001, "actual_yelp_score": 1.0}, {"review_id": "cNjBNGGsIfw5JMXGhIiLAQ", "user_id": "zyvxtbh5eJ86bVgk52Yflg", "business_id": "kpK6SmxIiNoGPNhlEGiL4w", "review": [["This has been a favorite of mine for many,  many years. Nothing has changed, still a favorite. We recently discovered their happy hour (don't know why we hadn't been coming to this until just this past year). As my fiancé lives down the street, we love to come early and post up, order apps, drinks, and then of course, migrate to the full menu for dinner. Their pastas and salads are always a great choice, have not yet had one I dislike. The only thing I don't *love love love* is the pizza/flatbreads, but everything else about this establishment is fabulous. We will continue to come here as a part of our regular dining our rotation, and suggest you make it part of yours as well!"]], "date": "2021-11-18", "time": "15:21:33", "categories": "Italian, Local Flavor, Restaurants", "city": "Saint Louis", "state": "MO", "stars": 4.5, "business_review_count": 383, "predit_yelp_score": 2.6500000000000004, "actual_yelp_score": 5.0}, {"review_id": "zTFUoTDVjmeN1MR2B8mzag", "user_id": "b99JwsNxPnrpBOntZQQWSQ", "business_id": "vAtVp9NI8uyqDM7Wi7pcVA", "review": [["We did the tour of Oak Alley Plantation.  Our guide and driver, Alton, was just the best. Extremely knowledgeable and a great talker."]], "date": "2021-11-27", "time": "17:00:04", "categories": "Tours, Hotels & Travel", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 367, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "loxFpIIZ0RLBTiIFHkjSeg", "user_id": "Y1JFzsKzbYrkQuGaX4Si9A", "business_id": "1VyPnOVPfc2KuBoOQTS4yA", "review": [["I had a great experience at this Visionworks. The exam was thorough, the frame selection & fitting, with Heidi, was also, very thorough. The new glasses were ready a week ahead of schedule & when I picked them up, Mary made sure I was comfortable with the new prescription."]], "date": "2021-11-20", "time": "22:02:14", "categories": "Optometrists, Eyewear & Opticians, Shopping, Health & Medical", "city": "Royersford", "state": "PA", "stars": 3.0, "business_review_count": 20, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "j7Gj-KbATpniWgo0TEg61A", "user_id": "G1NAzWyjo1NKKg3mArnvxA", "business_id": "9xdXS7jtWjCVzL4_oPGv9A", "review": [["One word for the is place...Perfection. Everything was great from the drinks to the food. You can't go wrong here. The service was top notch.\nThe seafood was made to perfection, everything we tried was nothing short of excellent. The salmon was exceptionally delicious, best salmon I've ever had anyplace. The fish was flaky, delicate and the crispy skin was crisped to perfection. The flavors where all spot on. The chocolate martini for dessert was mixed deliciously well with a bold chocolate flavor without the overpowering sugar taste, an excellent martini. The GW tini was a good pre dinner drink."]], "date": "2021-12-06", "time": "15:09:49", "categories": "Seafood, Gluten-Free, Vegetarian, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 2443, "predit_yelp_score": 2.5999999999999996, "actual_yelp_score": 5.0}, {"review_id": "VwZsw6ygMIOENYFMskibxQ", "user_id": "w1xYVM1T43UA5hinahjd5A", "business_id": "yG3XdbrqT1EYmSbHtBuvjQ", "review": [["The appetizers were good. The meals were okay. The Manhattan cocktail was like a bunch of mashed cherries.\n\nThe fanfare around being a trendy cocktail bar and fresh daily was super forced. Don't state your vibe - show it. Your in an office park for goodness sake just serve good food because the pretentious vibe was a bit over-powering."]], "date": "2021-11-18", "time": "19:33:18", "categories": "Restaurants, American (New)", "city": "Yardley", "state": "PA", "stars": 4.0, "business_review_count": 12, "predit_yelp_score": 1.9249999999999998, "actual_yelp_score": 3.0}, {"review_id": "i9f066sr0AvUglPVuEB01Q", "user_id": "xb94NuEDyt0fzrrV4kBq3w", "business_id": "ws2gnWU77nydKJB81GXT9g", "review": [["Great locally owned Nashville hot chicken \nNo franchise here \nGreat friendly courteous helpful staff \nSpot on \nMy go to better than most hot chicken places in Nashville"]], "date": "2021-11-28", "time": "21:34:42", "categories": "Restaurants, American (Traditional), Southern, Chicken Shop, Fish & Chips", "city": "Franklin", "state": "TN", "stars": 4.0, "business_review_count": 411, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "G7xEQ5m0Tm877S7v5NG0Zw", "user_id": "e5hwGgorUG6KX-eSO_UCcA", "business_id": "PndbFVbHE4730HDlghxv6g", "review": [["I could go back and forth on this being a 3 or a 4 star because it does seem to vary from visit to visit. I have had really good experiences and then okay to really bad experiences. \n\nSome advice, no matter when you go, expect a wait to get your oil changed. Even if you go to get in line for when they open at 7:30am, there most likely will be someone there before you. Also, these are not 20 minute changes. They do take longer than oil places that just specifically change oil. They do have a nice waiting room with a coffee machine, a tv and wifi along with hightop tables for you to be able to work if need be. I have taken my computer with me several times. \n\nDuring one oil change the tech did not put my plug back in after doing the oil change so my oil just flowed right back out. While getting on US 19 all of a sudden my car totally froze up and turned off. Talk about scary because there was a ton of traffic all trying to get on 19 and it wasn't a good spot to break down (where is really). So I had to call a tow truck for my car to be taken all the way to Jim Browne in Tampa because my car has a warranty on it and they have to do the oil changes and work on it. Plus I was close to a Jiffy Lube and they were nice enough to come out and look at my car and confirm it was the oil plug. So tow truck costs all the way to Hillsboro from Pinellas and then a rental car because it was going to take them several days to fix all the damage their incompetence caused. I did talk to a manager about the situation and being refunded the costs and was told that they would submit everything to corporate for the refund. Well... during that process that person was fired and the new person new nothing of it. Thankfully, I always follow up via email and had the conversations to forward. After more back and forth I finally was able to get my refund in full. What a pain. \n\nMost of the time everything runs smoothly but at a slower pace than what I feel an oil change should take. My last trip I had a hour and a half wait."]], "date": "2021-12-02", "time": "14:30:52", "categories": "Automotive, Auto Parts & Supplies, Car Dealers, Auto Repair", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 76, "predit_yelp_score": 1.075, "actual_yelp_score": 3.0}, {"review_id": "Fbtb_YdzbVsvdCOubmUveg", "user_id": "5ivGF4NF-d3YOfvlduL9tg", "business_id": "Fs4T7lKpXVtD5Pz7jWSJeg", "review": [["Sometimes I'd like to eat without having to have it political.   Charging a 5% wellness fee is ridiculous.    Should they provide health insurance to their employees? Yes.  Should they raise the prices to cover this? Yes.  Should they tell me all about it? Yes.   The 5% \"fee\" feels way too preachy.  \n\nThe entrees were excellent.   The descriptions left a lot to be desired and the waitstaff made no effort to describe the dishes.   For instance the flounder came with Brussels sprouts.  Well the Brussels spouts were part of a nice sauce.  I'm still trying to understand how the  meal came with no side items....  There were appetizers, small plates and large plates.  We ordered all three.........\n\nSpeaking of, the sweet potatoes were the best I've ever had.   Maybe they should have been included with the main meal."]], "date": "2021-12-05", "time": "13:34:17", "categories": "Restaurants, French, American (New)", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 784, "predit_yelp_score": 1.5750000000000002, "actual_yelp_score": 3.0}, {"review_id": "IKgdIzGyuL80Es-Je_pgHQ", "user_id": "_RXyWUToXIH1Fe5EEOtaKw", "business_id": "-WFaU3i9zztFMO7WoPAPcw", "review": [["I feel like I've been bamboozled. Bought a 2013 Jeep from Mike Talbert, they were quick to get me from test drive to sitting down with Jim Turner in finance to sell the vehicle. Walking in I knew my trade-in value was close to $10k, they only gave me $7500, fine whatever. They attached a warranty I wasn't made aware of, which actually turned out to be a good thing, but I wasn't told it was being added or that I was even getting one. Less than a month later, I have to take my Jeep to be serviced because it's making noises from the engine. I call Mike back and he tells me to take it to any Jeep dealership to have the work done. I take it to a Jeep dealership close to my house and when they try to contact the warranty company they're told the selling dealership has to provide a diagnostic code to authorize the work to be completed. I contact Mike back and he gives me his managers, Kendall's cell number. I contact Ken and get attitude because I called his personal cell. After getting the run around from Ken and team I'm stuck with Dayton having to perform the work on my Jeep. Basically if you get a warranty, you're limited to only taking it to Dayton to have it fixed because they wouldn't provide the diagnostic code for the other dealership to complete the work. I'm now three days into trying to have my Jeep fixed and now it has to be transferred to Dayton for them to start over with the diagnostic and repair for the warranty company to authorize the work to be completed. If you live out of state or not close to the dealership, don't buy from Dayton who knows how long you'll be stuck without a vehicle if it needs work done."]], "date": "2021-11-17", "time": "18:13:48", "categories": "Car Rental, Automotive, Body Shops, Hotels & Travel, Car Dealers", "city": "Saint Petersburg", "state": "FL", "stars": 2.0, "business_review_count": 83, "predit_yelp_score": 1.3, "actual_yelp_score": 2.0}, {"review_id": "n_BUR2uzIBL6bQHeEMrqBQ", "user_id": "AENHYAwEr7Nl71_cz2pXNg", "business_id": "7oPfvsdBiXL10loCDzpMAw", "review": [["I called Audi WC to buy out my lease. The dealer wanted to charge almost $1,000 for a \"required\" inspection, but neither Florida nor Audi Financial Services, which owned the lease, require an inspection. \n\nFortunately, not all car dealers are like this and I found another dealer who did not even try to add these unnecessary fees.\n\nAudi WC gets one star for trying to rip me off."]], "date": "2021-11-16", "time": "17:10:11", "categories": "Car Dealers, Automotive, Auto Parts & Supplies, Used Car Dealers, Auto Repair", "city": "Wesley Chapel", "state": "FL", "stars": 4.0, "business_review_count": 22, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "Y70b-hO9LRly2KRpjRUVkg", "user_id": "YWuEGa_Y-4lcTbRq2-n3jg", "business_id": "DTauypqmEZn79GudhRZU9A", "review": [["Love Maya! She's so kind and meticulous. She does a wonderful job every time. I love coming to this place because they have the best nail colors as well."]], "date": "2021-11-28", "time": "22:19:33", "categories": "Beauty & Spas, Nail Salons", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 22, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "u2KvOwK-PVm0R1rJHamhMg", "user_id": "bfBwXhvIE1VopuDswdAHQw", "business_id": "Jbcvph3PQYXAEUjI7ESA4w", "review": [["Story time. I went last Monday (11/22) to buy a MacBook Air at this Best Buy - I asked  the sales person if there were going to be any Black Friday (11/26) sales on the computer and if there were I'd just wait a few days to purchase it. He told me \"no, there are no Black Friday deals available for this computer\". So I made my purchase and went on my merry way. Come to find out that there WAS a Black Friday deal for $150 less than what I paid. I went this week and told the customer service personnel what had happened and was only asking for the price difference. They told me there was nothing they could do. I reiterated \" the sales person straight up lied to my face\" - and they continued to tell me they couldn't do anything. I ended up returning the laptop and told them I'd be purchasing it elsewhere. The end. Thank you for coming to my Ted talk..."]], "date": "2021-12-04", "time": "06:03:22", "categories": "Electronics, Shopping, Computers, Mobile Phones", "city": "Goleta", "state": "CA", "stars": 2.5, "business_review_count": 169, "predit_yelp_score": 1.75, "actual_yelp_score": 1.0}, {"review_id": "r0ghjzM4GK5pwjtplSxIVg", "user_id": "qDVUmAjjmTm8Hrvj4AUqEQ", "business_id": "A3rjcug-67WXjW0PstNVDA", "review": [["GREAT Peruvian food, written by a Peruvian. The spice levels and acidity of the Ceviche and Leche de Tigre were perfectly balanced. The aji de gallina sauce was creamy and hearty, though I would have enjoyed a bit more rice to mix in. We also ordered papa de huancaina and anticucho as appetizers. The former actually a little kick to it, which I enjoyed, and the later was a bit tougher and chewier than expected but had a beautiful flavor and was well seared. Overall, our whole table had no complaints on any of the food or servings given."]], "date": "2021-11-25", "time": "01:39:11", "categories": "Restaurants, Peruvian, Food, Food Trucks", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 6, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "niENbyvywAsoex9MaQMpTQ", "user_id": "e5hwGgorUG6KX-eSO_UCcA", "business_id": "zuYAZivPiTYXtwwsrberQQ", "review": [["I am always blown away by the creativeness and skill set that the sand artists have. This is my first time to experience Sanding Ovations. \n\nIt is located on Teasure Island Beach in front of Sloppy Joes. If you get there early enough there is the beach parking you can use but also plenty of event parking throughout the area that you'd just have to walk a little from. The beach parking is hourly so if you plan on spending some time down in that area walking around or eating after you see the sculptures it may be worth your bang to get into one of the flat rate parking locations. \n\nThis event had an opening weekend with all the works, vendors, music, etc but was open all week basically 24/7 because it is not in tents or a secured area like the Sugar Sand Festival in Clearwater is. I went during the week early to avoid as many people as I can for my photos. They were also having an encore weekend the following weekend that would also have all the vendors, etc. \n\nEach piece you could fully walking around to get different angles for photos and see just how much detail went into these temporary pieces of art. Just beautiful and though a little windy when I went, the weather was perfect. \n\nThis is a free event but they did have a donation box out that noted to help keep this free, donations are welcomed."]], "date": "2021-12-02", "time": "22:02:34", "categories": "Festivals, Local Flavor, Arts & Entertainment", "city": "Treasure Island", "state": "FL", "stars": 3.5, "business_review_count": 10, "predit_yelp_score": 2.35, "actual_yelp_score": 4.0}, {"review_id": "Kyc5ir3oNsdn3TSxxxP8SA", "user_id": "Bo9OLVUO6bUDNL-EKBBzRQ", "business_id": "Zmwm6d872C8kWJr4b6UGfg", "review": [["10 tables in the restaurant.  Arrived12:30 on a Friday, I took last open table.  It was 10 minutes before my order was taken. Slow for them. But to be fair,  in past there were at most 3 tables with people on other visits.  I suspect Huge carryout business.  I love every dish I have tried here.  This day, I tried ginger lover with chicken.  For lunch you also get a cup of soup, salad and spring roll.  This place has not disappointed me yet.  Excellent food!!!!"]], "date": "2021-12-09", "time": "01:03:50", "categories": "Thai, Restaurants", "city": "Carmel", "state": "IN", "stars": 4.5, "business_review_count": 73, "predit_yelp_score": 1.875, "actual_yelp_score": 5.0}, {"review_id": "q7bYLlnhCcdYXtik6uYHEQ", "user_id": "5DS_sMYyILbykriNUrJsJg", "business_id": "gC62IRqhvFg3-WWAtTZ_pw", "review": [["Visited Avenue kitchen for the first time today. I'm giving it a 5/5 for one reason and one reason only, my server Shelby Moore. She was very well educated on the menu, she was very respectful, and she was very prompt with the service. Never in MY LIFE have I been as satisfied as I was with Shelby. The food was excellent, the drinks were Superb, and overall, Shelby is the reason I will be back."]], "date": "2021-12-04", "time": "22:06:21", "categories": "Cocktail Bars, Nightlife, American (New), Breakfast & Brunch, Restaurants, American (Traditional), Bars", "city": "Glen Mills", "state": "PA", "stars": 3.5, "business_review_count": 132, "predit_yelp_score": 2.45, "actual_yelp_score": 5.0}, {"review_id": "3s9VIjY6a4N0sdMdtj2JnA", "user_id": "lKTNKY635rEXohBVu8ZhEA", "business_id": "0l3rta_iJ8Jg59FD3v0huA", "review": [["This place is amazing! I'm a big pizza fan and folks let me tell you it is the BEST pizza in Reno. The Detroit style pepperoni pizza was soooo good. I haven't tried the wings but you can bet I'll be back to give them a try. Good parking too."]], "date": "2021-12-03", "time": "18:40:38", "categories": "Food, Ice Cream & Frozen Yogurt, Restaurants, Chicken Wings, Pizza", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 62, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "mAIwsZ5XSx1Jqm5bs2cRxQ", "user_id": "NgWsLh-JAtGAqXsP1UGIrQ", "business_id": "pqZYSvF_qrmCjkr6frf4RQ", "review": [["Meat is always solid. This is the place to bring people who are visiting the city. Brisket is perfectly done and pulled pork is just perfect. Garlic fries are a must. They also do a very tasty brunch on the weekend. It's nice how they have some rotating features as well to keep things interesting. Highly recommended for a very satisfying meal. Also want to add that the service is fantastic. The server I spoke to said she worked there more for enjoyment which really speaks volumes about how this restaurant values their staff."]], "date": "2021-11-25", "time": "22:30:08", "categories": "Southern, Barbeque, Restaurants, Breakfast & Brunch, Sandwiches, Canadian (New)", "city": "Edmonton", "state": "AB", "stars": 4.0, "business_review_count": 420, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "JPD8Wg7NSWS6zPGa5PNS5A", "user_id": "Bfduto0UkwQ6SpzRDfMhnA", "business_id": "xmOpIseR7tQwoOE5r5BxRA", "review": [["Found this gem through reviews on Yelp! Took my family for a night out to try something not very common - schnitzel! Easy to find with Google Maps. Good parking right infront but lots of signs to beware of where you park or risk towing. Friendly waitress seated us right away. For a Thursday night there was only 1 other couple there. We went at 6pm. Cool decor with a relaxed feel. Not exactly romantic but very relaxed and family friendly. The menu is extensive -  It took quite a while to make a decision with All the choices! \nOne of us got the pepper, one of us got the one recommend on the menu - Jagerschitzel, and I really wanted to try the garlic butter so I went for the Prairie. \nFree salad was given quickly after ordering which was a great snack but quite tart for my taste. \nOur meal came in what I thought was a reasonable amount of time. \nThe pepper one was exactly as described very pepper like. Not hot spicy but like you dumped the whole pepper shaker in. My friend loved it. \nMy other friend liked their Jagerschitzel but I actually found the sauce too BBQ like instead of creamy. \nMy Prairie was ...interesting with the Kraft processed cheese. Real peices of bacon! The garlic butter was frozen like a rock so difficult to spread and didn't add a lot to the dish in flavor.\nPortions looked great but actually we didn't end up with any leftovers at all considering we all got full orders. \nThe potato salad was loved by everyone. The potato croquettes were very good but soooo pricey. Paid an additional $5 to an already $25 dish for 5 deep fried mashed potato balls. Worth trying once but I don't think I'll get them again. Didn't seem to have a lot of other seasoning inside but very nice crispy and fluffy inside. \nI was out of water for quite a while before waitress came to refill but otherwise great service.\nIf you want something different or love schitzel this is the place!"]], "date": "2021-12-03", "time": "21:56:02", "categories": "Restaurants, German", "city": "Edmonton", "state": "AB", "stars": 4.0, "business_review_count": 23, "predit_yelp_score": 2.1999999999999997, "actual_yelp_score": 5.0}, {"review_id": "KcixuPJqtsmFp--nXNZeiA", "user_id": "s3SVQ5Wv3wj9hDfvJzmKdA", "business_id": "U6-MhrZh6StnsRORuI12rQ", "review": [["This place had terrible service and very rude people. They tried to deny me service almost two hours before they closed and acted like they did not care about my concerns. I do not recommend getting service from this urgent care, if you want someone to actually listen and try to help you, find another place to go."]], "date": "2021-11-16", "time": "00:25:04", "categories": "Urgent Care, Health & Medical, Emergency Rooms, Medical Centers", "city": "Saint Charles", "state": "MO", "stars": 3.0, "business_review_count": 8, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "kgAcUZprmNgdAyFtDVPABw", "user_id": "fPaC7XVxTtjSe2QcsNADGQ", "business_id": "4ETJ4EMbT3zumbmAPqUj9Q", "review": [["I'd like to tell you I actually got my tattoo from Gia Rose. I can't do that. My wife put a deposit for a session with Gia in February of this year as a gift for our 20th wedding anniversary. I was very excited as we followed Gia from the time she was on ink masters through Ink masters Angels. I was re-scheduled three times over a period of seven months. Her booking assistant asked me what days work. When she finally gave me a date I took it, even though it was on a day that I said I couldn't do. I took a personal day from work so I could finally get my tattoo done. At 9:45 PM, the night before my tattoo session, Gia's booking assistant texted me that she couldn't make the appointment and could I reschedule for December 23rd.  At this point I asked for  a refund of my deposit. No call back , no text, no response until 7am the next day which was simply a notice of refund. This has been the most unprofessional experience I have ever had. There are plenty of amazing tattoo artists that will treat you with respect. This is not one of them."]], "date": "2021-11-22", "time": "16:33:44", "categories": "Beauty & Spas, Piercing, Tattoo", "city": "West Chester", "state": "PA", "stars": 2.0, "business_review_count": 8, "predit_yelp_score": 1.4, "actual_yelp_score": 1.0}, {"review_id": "em1adDXUFMh9FKOMYwQXJw", "user_id": "DaKAv5Ytms0Sz8wwIN7gtA", "business_id": "yKgxtgSBkDeuBsfjQVV-jA", "review": [["If you want food fast .. serve\nTypical Chinese dishes .. pick up service .. fair prices"]], "date": "2021-11-17", "time": "03:46:45", "categories": "Chinese, Restaurants", "city": "Smithton", "state": "IL", "stars": 4.5, "business_review_count": 5, "predit_yelp_score": 2.85, "actual_yelp_score": 3.0}, {"review_id": "mBJZQPtyNv4OHSgqsvEpqA", "user_id": "tZPKqCgxNYbuK4RP6LHpQQ", "business_id": "IKoGxUd4AUmLzoyZO8wJxA", "review": [["Good, local, hidden gem. Good food a nice people. We had the bacon cheeseburger (way more than a mouthful), blackened mahi sandwich (perfectly cooked and fresh) and the grilled shrimp house salad (shrimp were not overcooked like many places do). Give it a try."]], "date": "2021-11-20", "time": "01:23:04", "categories": "Sandwiches, Wraps, Burgers, Restaurants, Seafood", "city": "Madeira Beach", "state": "FL", "stars": 4.0, "business_review_count": 19, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 5.0}, {"review_id": "JhGNtvzY2WYaepW67pgvew", "user_id": "Tg3rYpCNLdYLlhC73C6xNg", "business_id": "sxuv5uZU15UHGT_HB1xYxQ", "review": [["Looks like they listened to my feedback. Permanently keeping French Fries separate from the burger would have ended the business. Glad to see the change."]], "date": "2021-11-19", "time": "03:32:13", "categories": "Bars, Burgers, Restaurants, Nightlife, Sports Bars, American (New)", "city": "Santa Barbara", "state": "CA", "stars": 3.5, "business_review_count": 197, "predit_yelp_score": 2.5, "actual_yelp_score": 1.0}, {"review_id": "Hw78zz-6atFmiTl_RKLsGg", "user_id": "5CD5iG4qAOXpdTyC-shwZw", "business_id": "_r3VMCI_pYtqc_9Ij5iWcg", "review": [["Took my Ram in for oil pressure problem. They got on it right away. In less than 2 hours they fixed the problem. I used them many moons ago when the were on Metairie Road. Excellent work."]], "date": "2021-12-09", "time": "22:28:07", "categories": "Auto Repair, Automotive", "city": "Metairie", "state": "LA", "stars": 5.0, "business_review_count": 5, "predit_yelp_score": 0.8500000000000001, "actual_yelp_score": 5.0}, {"review_id": "cZHwTzR55ZkXaD4LxNyhkw", "user_id": "5Dk6Mk4QRoE06ZaHakM4cw", "business_id": "STtVemevd30WoiZWn_taiQ", "review": [["Pre-covid this place was Awesome. Now it's always a mess. I was there today at 130pm again. Lobby cans  were stuffed to the max. They are out of cilantro sauce and chopped onions. No one could be bothered to make more. Order was wrong and I couldn't find a place to put my dirty tray. And I was the only customer in the store! Management not to be found, they even left their laptop unattended in empty lobby'. Chicken was tiny and dry."]], "date": "2021-12-02", "time": "02:57:17", "categories": "Latin American, Chicken Shop, Fast Food, Restaurants, Caribbean, Cuban", "city": "Oldsmar", "state": "FL", "stars": 2.5, "business_review_count": 84, "predit_yelp_score": 0.625, "actual_yelp_score": 1.0}, {"review_id": "ThxQOUJiP54LEulR73wfDw", "user_id": "_lBqEu08_E4RzqZi6vREaA", "business_id": "GbmzMCvzhbAun6SlwZdFPw", "review": [["Great people and great service. Simple as that. \n\nI started going to Jester a few months back with a shoulder issue. They quickly realized the problem was in my neck and within a couple of weeks the pain was gone. \n\nSome people say they're \"pushy\" or force you into long term \"contracts\". I didn't sign a contract but was given a plan of action which was up to me to keep up with. I don't see them as pushy at all. Patients go to Chiropractors thinking they will have all of their problems solved in a few visits, doesn't work that way. You have to commit to the program and keep up with it. You can't go to the gym 3x and get a six pack. \n\nI was always down on Chiropractic care before this but now I'm a true believer! It works wonders if you commit."]], "date": "2021-11-19", "time": "02:20:49", "categories": "Health & Medical, Chiropractors, Nutritionists", "city": "West Chester", "state": "PA", "stars": 3.5, "business_review_count": 11, "predit_yelp_score": 1.55, "actual_yelp_score": 5.0}, {"review_id": "C68VbPz0xw2llPDR06CSfA", "user_id": "XgyM_Ba2l65zhyYJQn978g", "business_id": "IL-_7eyOTxQEsdVrI5xl-g", "review": [["I Loooooove Taco Bus' queso and that they have plenty of vegetarian and fish options as well. \n\nOn this recent trip I tried the fish burrito which admittedly wasn't my favorite. It had blackening season from the description but it was grilled and wet, didn't achive the blackening I was expecting. The shrimp were cooked really well though, not underdone and not overdone and rubbery, just right. \n\nMy husband had a beef burrito and said it was good. \n\nWe had a lil hanguo w my Daughter's food that we took to go. When we were home we discovered that the beef quesadilla we ordered with just the beef and cabbage was taken literally and had no cheese. A bit confusing as that literally makes it not a quesadilla anymore. We added cheese at home for her but still annoying. \n\nChips and queso were of course fantastic. \n\nI forgot to take photos. Maybe next time :)"]], "date": "2021-12-02", "time": "18:08:57", "categories": "Mexican, Food, Food Trucks, Vegetarian, Desserts, Restaurants, Vegan", "city": "Lutz", "state": "FL", "stars": 3.5, "business_review_count": 57, "predit_yelp_score": 1.125, "actual_yelp_score": 4.0}, {"review_id": "DKbD6T3XV7YHDV7rVNgMrA", "user_id": "R1ruXeywVpmOKqZFvcwhMQ", "business_id": "evxhNYa77dxWZabIpGQCkg", "review": [["Haru is the best ramen place in town hands down. They also offer other Japanese cuisine that you can't find in Reno. Is the ramen the best ramen I've ever had in my life? No, it's not. I have been to Japan and I've had ramen from many different places there. But, I can say that their ramen is delicious and so is everything else on their menu. I have had food in Japan that wasn't as delicious as the food you will get at Haru. The wait staff is always super friendly and the  food comes out quickly. I did have someone that was rude to me once while placing a pick up order. But we all have bad days. The food is delicious and worth your time and money if you want some Japanese comfort food."]], "date": "2021-12-01", "time": "19:38:48", "categories": "Restaurants, Izakaya, Ramen, Japanese", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 202, "predit_yelp_score": 1.7, "actual_yelp_score": 5.0}, {"review_id": "7QOoO4MFc0DF-EH8sLeNWg", "user_id": "u4SpPgA1bIDYsV4_X3v1PQ", "business_id": "4ihK-CfFXNVIxN_twd63ZQ", "review": [["My husband and I visited Raw Bar to celebrate a birthday and really enjoyed this new addition to Mass Ave. The restaurant was pretty empty on a Sunday evening, so we got to choose where to sit. We chose a cozy booth by the window but you can also sit at the bar or a high-top table. The cocktail menu features many local spirits and ingredients. I opted for the Indiana 75, which was terrific. To start, we ordered some raw oysters, crab claws, and the smoked fish plate. The smoked fish plate came out first and we LOVED it. The fish pieces were a little small, but it all tasted very fresh. The oysters were meaty and good, but the crab claws were a bit small. The dipping sauces that came with the oysters and claws were great, so we saved some to use with our entrees. My husband got the steamed clams, which were served over pasta with a white wine and garlic sauce. The bite I had was really good. I ordered the lobster roll, which is the same as they serve next door at Slapfish. It was excellent! The fries served with it were also good. We will definitely be back to try more of the menu."]], "date": "2021-11-22", "time": "19:32:24", "categories": "Seafood, Restaurants, Breakfast & Brunch", "city": "Indianapolis", "state": "IN", "stars": 4.5, "business_review_count": 26, "predit_yelp_score": 2.275, "actual_yelp_score": 5.0}, {"review_id": "yH-BbIQC3DOER_0-v5P-0A", "user_id": "IjmeX7t2h5gFAvyesW-0jg", "business_id": "O2F5W-F-APGuZ4mX1vKVhQ", "review": [["Nope. This place sits where the old ihop was on city line many moons ago. The portions are small. Catfish (2) is literally 2x2\" piece and squishy. I had pick up so maybe crispier when fresh but size was small. The shrimp, eh en. More salt seasoned than anything else. Not flavorful at all. Hush puppies were just OK. The crab cake was solid but nothing I'm running back for at that price... you can get better somewhere else... even Whole Foods is cheaper with better filling. Eh en. Nope."]], "date": "2021-11-29", "time": "16:12:47", "categories": "Seafood, Restaurants", "city": "Bala Cynwyd", "state": "PA", "stars": 3.5, "business_review_count": 43, "predit_yelp_score": 1.75, "actual_yelp_score": 2.0}, {"review_id": "98yo3WsMMvyrytdhDPusmA", "user_id": "DW9BbFPGhVTcoFPhUrrr9Q", "business_id": "WWO34S7RwBWlsjJEYuTAaw", "review": [["The Manager (bald guy) seems like he don't care about the customers or the service he provides."]], "date": "2021-12-05", "time": "14:00:42", "categories": "Bakeries, Food, Cupcakes, Restaurants, Indian", "city": "Bensalem", "state": "PA", "stars": 3.0, "business_review_count": 110, "predit_yelp_score": 0.47500000000000003, "actual_yelp_score": 1.0}, {"review_id": "wO_AsyXDSPynShZVHscSyg", "user_id": "g-ZEXIkWmeSd9eitqQ_XcQ", "business_id": "_asl6r3sQF9XSo0CZNdg3g", "review": [["We needed a couple of overgrown trees trimmed, one of which was growing into a neighbor's driveway.  I contacted American Arborists and they were extremely responsive. We got a reasonable quote and very quickly.  At first they thought that they could not fit us in the schedule for several weeks but they called back about a week later since they had a cancellation.  They showed up that afternoon and handled the job quickly.  The trees look great! I will definitely hire them next time I need any tree work!"]], "date": "2021-12-04", "time": "20:27:15", "categories": "Home Services, Tree Services, Landscaping, Pest Control, Local Services, Gardeners", "city": "Reno", "state": "NV", "stars": 5.0, "business_review_count": 206, "predit_yelp_score": 1.825, "actual_yelp_score": 5.0}, {"review_id": "0tpmrFZLdmLdLzbkB8vqXw", "user_id": "R1uEyMIZ2fc0eIyhkE8qWg", "business_id": "NwVlD7TgZUdkg_fZ7SZ3Dg", "review": [["Thank you Rachel for going above and beyond! What a cool hotel and a short stroll to Reno/Lake Tahoe airport. You guys are awesome!"]], "date": "2021-12-02", "time": "04:57:20", "categories": "Venues & Event Spaces, Event Planning & Services, Hotels & Travel, Hotels", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 36, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "EC_SDZH5qj6bsQEFHdUsAg", "user_id": "d7o_77s0W2eYqp2BCeHOlw", "business_id": "56Jvuoxhig_Qh0jFnLbGMw", "review": [["If I could give 0 stars I would. They aren't consistent or good at all. I went to get gel and a pedicure they opened the package which had the tools used to do my service and the nail clipper still had dead skin in it meaning they put it in this package without properly cleaning it like it was sterilized. The guy clearly didn't know how to paint nails my 3 year old niece could have done better then when I asked them to remove the gel because it looked a mess I had so much product left on my cuticle they couldn't get off it took a week before it was completely off. Will never go back there again."]], "date": "2021-12-09", "time": "20:32:12", "categories": "Beauty & Spas, Nail Salons", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 13, "predit_yelp_score": 0.325, "actual_yelp_score": 1.0}, {"review_id": "hZqTxucbEty1FTE_f4m3PA", "user_id": "Zcy_W8J2ycHONAeYcN9xzw", "business_id": "RuPk-ScXo4ycpdnAkpfoNg", "review": [["Pretty good sushi (and for a pretty good price)! Their sushi and sashimi seemed fresh and they had some interesting rolls that were absolutely delicious. Their appetizers were kind of meh... but definitely go for the sushi."]], "date": "2021-12-04", "time": "00:52:51", "categories": "Restaurants, Sushi Bars, Noodles, Soup, Japanese, Salad, Teppanyaki", "city": "Cherry Hill", "state": "NJ", "stars": 4.0, "business_review_count": 380, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "aS0LZnPMbTO7uktmSk4XnA", "user_id": "Np9OgUsLrid5SDHsOIVJJg", "business_id": "i0AOcJ0rhmo-r0TB5RwZSg", "review": [["Communication with Naomi was amazing through email and phone. The cleaner couldn't make the scheduled day and we promptly rescheduled to the second day. The cleaning was great, done with care and attention to details. There was a mixed-up about an add-on cleaning item, but it was OK. My only complaint is that the price is too high, $260 for a 2.5 hour labor, which is much, much more than what you'll get from other top rated cleaners serving Philly. Except that, it was a great experience."]], "date": "2021-11-16", "time": "17:54:08", "categories": "Home Services, Office Cleaning, Home Cleaning, Professional Services", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 24, "predit_yelp_score": 1.55, "actual_yelp_score": 4.0}, {"review_id": "Pqk_fC2cslqMZlt1uuR0uQ", "user_id": "xR3kmV5GfAX4fYIaU8o_EQ", "business_id": "7ART39FMfP3tLj_Nb0N5iw", "review": [["Friendly service, good pricing, was able to fix the hole in my pants pocket perfectly! Great spot for a quick clothing fix."]], "date": "2021-11-19", "time": "21:49:13", "categories": "Sewing & Alterations, Local Services", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 14, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "7DNJhPEMRxxLMYZuL7resA", "user_id": "KFDA4An9irFRy3J5PUm1LQ", "business_id": "oibnXxBAR9HdvEOH-QK9aA", "review": [["It's been another 2 weeks, and no one has called from the restaurant about our eating experience disappointment. I've been removing a star for every week they don't call back to rectify my customer complaint. Please see my previous review write-up for more details on this story."]], "date": "2021-11-29", "time": "08:37:33", "categories": "Pasta Shops, Gelato, Italian, Food, Restaurants, Salad, Pizza, Diners, Specialty Food", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 381, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "37mphduzoy-WhoERj_ZQ8A", "user_id": "k0TuWwoSqJWOcBOchcoX0A", "business_id": "X0tlzqEITaegYt10WJkSFA", "review": [["Friendly service and good Denny's diner food! Glad that they are closer than the river location. Nice and clean inside!"]], "date": "2021-11-20", "time": "18:00:58", "categories": "American (New), Restaurants, American (Traditional), Breakfast & Brunch, Diners", "city": "Oro Valley", "state": "AZ", "stars": 3.0, "business_review_count": 12, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "kl0UlJ7L1M0cgfYb75va9g", "user_id": "u1xXPookewmvOGrqwQSivg", "business_id": "ETZK5PuCsVfQ7ElXckDTPw", "review": [["Ordered the kimchi fried rice and pork bao buns, my wife and I were instantly hooked. I can never have fried rice from anywhere else, it was some of the best food my wife and I have tasted in forever."]], "date": "2021-12-05", "time": "23:00:09", "categories": "Food, Restaurants, Bubble Tea, Asian Fusion, Sushi Bars, Chinese", "city": "Abington", "state": "PA", "stars": 3.5, "business_review_count": 186, "predit_yelp_score": 2.6750000000000003, "actual_yelp_score": 5.0}, {"review_id": "LKatXVOYdcrE41kK0VWhEg", "user_id": "6twv8cvYiWByBLMP1C0MsQ", "business_id": "EpREWeEpmR8f1qLHzzF0AA", "review": [["Came here in a week night with a group on my trip to STL. We came here before a Blues game and had a great time! Honestly i'm not a big beer person so absolutely loved their apple pie cider, I got it twice. We also had dinner and I ordered the turkey burger - it was sooo delicious. I was extremely surprised how good the dinner and apps we had were. Will definitely come back on my next trip!"]], "date": "2021-12-03", "time": "03:17:03", "categories": "Local Flavor, Food, Brewpubs, Breweries, Restaurants, Pizza, American (Traditional), American (New)", "city": "Saint Louis", "state": "MO", "stars": 4.0, "business_review_count": 615, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "qk0MOa74aYtmjPJDEezkrQ", "user_id": "jcnre-Q9DmcA9FjXH8mihA", "business_id": "QCsVilspu6TxuwZMUTabFQ", "review": [["Great selection of IPAs and wheats. I got the revision IPA which is now one of my favorite beers. They have cool staff and patrons who bring dogs in and they have air hockey and pool as well."]], "date": "2021-11-19", "time": "20:45:12", "categories": "Breweries, Food", "city": "Sparks", "state": "NV", "stars": 4.5, "business_review_count": 176, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "ayGfcsIF5gKvOIAaLpDsTg", "user_id": "lOxcJ545Tuc68tAXnzO9CQ", "business_id": "BoIt6TtgioNRp8zCRXMWzg", "review": [["Four of us came for dinner, not sure what to expect. Ambiance is great as there is velvet furniture and lush decor. Very cute! Service was phenomenal as our server was very attentive.\n\nFood was beyond excellent as everything we tried tasted masterfully created. I had fish and the balance of flavors was exceptional. I also thoroughly enjoyed the Moscow mule here, probably the best I've had. To finish everything off we tried the Gluten free carrot cake. Again, this item was absolutely delicious like everything here.   My mouth is watering just thinking about this experience!"]], "date": "2021-11-24", "time": "03:32:24", "categories": "Bars, Whiskey Bars, Nightlife, American (Traditional), Mexican, Breakfast & Brunch, Tacos, Restaurants, Beer Bar, American (New), Cocktail Bars", "city": "Boise", "state": "ID", "stars": 4.0, "business_review_count": 196, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "0nrwUYDKmo7_P0Ez78AqHA", "user_id": "lpLAoU0L9MaNL572_SL03Q", "business_id": "DcBLYSvOuWcNReolRVr12A", "review": [["Tourist seeking authentic New Orleans cuisine - recommended by a paddleboat employee when asked where was a good restaurant that we could walk to. Absolutely delicious dinner."]], "date": "2021-11-16", "time": "18:43:13", "categories": "Restaurants, Seafood", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 3160, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}]