[{"review_id": "AzN2dFJr7Yoi4xc9-6h59Q", "user_id": "claCGjvosx7agW1-_2EYaw", "business_id": "vow0vPUcaLSM_qFgbh1HBQ", "review": [["Had breakfast here today and everything was absolutely outstanding! The owner and his son's both were working very hard within the restaurant making sure all the customers are happy! Some of the best French toast with homemade whipped cream I've ever had!  Will be back tomorrow!"]], "date": "2021-05-01", "time": "17:05:53", "categories": "Salad, Sandwiches, Breakfast & Brunch, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 38, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}, {"review_id": "d6oWiVvEaXZz3Q5UTX3CbQ", "user_id": "Jpe2m5I9QH8aSBr1vf-Wdg", "business_id": "7M8uWd8mH1k10GWDiOEB-A", "review": [["Baam burger is the absolute bomb, the burgers are so good, and the bun is very unique and awesome, lastly, the soft serve ice cream is prime and the prices on everything are very fair"]], "date": "2018-09-14", "time": "21:04:37", "categories": "Ice Cream & Frozen Yogurt, American (Traditional), Food, Burgers, Juice Bars & Smoothies, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 61, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "ayQPhrguMOP4NSHuJuwoNQ", "user_id": "yIrCbLr9xfqsV_MOKqJptQ", "business_id": "w__UZfNB79VSXmFUWhAVyA", "review": [["Romantic ambiance and quality food, yet hefty menu price.\n\nNama is quite the wonder as I frequent here with friends on special occasions, and it has never disappointed. From rolls to kimchi rice, miso soup to sea urchin, every menu item oozes freshness - quite a rare attribute when it comes to seafood here in Tennessee. If you're lucky, specials such as Japanese sea urchin are served while supply lasts for certain holidays. Make sure not to miss those!\n\nService has always been pleasant and fast. Waiters and waitresses are knowledgeable about the menu, quick and smart to tend to any need. Reservation is needed for Friday and Saturday nights as the place is quite packed, but don't worry no matter the crowdedness the quality of food and service is ensured in my experience.\n\nIt is so close to earning a 5 star (in fact, I would give it 4.5 if possible), but the price is just too high. It is conveniently on the Vanderbilt student card, or else I would not revisit the place just because that number on the check at the end of meal always seems a bit ridiculous. Having grown up in west coast where great sushi is readily available at affordable price, I do not discredit the quality of Nama but I do find the price tags beyond my comfort.\n\nOverall, I would recommend for special occasions and dinner dates."]], "date": "2017-03-15", "time": "03:42:24", "categories": "Japanese, Asian Fusion, Desserts, Sushi Bars, Food, Restaurants, Sandwiches, Burgers", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 308, "predit_yelp_score": 2.1, "actual_yelp_score": 4.0}, {"review_id": "elEb4t44jrsaYfDUHGaahw", "user_id": "D_lHciGeTeGbxbXUq7A6GA", "business_id": "tewtTBXF-_vNp9Fed97B8w", "review": [["I cannot say enough about this adventure and I can credit that to the Captain, Chuck Woods.  While waiting to board Captain Woods came down and announced that he had 4 seats available at the Captains table if anyone would like to upgrade, my had went up immediately as I always like to go big or go home (lol). As soon as we confirmed our upgrade he had us walk to the boat with him and took us to the bridge and proceeded to be very informative, gracious and humorous. I just can't say enough of how awesome Captain Woods was. What a great add on to our trip. We then went to our table where we were afforded a complimentary Cocktail, leaded or unleaded at your preference.  We had a decent meal, Thanksgiving theme and since we were at the Captains table we got a special dessert different from the other guests. We also were given a golden ticket by Captain Woods to obtain a special t-shirt from the gift shop at no cost. The Christmas show was terrific and not just a short blurt, it was a very good quality show. We loved the performance. This is a don't miss trip, well worth it. Thank you again Captain Woods and the entire crew, you made our canceled trip out of state wonderful."]], "date": "2021-11-22", "time": "17:45:49", "categories": "American (Traditional), Arts & Entertainment, Mass Media, Event Planning & Services, Radio Stations, Party & Event Planning, Venues & Event Spaces, Restaurants, Nightlife, Local Flavor, Music Venues", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 165, "predit_yelp_score": 2.625, "actual_yelp_score": 5.0}, {"review_id": "JDFePiphPzNJhsemh3EHqQ", "user_id": "NlNjFHK-1exUJEqCTm52Fw", "business_id": "fJPpi1toRgY6yocnc5ujWg", "review": [["Strolled in and grabbed a Topo Chico mineral water. No problems getting a seat. Water was nice and cold with top notch minerals!? Is this stuff imported or something!? You better believe it! What more could you ask for!?"]], "date": "2017-05-17", "time": "18:23:21", "categories": "Cafes, American (New), Restaurants, Bars, Nightlife, Vegan", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 108, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "2gSUx9jsaCT7RNQPD7at9w", "user_id": "DUA9CD6LnocvdmAE5Qub4g", "business_id": "Hb09xY41jKoQoCvt4JK0Xg", "review": [["I ate Dino's for the first time and I came here to read reviews to see if other's experiences were similar to mine. So here is the breakdown which is similar to several reviews.\n\n1. Longest ordering process ever. \n2. Food doesn't come out in the sequence it was ordered.\n3. Flighty workers. Stoned? \n4. A little snotty for a burger shack. \n5. Good burger\n6. Good fries even when they come out cold. \n7. No air conditioning\n8. Typical east Nashville vibe. \n\nI did enjoy the burger, but when they say \"East Nasty\" this place coins it. But hey, If you like the \"uber liberal part of town\" vibes and don't mind eating your burger on top of a squirting dick and balls carved in the table then go get yourself a pretty tasty burger worthy of me still giving this 3 stars."]], "date": "2017-06-10", "time": "23:59:55", "categories": "Bars, American (Traditional), Nightlife, Breakfast & Brunch, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 203, "predit_yelp_score": 2.225, "actual_yelp_score": 3.0}, {"review_id": "4XMXNJJtty7ugrm79sPkmA", "user_id": "7kX5RMX6CicnXy7F7lMb5A", "business_id": "7pwFfnB6FH4lflXWrQ2Tqw", "review": [["I was stunned at what this place was.  It was dirty, and the food was awful.  I couldn't believe several locals in Nashville recommended.  Don't go."]], "date": "2012-03-10", "time": "23:59:04", "categories": "Barbeque, Salad, Southern, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 1564, "predit_yelp_score": 1.45, "actual_yelp_score": 1.0}, {"review_id": "TGpeOiZOnvp06o847rznrw", "user_id": "-uWiPg0mOT8yW5iHIlNmfA", "business_id": "GTlGJH0lceTK0ICS5SLTlg", "review": [["Great Detroit/Deep Dish style pizza with lots of fun flavors to choose from. Each bite is so flavorful, makes you crave for more. I had a piece of the Colony pie  (pepperoni) and Vodka pie (plain-vodka sauce) and it was amazing. Recommendation is to order a few flavors and share with friends. They're nicely cut into square-pieces. \n\nOne small thing is that for some slices, although Detroit-style does have thicker crust, the slice was a little too thick compared to the other slices with a lot of breading and not so much meat and sauce. It was only a few slices like that, but other than that, it was amazing. \n\nThey just recently opened at Vista Germantown apartments and I got to try their pizza at the apartment's event. I'm so glad it's located by me so I will definitely be back. I've heard a lot of good things about their burgers and waffle fries, so I will have to go back and try these."]], "date": "2021-05-21", "time": "12:52:31", "categories": "Burgers, Sandwiches, American (Traditional), Salad, Bars, Pizza, Nightlife, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 40, "predit_yelp_score": 2.4, "actual_yelp_score": 5.0}, {"review_id": "DC7V3oJKCzsu8wvMEKTm_Q", "user_id": "0wxAtYUIyLj7QKaoz8JvuQ", "business_id": "XrikSy0DQ_fhVCaRRBJI-g", "review": [["This was hands down the best steak I have ever had. I ordered the Wagyu Filet Mignon and it was beyond my highest expectations. I do not live in Nashville, but I will travel back from Texas just to eat at this place again."]], "date": "2015-07-25", "time": "12:43:53", "categories": "Restaurants, Steakhouses", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 987, "predit_yelp_score": 2.675, "actual_yelp_score": 5.0}, {"review_id": "HsfP3rgfU1K4M9g1zoh0-g", "user_id": "H3VahzUrVmujilmpk2Muuw", "business_id": "XKj07H-SUl1_fuvAv3ncHQ", "review": [["Best chicken shawarma sandwhich ever! Super fresh made on the spot. If you love food trucks this one is a must!"]], "date": "2017-04-19", "time": "17:53:40", "categories": "Pizza, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 13, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "g83a9gWAJvEWrJLhY4naPQ", "user_id": "WddIje4rTimj4pVK4NUS6Q", "business_id": "y7bKjKsu8vCJiWYiE6DxOQ", "review": [["My first visit to Champion Car Wash - I didn't know the drill, but the 2 employees couldn't have been more helpful and pleasant.  My 3 year old grandson loved the flashy lights going through.  The $10 wash I chose included awesome vacuums, too.  We had fun and my car looked shiny new!"]], "date": "2017-01-28", "time": "17:45:37", "categories": "Automotive, Car Wash", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 35, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "G1R-wZSTfuKmjECPweBlog", "user_id": "SrwHXDUhVDAOeLUG1Tux5A", "business_id": "fJQHj9Sq1R0a9FO08q8HWw", "review": [["worst fucking service ever. i walked in and was completely ignored. 3 ppl walked in after me and were greeted immediately. i would've never gotten my drink if i hadn't spoken up. i ordered my regular drink and it tasted like shit."]], "date": "2020-05-27", "time": "18:24:40", "categories": "Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 30, "predit_yelp_score": 0.15, "actual_yelp_score": 1.0}, {"review_id": "pARJfhhtO4jt14L9IqLUTQ", "user_id": "vF_63_AW2iAleOeVkGjjwQ", "business_id": "5quqExjLtFNhykec_na8pg", "review": [["I was really looking forward to the meat samosas (my favorite Indian dish) but was a bit disappointed in the pastry (a little doughy) and the filling (cold in the center).  The only thing that saved them was the best tamarind chutney that I've ever had.  It was fantastic.\n\nThe mixed grill was pretty good with a hefty portion and flavorful seasoning.  The seekh kabob was a little on the dry side but was also flavorful.\n\nThe garlic naan was pretty standard, nothing exciting about it and nothing awful about it.\n\nThe waiter was a attentive without being annoying and the cost of our meal was on par with every other Indian joint in the area.  The dining room was a little dingy and worn out but comfortable enough."]], "date": "2015-05-01", "time": "21:38:05", "categories": "Food, Indian, Pakistani, Chicken Shop, Seafood, Restaurants, Food Trucks", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 476, "predit_yelp_score": 1.3, "actual_yelp_score": 3.0}, {"review_id": "HM6cC_JLPeORRk83oJ2jBQ", "user_id": "rj41AIRX2g6z-9Rhgcp-rQ", "business_id": "GUxp9tHxMVgUurLZJ5_tkg", "review": [["This was an awful we hotel. The room cost $120 for one night! The AC didn't work, dirty towel in bath room. Broken dresser drawer. Had to call the front desk for someone running down the walk way screaming HELP me. People setting cars off. This is the worst place I have been and talk about way over charge for what you get. I rather sleep in my car then stay here again."]], "date": "2015-07-26", "time": "03:38:28", "categories": "Hotels, Event Planning & Services, Hotels & Travel", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 79, "predit_yelp_score": 0.15000000000000002, "actual_yelp_score": 1.0}, {"review_id": "k-9336KpTZKu_Ik_egANBg", "user_id": "v9ZgIl22Q813cCfv1e9RLw", "business_id": "-KNgMklrxgRX2-T6xXeTZA", "review": [["Well, when you are on the road and in airport hotels I'll give Sal's this...they deliver and is a better choice than the typical substandard chains.  It's not great, it's not horrible.  \n\nThe crust falls short, I wouldn't call this a thin crust, more like an average crust.  The problem though is that it is a tough crust, not that crispy yet chewy crust that you look for.  While you can fold this slice, the toughness doesn't allow the perfect fold.  It's more like a bend than a fold.  The flavor of the crust was very bland as well, and no char on the upskirt.  \n\nSauce was pretty good, had some spice to it.  I would like to see a bit more sauce on the pie.  The cheese was standard, not that wow cheese that pulls away from your mouth on bite.  Overall, not a bad choice if you are stuck at a hotel and are too lazy to go out.  I've had a lot worse at airport hotels (yeah, I'm talking about you Kansas City, St. Louis, Oklahoma City...and on and on and on...  \n\nI give it 2.5 stars rounded to 3 for delivery for lazy people...from the NY Pizza Guy."]], "date": "2011-02-28", "time": "02:27:15", "categories": "Italian, Salad, Restaurants, Pizza, Delis", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 150, "predit_yelp_score": 0.825, "actual_yelp_score": 3.0}, {"review_id": "KmqyR7NY_OCbKFMxUTjYOA", "user_id": "EpZRdJxFOS5AuZG7S_Gy9w", "business_id": "l4dTLQ5efOvWzAANTiw_fg", "review": [["I bought Cerrito's Groupon for balayage and a haircut before I read any reviews, and to be honest, after reading them I was FREAKING OUT. But, I decided to give it a shot and figured I could always cut or dye it myself if things didn't work out. I definitely understand where some of the other comments on here come from, so I'd like to address those for anyone who is concerned like I was! Natalie D. posted a picture of her \"London haircut\" - my hair also initially looked like this, just to get the length right, but after coloring and washing it, he trimmed it up and everything is perfectly even. Natalie C mentioned that Cerrito only talks about himself, and I can see that; he initially told me all about his music, time at RISD, etc. I really think he just passionate about art/hair/music, and it didn't rub me the wrong way, but I guess he's an acquired taste. Overall I was really happy with my hair. He cut about 9 inches off, and I love it. The balayage really impressed me, however. I have used a lot of box color, to include dyeing my hair dark brown/black about 8 months ago. When he told me he doesn't use bleach (he uses Joico free play clay), I probably rolled my eyes a bit, and prepared myself for crappy results. I was shocked to see how light my hair is---it's actually blonde. He doesn't use toner, so it's on the yellowy side, but that is something I can do myself. I will definitely go back, and would recommend him to other people but you should be prepared to talk liberal politics, world events, and listen to his life story. He's eccentric, but he's a genuinely good guy who is passionate about what he does."]], "date": "2019-05-09", "time": "19:49:04", "categories": "Hair Salons, Beauty & Spas", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 13, "predit_yelp_score": 1.9749999999999999, "actual_yelp_score": 4.0}, {"review_id": "ph99os8yVKX3gmtZ4wjxLg", "user_id": "xgmF-4CBzOb4EKqQMy5s_w", "business_id": "0v17Ed8jk2OgUEOHRdcTtQ", "review": [["My husband and I ate here Friday night and loved it!  We had lobster bisque and the chowder as our soups and they were outstanding.  I had the market fresh fish.  Our desserts were key lime pie and angel fish cake.  We ate on the patio outside.  This restaurant has a great atmosphere, great menu and great service. Loved the wine list.  This is one of my new Nashville favorites!"]], "date": "2017-01-22", "time": "23:48:52", "categories": "Food, Nightlife, American (New), Beer, Wine & Spirits, Bars, Seafood, Breakfast & Brunch, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 405, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "ytNsDOniF0SZ4xdmGc_xZg", "user_id": "ua1LH52o23zsT5yL2PQT3Q", "business_id": "3XoqdiwUGX81F3rsRNkNbA", "review": [["We've been to several Char locations are they never seem to disappoint. This one in Green Hills was amazing from the food to the ambience. The staff always seems top notch as well...a testament to their brand. We'll be back soon to terminate some more vittles."]], "date": "2021-08-25", "time": "04:52:37", "categories": "Restaurants, Seafood, Southern, Steakhouses", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 148, "predit_yelp_score": 1.7000000000000002, "actual_yelp_score": 5.0}, {"review_id": "I8fWstkKgccbM9MEvw-6QQ", "user_id": "y1BysCatWDaasHXXHljwqw", "business_id": "yFrOuce72KhvW0LpU5FY6A", "review": [["Let me start by saying that I'm really not cool enough to come here. The vibe is very hipster and very New Nashville. But once I walked in the door, the staff was so friendly and nice that even I started to believe I was hipster worthy. Maybe I am? I'm reevaluating. In fact,  I've really been thrown into an identity crisis ever since this experience. But everyone that I made eye contact with gave me a big warm smile so what can I say. I'd like to come back. \n\nI sat at the bar and enjoyed an eagle eye view of the door and the blend of patrons walking in to dine. It appears that this beloved hideaway is truly a Nashville favorite and is for everybody. Note: the bar is not elevated above the ground or anything...I'm just really tall. \n\nThe brunch menu was amazing. I even tried my friends food when they weren't looking so I really got a flavor landscape of what the kitchen was capable of. I enjoyed the avocado toast that had blueberries, red onions, and feta on top. Unusual, but surprisingly delightful. My neighbor ordered the sour dough French toast that was so thick and delicious  it was wedding cake material. \n\nThe breakfast tacos were slightly out of reach so they lived to see another day as far as my plate was concerned, but they looked mouth watering. Actually I think that my friend was on to me and decided to eat fairly fast as to not have to sacrifice a bite to my fork that was hovering at her side. \n\nThe coffee was hot and served well and kept coming. We weren't rushed even though we should have been towards the end of the experience due to the amount of people who were walking in. But the bar tender never said a thing. Not even on a passive aggressive level. No dirty glances or strained smiles, just genuine hospitality. I would recommend this place to anyone in town who wants to have a modern Nashville experience."]], "date": "2019-01-14", "time": "18:31:46", "categories": "American (New), American (Traditional), Nightlife, Restaurants, Bars, Sandwiches, Cocktail Bars", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 265, "predit_yelp_score": 2.025, "actual_yelp_score": 5.0}, {"review_id": "9uRr7Mls6jcxMS98fwVK5g", "user_id": "rAEsX3A9jAuHNLhtuGHmww", "business_id": "pbjHwv2yT4pueZOtz7UeRQ", "review": [["This is my number one go-to quick and easy place for pizza carry out on the east side. Prices are reasonable, pizza is always hot and fresh, and they have great service. I know they have a new delivery service that they have been using, but I have not used it. I highly recommend this place. Give them a shot!"]], "date": "2018-03-08", "time": "18:54:26", "categories": "Restaurants, Mediterranean, Italian, Steakhouses, American (New), Middle Eastern, Lebanese", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 15, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "MUsopjuZVN-73D9rV-SXDw", "user_id": "HwUSB0Bd4ycAFhLsaPV2zQ", "business_id": "5iooYc7woWdiRU1uq9jpNg", "review": [["Great hole-in-the-wall restaurant with really friendly staff. I've been going here for a few years now and they never disappoint. Their pho is hard to beat and is authentic. If you're not into pho then you'll be glad to know that they have many scrumptious dishes for you to choose from. I, personally, love their spring rolls. I've tried some other Viet places around Nashville and this is definitely the best."]], "date": "2018-06-14", "time": "20:43:03", "categories": "Vietnamese, Japanese, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 243, "predit_yelp_score": 1.775, "actual_yelp_score": 5.0}, {"review_id": "f-wKjBZ-_HaW6gU8kH7J8A", "user_id": "etkF22XJuv7ebIONyvcgiQ", "business_id": "w520vYWEpEYBf90rSr9NVA", "review": [["I love Thai food and am glad to know that I can find it in Nashville.   Everything is fresh and light."]], "date": "2011-04-24", "time": "23:45:47", "categories": "Thai, Chinese, Seafood, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 604, "predit_yelp_score": 2.8249999999999997, "actual_yelp_score": 4.0}, {"review_id": "tTN2brbYoY2_zJlPI1csmw", "user_id": "ArxPtnG0Gj1tIVrjioHWog", "business_id": "DCyOSmePdGjAuSt7jldXYg", "review": [["I ,like Jack T ,was excited to see Smokies open in the Woodbine area.  I went last week after someone had the gumbo and recommended Smokies.\nI went to pick up white bean soup.  It was really pretty good.\n\nYesterday, I went to pick up something for lunch and decided to try the smoked chicken salad sandwich.  When I order it, they said that they did not have any.  If it was around four in the afternoon, but this was around twelve twenty.  So I ordered the white bean soup again.  I waited over twenty minutes and thought if you have a pot of soup on the stove, it should not take that long. If it was busy that would be understandable, but there was a total of six people in the restaurant. Waited patiently and then I saw one of the chefs use a large spoon and scooped something out of a skillet and place in the styrofoam container.  That was my soup.  I am not a chef, but I know that you use a ladle for soup and soup is not cooked in a skillet.\n\nWhen I got back to work I opened the container to find this clump of white beans...no liquid whatsoever.  I like white beans, but not a clump that looks like wallpaper taste.  The cornbread was reminiscent of Jiffy, but with white corn.\n\nMaybe their best is the pulled pork, but sides are just as important.\nWill I go back?  I think I will have to think about it."]], "date": "2014-12-19", "time": "14:20:58", "categories": "Barbeque, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 21, "predit_yelp_score": 2.7750000000000004, "actual_yelp_score": 2.0}, {"review_id": "MgQbQsh_b-WtbnlzKyXShg", "user_id": "16xPtHL4ZIFTFKcXQ3zrRw", "business_id": "JZIZwIM5yrHMFByQPwU2IA", "review": [["Wanted to like this place so much since I live near it, however it was a huge disappointment. I wanted to get a variety of things to try since this was my first time. I ordered Barbecoa, Asada, Chicken, and Pastor tacos. I also ordered the chicken fajitas, chicken quesadilla, and a large quac. To start it took exactly an hour for our order to be ready. There were probably on ten or so other folks dining in, so they were not that busy. The tacos which I was most excited about were just plain bad. The barbecoa taste like they cooked it next to shrimp or fish and it was extremely dry! The chicken... well it was just inedible. My wife said she felt like she was eating chicken from a can, my chicken tasted freezer burned. The pork had no taste like to expect from typical pork pastor. The quesadilla was almost all cheese, and again chicken in that was bad. I also had chicken fajitas, but I've already said enough about the chicken. Last but not least, the Quac!!! I had read several reviews on \"how great\" the quac is. NOT THE CASE. Seems like they put the avocados in the blender with water, but that wasn't what did me in. It was so SALTY that I couldn't go in for a second bite!"]], "date": "2017-07-23", "time": "17:43:56", "categories": "Restaurants, Mexican", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 72, "predit_yelp_score": 0.925, "actual_yelp_score": 1.0}, {"review_id": "sp89fK74h57FXNmQorqMbA", "user_id": "S5wT070qFHO78FFrxmoBHQ", "business_id": "V1ZN0CuQ0xfGzmHZLJ_v8w", "review": [["This place is great. Great quality, great flavor, and fast service. I'm glad to have a healthy option in the area that doesn't charge absurd prices"]], "date": "2021-04-30", "time": "18:13:39", "categories": "Food, Health Markets, Vegan, Cafes, Breakfast & Brunch, Live/Raw Food, Sandwiches, Asian Fusion, Vegetarian, Specialty Food, Restaurants, Gluten-Free", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 49, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "BWEaNDK0edzx2IBGNc-3yQ", "user_id": "8AAGXhKKR9yAN9C4p4dZxw", "business_id": "3UPkzmnVGoDCCvE-29EpwQ", "review": [["Fabulous clean place! Tucked out of the way on Charlotte and very easy to find. Private parking and friendly staff! The beef brisket was exceptional!  Nice meaty bits on the ends. My husband tried the pulled pork and ribs and they were spot on! Will definitely be back. Kudos to the owners!"]], "date": "2021-03-08", "time": "23:49:38", "categories": "Caterers, Event Planning & Services, Burgers, Sandwiches, Barbeque, American (New), American (Traditional), Restaurants", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 149, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "lMjbdCrMGffp0r2CPf45xA", "user_id": "fTq80vHFcP8L9aA20bRm7Q", "business_id": "aIflpZXlmofFGelTlqgGEQ", "review": [["Amazing customer service and food! New goto spot, keep it up!\n\n\nGreat food hit them up"]], "date": "2018-08-04", "time": "18:10:24", "categories": "Chinese, Indian, Restaurants, Asian Fusion, Cocktail Bars, Nightlife, Bars", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 151, "predit_yelp_score": 2.6750000000000003, "actual_yelp_score": 5.0}, {"review_id": "815DYdigzH9KYI82CYqIdw", "user_id": "i7IkbJi3vWzNRPfr5oyZdA", "business_id": "OWOOc0YjU_kioLeEgo5VCA", "review": [["Great day for a meal.  I had the Catfish plate.  Four pieces of catfish with a couple hush puppies.  Then for my two sides I had their amazing sweet cream of corn and hash row. Casserole.  You also cannot forget their amazing biscuits as well.  I had a few with a mixer of butter and sorghum, yummy!!!   Washed it down with their freshly brewed sweet ice tea.  I also had a cup of their country white gravy for my catfish!!!!\n\nThis was some good country eaten today!!!!"]], "date": "2019-06-13", "time": "01:56:33", "categories": "Food, American (Traditional), Arts & Entertainment, Southern, Nightlife, Restaurants, Breakfast & Brunch, Music Venues", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 2452, "predit_yelp_score": 2.5749999999999997, "actual_yelp_score": 4.0}, {"review_id": "VlgmyrQ4lyIxtFFLSSA91Q", "user_id": "tnMFmJ3GCHZpCx3ti4DEDg", "business_id": "arQfMJal1tl67Z96ROgPFg", "review": [["Dan makes the best lemon drop martini!!! Come in for happy hour deals! Loaded potato skins were yummy."]], "date": "2018-11-10", "time": "00:39:00", "categories": "Steakhouses, American (Traditional), Restaurants, Bars, Seafood, Nightlife", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 347, "predit_yelp_score": 2.8000000000000003, "actual_yelp_score": 4.0}, {"review_id": "_2PGtSb-0_5N8oilyFOXVQ", "user_id": "P-MK24jdUBmnYrcVnHTzFg", "business_id": "fyoQiSDDfkESB1w-ahsvCw", "review": [["My husband and I enjoyed our two-night stay here, though there are a few things that could have been better.\nPros:\n*Price -- Less than $220 all told for two weekend nights, which was pretty great for this area.\n*Clean -- Everything was clean and seemed fresh.\n*Friendly Staff -- Every interaction with staff was neutral to great!  Very courteous and personable.\n*Hot Breakfast -- Good variety, including several protein options (which I loved) and pancakes (which my husband loved).\n*Large Shower -- Would easily fit two average-sized adults or could easily fit a shower chair for those who need to sit. (Only one \"handicap\" bar on the wall, though.)\n*Location -- It was very convenient to major roads without feeling overly exposed.  There were also a few places to eat within walking distance, which was nice.  It felt safe.\n*Linens -- Mostly seemed thick enough and comfy.\n\nCons:\n*Hot Breakfast Shortfalls -- It would have been nice if the sausage were what I call real sausage.  The patties they had were overly processed so had a funny texture.  The \"eggs\" were those round egg patties -- not bad, but not what I had hoped for from reading other reviews.  Also, at the beginning of breakfast, the sausage gravy was lukewarm at best.  (They did have a microwave close by, so it wasn't a huge deal.)  My husband said the biscuits were very dry.\n*Linens -- They were clean and comfy but had very little weight to them.  I like a bit of weight on me when I sleep, so I was disappointed that there were no extra blankets in the rooms either so that I could just add another layer.\n*Bed not level -- We were on a king-sized bed.  My side was slanted about 4.5 degrees with my head lower than my feet.  Since the bed was king-sized, there were actually two different pieces to the base.  My husband's side was slanted the opposite direction about 5.5 degrees.  I woke the first morning with my shoulders and neck hurting due to the slight but definite shift of my weight onto them.  My husband and I switched sides the second night and were both fine.  So this may or may not be enough to bother some people.  I didn't recognize the problem myself until more than half-way through the first night. (At first, I thought my discomfort may have had to do with my pillow, which it turned out was not the case.)  \n\nAll in all, we had a pleasant stay (once the bed leveling was sorted); and I would definitely stay here again and would recommend it to others.  A great deal for the price!"]], "date": "2016-04-12", "time": "03:14:07", "categories": "Hotels, Hotels & Travel, Event Planning & Services", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 36, "predit_yelp_score": 1.9000000000000001, "actual_yelp_score": 4.0}, {"review_id": "Y0yldOu2GLpQV_Okz8vIfQ", "user_id": "_S9NRW0yb0Su-CMTOfD-Hw", "business_id": "qe5fWtR9u-Pqg1pJBR5G0g", "review": [["My family and I had our family reunion over the Christmas holiday in Nashville and Jack's was suggested for one of our meals.  When I say, EVERYONE was stuffed and satisfied, Jack's truly delivered.  The Catering Team was accommodating, friendly and provided us with everything we asked for.  From the cornbread to the smoked turkey to the famous sauces, everything was delicious! Don't waste your time eating anywhere else- this food is AWESOME!!!"]], "date": "2015-12-28", "time": "20:09:12", "categories": "Southern, Barbeque, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 357, "predit_yelp_score": 2.475, "actual_yelp_score": 4.0}, {"review_id": "ji38daEn9hu_PlX0MmQBVA", "user_id": "eWbnZFi4xZQfP5xGP-Xz4A", "business_id": "wUZXm4KN2wIqlfkvXVZXUw", "review": [["The best avocado toast I've ever had!   So good, we came back, and might try to go back a 3rd time while we are in Nashville.  Goes perfectly with a latte....hits the spot!    Nice contrast with the heavy bbq we are also enjoying in this wonderful town."]], "date": "2021-09-24", "time": "18:58:22", "categories": "Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 998, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "jnPz2tPkPmi7hkn3wQSWnA", "user_id": "KiEzI8Q70lIzCNpr0HRRzA", "business_id": "KquItUiyLRxiasJ3P_xGMQ", "review": [["A colleague offered: If you like beer, you have to go to 12 South Tap.\n\nI walked in not realizing what I was up for.  It was SLAMMED.  Slammy-slam-slammed.  We managed to get seated at the last available table just in front of the door on a cold wintry night.  This meant two things:\n\n1.  Service was fast, friendly, helpful.  We had beers & dinner and were out in 35mins.\n2.  Everyone who walked in after us stood lumbering over our table scanning the room and trying to ward off disappointment for at least 4 minutes before giving up and walking back out.\n\nI enjoyed the beer selection (Colleague wasn't wrong!), and I remember liking my food but the whole experience was overshadowed by the people all up in my space like that.\n\nI'll return to reevaluate."]], "date": "2013-03-23", "time": "15:36:10", "categories": "American (New), Gastropubs, Cocktail Bars, Bars, Desserts, Pubs, Food, Beer, Wine & Spirits, Nightlife, Restaurants, American (Traditional)", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 347, "predit_yelp_score": 1.8250000000000002, "actual_yelp_score": 3.0}, {"review_id": "KQs8b4ll5w0VlxwKAlXBFA", "user_id": "fAjZk_VYwgUxTvCJdQQvqw", "business_id": "PpS_33wwVA959bD6nHPlMA", "review": [["Good to see a fun burger joint added to the neighborhood. We've been to the 12th ave location. Liked the space, the layout.  Burger was good, the Fried Mac And Cheese ball appetizers are great!  Like that they use local suppliers. The ice cream for desert comes from Pied Piper around the corner. A bit pricey for a burger but a fun night out."]], "date": "2016-09-10", "time": "05:29:24", "categories": "Restaurants, Burgers", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 179, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "vuhcCYaeuiGiD0pxs2U2cw", "user_id": "VzZe2ouOrCU8uVlQ5Dc4XQ", "business_id": "OWOOc0YjU_kioLeEgo5VCA", "review": [["Friends and I came here for breakfast on our first morning in Nashville and were not disappointed! \n\nBiscuits and homemade preserves to start off a meal?! Yes, please!\nMoonshine in your Bloody Mary?! Of course!\nOne of the best southern breakfasts ever?! For sure!\n\nI loved the Southern Plate (eggs, bacon, sausage, country fried ham and hasbrown casserole). It was the perfect amount of food and gave me a taste of what Loveless is known for.\n\nOur waitress was great, the host was even better! If you're in Nashville, this is a must visit piece of Americana history."]], "date": "2018-01-02", "time": "21:40:16", "categories": "Food, American (Traditional), Arts & Entertainment, Southern, Nightlife, Restaurants, Breakfast & Brunch, Music Venues", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 2452, "predit_yelp_score": 2.3499999999999996, "actual_yelp_score": 5.0}, {"review_id": "zgrUJZUf1sm1-fcyFLF3kw", "user_id": "ipeEoKAGKF8Uw92rFOfjIg", "business_id": "R41oIvpXmZPpMT6IxIWgzg", "review": [["Beautiful, historic building.  We went to sightsee historic train station turned hotel.   While we were there, a train was going by that was super long and carrying coal, and who knows what!  Fun to watch. \n\nThe lobby is phenomenal.  We stopped in the bar for a few specialty drinks.  It was dark and loungy - just the right feel for this hotel.  \n\nI would like to stay here, but it is a fair walk from downtown, and I worry about the age of the hotel.  Sometimes historic hotels are a little musty. \n\nI would recommend looking at the reviews in detail.  Most of the 5 stars are from visitors commenting on the building and history.  Several (like Jennifer S) have better comments on staying at the hotel (like the train noise etc)."]], "date": "2014-01-12", "time": "20:37:53", "categories": "Hotels & Travel, Event Planning & Services, Hotels", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 243, "predit_yelp_score": 1.8749999999999998, "actual_yelp_score": 5.0}, {"review_id": "mGX61ZaIogw14so6mBXXnA", "user_id": "5ztEu3QLwF2ORGkctB8uDg", "business_id": "s1Ye1o9JL77vs5g3F0CF5A", "review": [["Be aware! The menu includes prices for everything but beer. The only place where you can see the price us the check. Neither waiter nor manager were able to prove the price. It can be any number. The waiter asks you through her teeth what you want. If you'll say beer, she won't ask you what size. She'll bring you the size she wants for the price she decided is right for you."]], "date": "2017-07-13", "time": "20:57:36", "categories": "American (Traditional), Restaurants", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 116, "predit_yelp_score": 2.4, "actual_yelp_score": 1.0}, {"review_id": "98KYQR5lb4MmFVLxolhJjw", "user_id": "Yc4Rrw2gbPoD-MWDG4NAKg", "business_id": "d0xKQW6u1ij9qpg4AJO1Cg", "review": [["I ordered delivery from Madeline's while in Nashville for a conference.  The baked ziti was cold and inedible, the chocolate cake was stale.  The only redeeming quality were the garlic knots, which were overbaked (a bit burned), but quite tasty.\n\nI would not recommend this restaurant."]], "date": "2016-12-02", "time": "04:41:35", "categories": "Sandwiches, Italian, Chicken Wings, Pizza, Salad, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 111, "predit_yelp_score": 0.625, "actual_yelp_score": 1.0}, {"review_id": "fAvlE0MtsUFiCXYXjEE9-g", "user_id": "zAWudjaa8SJoAyNe9f0xrw", "business_id": "1RQwJwViav_pzhT-zaDp6Q", "review": [["Massonan curry was perfect. Service was excellent and everything was sparkling clean\n\nEveryone in my party was happy with their meals"]], "date": "2020-09-05", "time": "22:24:49", "categories": "Restaurants, Sushi Bars, Thai", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 185, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "iAbDjLn7UoRXwlTA8I-z0w", "user_id": "v42EJqlV9-Z8OzUwH4-nGg", "business_id": "OS3PZwj_KyP1iD2Js8Jpig", "review": [["I dont give 5 stars alot, but this place rules. I sit at bar everytime so maybe its better service. (Hint, bartenders are usually better servers). food is great, the street chicken is to die for. Hands down best thing on menu. Service is always great, i dont know where these 2-3 stars are coming from. Great specials weekly. Outside of nolensville road, one of my favorite mexican places in nashville. go, sit at bar."]], "date": "2014-06-10", "time": "03:20:33", "categories": "Mexican, Restaurants, Nightlife, Desserts, Food", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 103, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}, {"review_id": "QZVC0mooHo_5_QxNbw56Kg", "user_id": "Vat_ma6JZ6gA_InERCkXjg", "business_id": "Zx7n8mdt8OzLRXVzolXNhQ", "review": [["Great breakfast spot, but the wait is sooo long!! I've gone three times, left once, but stayed in line the other two times."]], "date": "2020-06-07", "time": "00:36:23", "categories": "American (New), Restaurants, American (Traditional), Food, Breakfast & Brunch, Coffee & Tea, Pizza", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 1725, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "dAI0ex175ZJj7xom3kuJlA", "user_id": "Y7c9hzOaN_NarOd0i95HKg", "business_id": "Sy4VvCqRsPB0IN8u-0wVtQ", "review": [["Great pizza and wonderful service! Definitely a quality place to enjoy a meal! :) we ordered the 7 cheese pizza, and it was packed with flavor. Also picked up the cheesy bread, and that was also delicious. I havent tried any other menu items, but I'm sure they're also high quality, and will be back to give some a try!"]], "date": "2017-04-22", "time": "01:16:58", "categories": "Restaurants, Food, Food Delivery Services, Pizza, Gluten-Free, Italian, Salad", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 200, "predit_yelp_score": 2.725, "actual_yelp_score": 5.0}, {"review_id": "mqhgDJZrv10A5jTp1RudEg", "user_id": "gTz2luV0K6n5eZR-SayyBQ", "business_id": "zEFwEMonivpDgNior4SDAQ", "review": [["It was such a pleasure to work with Nicola. She took our engagement and wedding pictures. If you want more traditional portrait pictures, that's no problem for her at all. On the other hand, to me, it takes true talent to do photo journalism, which is taking more natural photos (in the moment, without the subject realizing or looking at the camera). She has a very unique style with how she uses light in her photos and will take full advantage. After reading her website and learning her passion of telling people's \"stories\". Me and my husband immediately knew we wanted her as our photographer. She met with us to listen how we met, how long we've dated, our style, and the style of our wedding. When it came closer to the wedding she met with us again to do a timeline for the day of the wedding. (We ended up using that timeline for the bridal party, so everyone was on the same page.) She also asked and was very flexible in doing photos that you wanted or any particular photos of people that you wanted. I do not regret our decision with her as our photographer at ALL. Would highly recommend using Nicola. She truly is one of a kind."]], "date": "2016-05-24", "time": "16:54:26", "categories": "Event Photography, Photographers, Event Planning & Services, Session Photography", "city": "Nashville", "state": "TN", "stars": 5.0, "business_review_count": 5, "predit_yelp_score": 2.5249999999999995, "actual_yelp_score": 5.0}, {"review_id": "panhCMqXKj9pQj4nWMs3ng", "user_id": "1g-v464KRbRFhD2vqkqg4g", "business_id": "4psm-jktkSmMmrl7R2vwjA", "review": [["This place is the absolute, total pits, STAY AWAY!!!!  I had to pay $13 for a small pizza. Then had to wait after I called in 20 minutes prior. The people there are really creepy to me. The place is filthy dirty. The receipt was faded and I could not read it. The person who answered the phone did not tell me how much the price would be, nor did he thank me for calling. I could not hear him. I am amazed the corporate office would allow this place to operate like it does. I'd never, under any circumstance, go to another Jet's pizza. Especially this one. I was on my way home from work and wanted to reward myself and this was a horrible experience. Shame on you Jet's pizza managers."]], "date": "2018-02-04", "time": "00:43:10", "categories": "Restaurants, Pizza, Italian, Sandwiches", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 42, "predit_yelp_score": 0.75, "actual_yelp_score": 1.0}, {"review_id": "sTvA7IijP-tR4yOgFTcbsA", "user_id": "XEY-MpHB2QCOdQCUgbfPYw", "business_id": "pur_k5M4UzmeAzmCPW_hhw", "review": [["I love Champagne Nails and I love Annie, the owner. She is amazing. She's super helpful and passionate about the shop, plus she's adorable!! If you're in Nashville and are in need of a mani/pedi you can't miss out on Champagne Nails!"]], "date": "2017-03-25", "time": "19:02:36", "categories": "Nail Technicians, Beauty & Spas, Nail Salons, Hair Removal, Skin Care, Waxing", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 172, "predit_yelp_score": 2.7, "actual_yelp_score": 5.0}, {"review_id": "Mt1rVm5PdI2HLj3b1lBBDg", "user_id": "wNxyZ1dOsP0CpYlK_iBD6w", "business_id": "R4RwLCBjC19UqsN4JbpWng", "review": [["Fox Moving deserves no stars. Find another mover!! Quick! Don't have the right equipment or moving crews to take care of your belongings. If you really want to see your belongings in one piece or at all don't hire Fox Moving!!"]], "date": "2013-10-27", "time": "02:26:24", "categories": "Movers, Local Services, Home Services", "city": "Nashville", "state": "TN", "stars": 1.5, "business_review_count": 136, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "l9XedHruFuKIAKBUMhzzBA", "user_id": "QEazGmXmTuLxn-U58uFi-A", "business_id": "9w-LZEkP1hf363G-OYvKDg", "review": [["Pro's: \nAmazing pulled pork tacos and chicken tortilla soup. \nFast service \nGreat prices \nPersonable staff \n\nCons:  \nPoor parking \nLimited seating space \nA dive but that is part of the charm"]], "date": "2014-06-21", "time": "19:15:10", "categories": "Tacos, Mexican, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 1503, "predit_yelp_score": 1.675, "actual_yelp_score": 5.0}, {"review_id": "cR5wVVuCcG1HJNdnHny8kw", "user_id": "P8b-oLnAcTUVJdJliaeGXA", "business_id": "A9VBvn-H5EBil-7vmR8UVQ", "review": [["CHBC is the best bagel in Nashville! The bagels are so soft! I also love the homemade smears. The customer service is unmatched. The workers are so friendly and love to offer recommendations!"]], "date": "2021-09-19", "time": "20:09:10", "categories": "Food, Coffee & Tea, Bagels", "city": "Nashville", "state": "TN", "stars": 5.0, "business_review_count": 45, "predit_yelp_score": 2.5999999999999996, "actual_yelp_score": 5.0}, {"review_id": "28n1avscCchsbnjPGkaJBg", "user_id": "cMEtAiW60I5wE_vLfTxoJQ", "business_id": "4SRl5od0lY33oK1GMbA23A", "review": [["I heard great things about Husk and we definitely were not disappointed!  First off, Husk is located in a beautiful old house with a modern addition attached to it - I was so ready to move into that space!  The decor was simply beautiful and the restaurant smelled of their wood burning stove/oven...such a nice touch.  The service was great and he guided us through the amazing menu.  Our party started with the broccoli salad, seafood johnnycakes and the beet salad, proceeded to enjoy the beef chimichurri and the chicken entrees and finished up with the lemon tart - such an exquisite meal bursting with flavor."]], "date": "2016-04-22", "time": "13:44:10", "categories": "Restaurants, American (New), Nightlife, Bars, Cocktail Bars, Southern, American (Traditional), Breakfast & Brunch", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 1559, "predit_yelp_score": 2.475, "actual_yelp_score": 4.0}, {"review_id": "B333uvO9_8gK22Udut4ysg", "user_id": "6cwUZsOPwoqWsvasjCs-0Q", "business_id": "0RxW0oN1s4zgNh6uiWVPZQ", "review": [["Calypso Cafe is always our first stop when we visit Smashville for a Predators game! We love the black bean nachos, bbq chicken sandwiches and boija muffins!"]], "date": "2015-11-15", "time": "04:23:18", "categories": "Sandwiches, Vegetarian, Caribbean, Salad, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 176, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "Sv64O2SrATWyT8lwL7QdXw", "user_id": "rhkB-W6ypGtqicFcyVMWbw", "business_id": "N5ekxQd7wGHWJJK-p9qqXw", "review": [["We've dined at Moto s a few times b4. There are two areas: Front and back of house.  This time we sat in back at a booth.  Food was excellent although the burrata w marinated tomatoes was skimpy on the buratta. The server was less attentive than we have experienced on previous visits.  I recommend requesting booth in front of house where there are windows and it's more open. Son had pasta, hubby had shrimp w pasta, and I had scallops."]], "date": "2018-07-05", "time": "19:25:34", "categories": "Restaurants, Italian", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 423, "predit_yelp_score": 1.3, "actual_yelp_score": 4.0}, {"review_id": "4w2wqtpXYPQsKFoXVYZcpg", "user_id": "y1MjKf7oBzNgceH7Od8urQ", "business_id": "xxx_0Ol7lbK0hVzv7x0-Yg", "review": [["so.. lucky bamboo has very delicious options. BUT today I called in an order and asked that it has no squid(I have an allergy). The customer service that was provided was horrible.  she kept saying I don't understand what you are saying. I replied can you please not have the squid in the soup. she said well there isn't an option for that for me to enter. (I've placed this order like before several times and never had an issue)I asked her if she could let the staff know in the back to not add the squid in the soup. she laughed and said that she can try and continued laughing. (I never had an issue before requesting to remove an ingredient whether it was due to allergies or not.) I cancelled my order and I will never step foot in there again or order from there.  Folks, I've worked in various areas of customer service. It doesn't matter the reason why I ask to have an ingredient removed. It was the way she approached the situation and laughed.  It was \n distasteful."]], "date": "2017-06-14", "time": "23:55:46", "categories": "Restaurants, Hot Pot, Dim Sum, Szechuan, Chinese", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 519, "predit_yelp_score": 1.15, "actual_yelp_score": 1.0}, {"review_id": "dB2W3zgtj1gZ1ooD7rnwkA", "user_id": "ZVqqj89pMXWDgdPcE2qYyQ", "business_id": "I-nrEtjboBLoEvGiSAcmvw", "review": [["One of the best dining experiences we've ever had! The special touches for my girlfriend's birthday were much appreciated - they gave us a window table and all of the waitstaff signed a birthday card for her. Fantastic service and ambiance. On to the food: the instant bacon dish is an all timer. The flavors are insane in that dish. The warm seafood platter, Australian filet mignon, and black truffle mac & cheese were all incredible. The s'more dessert and all of our cocktails were amazing as well. Truly a meal we'll never forget. We can't wait to return in the future!"]], "date": "2021-10-08", "time": "15:36:02", "categories": "Bars, Cocktail Bars, Desserts, Steakhouses, Seafood, Food, American (New), Restaurants, Nightlife, Lounges", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 379, "predit_yelp_score": 2.325, "actual_yelp_score": 5.0}, {"review_id": "AgmjjG6hlGY_5QDBi98imQ", "user_id": "ggcXBgJxFbCmfRxDx3o3yw", "business_id": "Ap17J1vN-u4SAGl5xZ8uOQ", "review": [["Chad is responsive and scheduling a time with them was easy.\n\nRick came out and unmounted a TV, took apart a queen bed, and patched up and repainted holes on the wall. He was efficient, thoughtful (put everything neatly away), and friendly!\n\nPretty good pricing as well!"]], "date": "2018-12-21", "time": "22:25:47", "categories": "Home Services, Home Cleaning, Gardeners, Landscaping, Handyman", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 27, "predit_yelp_score": 1.875, "actual_yelp_score": 5.0}, {"review_id": "tPANtvDT0yayuidqkLrjag", "user_id": "o7r9Pra-DJgbptutG0vZOg", "business_id": "w1rUV5W_TJ0M0MRwwrseWQ", "review": [["Coming to Nashville as a vegetarian has the potential to be disappointing because of all the BBQ we would normally not be able to eat, but fear not, Southern V has us covered.  Have been in town 4 days and this is our second trip here.  Have gotten the Hot Chick'n both times.  It satisfies every craving I have.  Add in the choices of sides of Mac n cheese, baked beans, greens, green beans, etc and you will want to make return trips yourself.  Headed back to Vegas tomorrow.  Hoping they decide to expand to Vegas and open a restaurant there!"]], "date": "2018-12-30", "time": "21:15:49", "categories": "Food, Southern, Restaurants, Vegan, Ice Cream & Frozen Yogurt, Breakfast & Brunch, Bakeries, Vegetarian", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 261, "predit_yelp_score": 1.75, "actual_yelp_score": 5.0}, {"review_id": "dx-3Rnl9meIPunGa6GgxoQ", "user_id": "qWE8vVSSGNqOTsu4X_13Eg", "business_id": "OWOOc0YjU_kioLeEgo5VCA", "review": [["Biscuits & jams were so delicious we visited twice in a 1 week trip (and bought biscuit mix & jam to go!). It lives up to the reputation and is worth the wait. (Just make sure you call 24+ hours in advance for reservations, especially for large groups, otherwise they won't take em).\n\nBBQ pulled pork breakfast platter was huge and tasty. Fried chicken and waffles were okay (waffle was on the heavy and bland side), I subbed in dark meat fried chicken and it was super good. I'd order just the plain fried chicken dish next time.\n\nBlueberry vodka drink with a souvenir shot glass for $11, it was really good... Maybe too good! \n\nIf we lived closer, I'd be 400 lbs. Can't wait till my next trip to TN to return."]], "date": "2015-06-28", "time": "03:43:47", "categories": "Food, American (Traditional), Arts & Entertainment, Southern, Nightlife, Restaurants, Breakfast & Brunch, Music Venues", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 2452, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "3yd6Vin1RtDlf6BMnNponw", "user_id": "jyYFzL9JCJJfejd3lJ-vRg", "business_id": "JhcAR32Mck-dXTMsz1OSFQ", "review": [["Haven't eatin here but I REALLY like this place, they have great beer specials, and have great prices with so many beverages to  choose from, they have corn hole outside and a great service! It's a clean divey bar in a great location right by the park!"]], "date": "2014-07-21", "time": "13:49:54", "categories": "Bars, Nightlife, Pubs, Restaurants, Sports Bars, American (Traditional)", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 81, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "4qKUHwyVl0881nw1fiWUlw", "user_id": "8YvQOkB9tugfOlY0WbGvQQ", "business_id": "6Pu5MKIWbn6FO-oebSSrYQ", "review": [["Excellent service and wonderful unique dishes and sides! I was in town for the weekend with a friend and we went Saturday night and couldn't stay away Sunday night!"]], "date": "2019-12-30", "time": "19:09:39", "categories": "Seafood, Bars, Breakfast & Brunch, Nightlife, Cajun/Creole, American (Traditional), Southern, Steakhouses, Pubs, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 2295, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "Fs1LLHK4THhBpwJbEbqkUA", "user_id": "5JRsBTopf1lr4gbeLV0o9g", "business_id": "n5FS-R7aFxFSBeHfVCAuRQ", "review": [["Came in for brunch while in town for a bachelorette and this place is so cute inside! To start, I had the Bees Knees cocktail which is gin based and very refreshing - highly recommend! The bride to be had the big fix which is a bloody mary that comes with alllll the fixings including tots, chicken and a crab claw (WOW!) - that's a meal within itself. To eat, I had the chicken caesar wrap (add bacon because duh) and honestly it was the best caesar wrap I've ever had. This isn't something I'd normally order at a place like this first because it's brunch and second because I'm an egg fanatic, so this was a risk; and the best risk ever!"]], "date": "2019-06-18", "time": "02:14:37", "categories": "Breakfast & Brunch, Restaurants, Chicken Shop, Nightlife, Bars, American (Traditional)", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 345, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 4.0}, {"review_id": "I7m6Bgj-EVwsbVZjy9ukJA", "user_id": "VIsSr0blrfL62aW7dxE8AA", "business_id": "t2B_HVgPg--eUVprWQX_Eg", "review": [["I've been here twice, both times the subs were exceptionally tasty and well-prepared. The first time was during lunch rush so it (obviously) took quite a while, but these sandwiches are time consuming to make (more so than Subway) so I will not fault them as long as the food is exceptional, and thus far it has been. The service is also great, even in rush hour. Smiles, polite, and patient. Never going to Subway again. The chipotle cheesesteak is amazing, so is the Big Kahuna!"]], "date": "2014-08-09", "time": "00:08:22", "categories": "Sandwiches, Fast Food, Delis, Restaurants", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 26, "predit_yelp_score": 2.1, "actual_yelp_score": 5.0}, {"review_id": "_QS-byAGuL5-Bj3P3sXviA", "user_id": "d_TmcDYkZg8nf0FgB9zPIQ", "business_id": "V7dXBEowSa53mOVaDtnj_A", "review": [["Love playing at Top Golf but unhappy with the reserving process. Waited 2 hours for what was said to be a 30 minute wait, only to find out that my name had been kicked off the waiting list after confirming with the desk *twice*. Other than this, I always have a great time and bring my friends from out of town to play."]], "date": "2018-03-15", "time": "01:44:35", "categories": "Golf, Restaurants, Active Life, American (New), Nightlife, Bars, Sports Bars", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 278, "predit_yelp_score": 1.425, "actual_yelp_score": 1.0}, {"review_id": "mbUp3fLrRT8rBPwTGTSpSQ", "user_id": "hbqYtojSshA6ekSAQukjCQ", "business_id": "0oFrJWbTdu6S5d2loFKmRw", "review": [["Didn't know much about this place until a friend talked highly about it. Looked at the menu and they had carne asada fries and I was convinced. The fries were great and a nice size portion. Added a little queso to the fries and I had a great meal. I will be back soon."]], "date": "2020-11-17", "time": "21:42:05", "categories": "Mexican, Seafood, Tacos, Restaurants, Salad, Nightlife, Bars", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 99, "predit_yelp_score": 1.85, "actual_yelp_score": 5.0}, {"review_id": "pLo7taqG4zWI5-1x-q1sRQ", "user_id": "PdCR2ElSc0cVym5dCN3Zsw", "business_id": "ZhA88ILcgEP9DNwZDx7f0A", "review": [["This place simply blew my mind. 3 stories tall and live music on every level. Had a great time, next time in Nashville, I'll be back!!!"]], "date": "2015-01-19", "time": "20:51:56", "categories": "Hotels & Travel, Pubs, Bars, Nightlife, Restaurants, American (Traditional), Music Venues, Southern, Arts & Entertainment, Chicken Wings", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 647, "predit_yelp_score": 1.35, "actual_yelp_score": 5.0}, {"review_id": "Im-vycRxf4B_bgk5Hf3O2A", "user_id": "mNtOv0tfWrtA9y0JRMiBnA", "business_id": "BsqWAGeo0VNIaiSIMkbQew", "review": [["Everything has been great.  I got a great price from the coupon booklet. As soon as I called, the people were nice. They were super friendly when we came. They let us check in early, asked what floor we wanted, were more than accommodating to my bizarre request to play banjo in their lobby for a few minutes (I came to Nashville to purchase a banjo and wanted to meet the seller in a public place). There are delicious cookies available during the day, coffee and tea, WiFi that works. The beds are comfortable. The rooms are really cool looking, recently updated, spotless, and have refrigerators and microwaves. I would definitely come back. Perfect experience."]], "date": "2013-03-30", "time": "12:04:00", "categories": "Hotels, Hotels & Travel, Event Planning & Services", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 58, "predit_yelp_score": 2.35, "actual_yelp_score": 5.0}, {"review_id": "Vq-lpRgPQyPTccoDWMdd2Q", "user_id": "QxdoAmJqQaJ-iUUE8oaahQ", "business_id": "gKavBVCK5G0cPJ9moV6iOA", "review": [["I went last night and was soooo DISAPPOINTED. I frequently visit this restaurant and I will not return.. First off it took over 10 minutes for a server to even acknowledge us and no it was not busy, secondly they changed the menu took the oyster Rockville off my favorite.. So as I settled for oysters they were all out, they were even out of half of the side items. So I settled for a cob salad, the iceberg lettuce were old the brisket was very bland and overall it was just nasty. The server acknowledged that I hardly touched the salad but did not offer any other options. Etc.. I normally don't complain or even leave reviews BUT IT SUCKED.."]], "date": "2018-06-15", "time": "12:47:56", "categories": "Bars, Pubs, Restaurants, Seafood, Steakhouses, Nightlife, Barbeque, Southern", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 284, "predit_yelp_score": 0.75, "actual_yelp_score": 1.0}, {"review_id": "0A98Ua7LzjlvjV0fzt4Lmw", "user_id": "Qopuiy8lbI7wQuJ7lCWKbQ", "business_id": "zPiBTTqr9PyUwjhDsdfH2w", "review": [["Food was not good and customer service was terrible.  An employee behind the bar had ear buds in having a full conversation out loud with a friend and had no consideration of customers at the bar.  At one point she was right in front of us for 5 minutes talking right in our faces.  Ridiculous!"]], "date": "2021-11-30", "time": "20:42:21", "categories": "Restaurants, American (New), Burgers, American (Traditional)", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 495, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "GKI3DpRR8Zffx-_JytgxUA", "user_id": "7f3yIeHKFxVv7ReadBagAg", "business_id": "ivOq99f948mKivtgPhpAtQ", "review": [["Adrian is incredibly nice and does a great job with my super short nails and dry cuticles. Her nail room is trendy, relaxing and clean. She also has a great special: buy one shellac manicure and get the second half off! Also, it's super convenient to be able to make appointments online."]], "date": "2014-05-09", "time": "19:46:28", "categories": "Beauty & Spas, Nail Salons", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 6, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "DkhroDz1Tk1O-G6BCX_fRQ", "user_id": "Utk4ueCff7Ao7Awf0bqQGQ", "business_id": "T2JzbrPH2GkY6XpyzNe7ow", "review": [["The food was great, the drinks were great, and the service was excellent! Taylor H was a fantastic server, just wanted to give her a shout out for a wonderful brunch service!"]], "date": "2019-03-31", "time": "19:14:13", "categories": "Breakfast & Brunch, Specialty Food, Restaurants, French, Delis, Food", "city": "Nashville", "state": "TN", "stars": 4.5, "business_review_count": 863, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "nAvgcfB3QV6CdO9yVjoYAg", "user_id": "0Pf8i4PsAgeSOeNRaMVVQw", "business_id": "MPCknINXdfg1aWnBK7B7gQ", "review": [["I would give my experience here 0 stars if I could. In addition to serving me the raw salmon in this picture, the service was also terrible from start to finish. It took 5 minutes for a hostess/waitress to acknowledge us waiting to be seated even though eye contact was made several times. The restaurant was empty but it still took 35-40 for us to receive our food. I found this very ironic considering my salmon came out almost completely raw. The server's response to what happened was also oddly casual considering the severity of this mistake. The side of barbecue sauce on my boyfriends plate had been sitting out so long before it came out that it separated into layers. I asked for the menu to order something else, but the waitress took 15 mins to come back for my second order so we just ended up leaving. All in all, it was an extremely disappointing experience. I'll never come back here"]], "date": "2019-12-23", "time": "04:44:03", "categories": "Steakhouses, American (Traditional), Burgers, Restaurants", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 298, "predit_yelp_score": 0.55, "actual_yelp_score": 1.0}, {"review_id": "iiJbp73oXto3rW1GUQQNTA", "user_id": "G3cK4UgXFXla4A4YKA7RUg", "business_id": "quUQsNwaNWSLedV1W7Geyw", "review": [["I love Reds! The tenders are huge and always perfectly cooked. Moist and tender. The spice levels are spot on. I have tried everything but the Nashville hot and they are all delicious. Just depends on your mood. The crunch wrap is a personal favorite! A wickedly good combo of hot chicken, bacon, pickles, comeback sauce and Mac and cheese all in a grilled tortilla wrap. The side of Mac and cheese is the way to go. Rich and creamy with a little kick. Great customer service. If you are in a hurry, call ahead as everything is made to order."]], "date": "2021-07-13", "time": "15:53:00", "categories": "Restaurants, Food Trucks, Chicken Shop, Sandwiches, Food, Southern", "city": "Nashville", "state": "TN", "stars": 5.0, "business_review_count": 33, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}, {"review_id": "uEB__2Lz-8aivJPTnt40LA", "user_id": "6fXwEH_F3ascljjmS1oCVQ", "business_id": "DvkSkF83xDONjkNIoEPRnQ", "review": [["They try,  but they miss the mark in many ways. First, they are overpriced-especially for the amount of food you get. Second-they often forget or leave things out that you've order. Third-the meat is alway super fatty and I need to spend time trimming it. That being said, the flavors are there and the staff is nice. This is not our choice for Greek food in the area. The back patio is a nice place to sit."]], "date": "2020-06-09", "time": "01:44:52", "categories": "Restaurants, Street Vendors, Wine Bars, Food, Event Planning & Services, Bars, Mediterranean, Greek, Nightlife, Caterers", "city": "Nashville", "state": "TN", "stars": 4.0, "business_review_count": 267, "predit_yelp_score": 1.0750000000000002, "actual_yelp_score": 3.0}]