[{"review_id": "tWthpCNPm07lXJyIm16UgA", "user_id": "TB8f7eBGXGPUh6hKn0CWWA", "business_id": "HeIuCW7loBXVyBQlN4pQAQ", "review": [["Skip. My boyfriend and Iwent here because out was close to or hotel. They were out of most menu items, food service slow, nothing special about the food and they forgot to bring out all of my boyfriend's meal Country breakfast with no bacon. In all we were pretty disappointed I'm surprised at the good reviews this place has"]], "date": "2013-07-11", "time": "17:41:04", "categories": "Breakfast & Brunch, Restaurants, Diners", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 89, "predit_yelp_score": 1.0, "actual_yelp_score": 1.0}, {"review_id": "RKQ7SmaurcsvhSXi772MDA", "user_id": "7Z3QZnc9CFRH_bPRGN-Oiw", "business_id": "1Tf1W0Abh0-JyvhHVb_3VA", "review": [["Itty, bitty cuppycakes for $2.50 each. \n\nMy three bites of cupcake were good, but the frosting was a sugar bomb. Too much! Too much! The blueberry cupcake would have been so much better without all that. \n\nAlso, for a New Orleans shop, there was surprisingly little air-conditioning. I was sweating into my cupcake. (Yuck.) It's not like the damn place was crowded.\n\nAccessibility notes: No braille signage. The store is one step up and has a push-in style door. The counter is higher than eye level for a seated customer, but the staff was very helpful."]], "date": "2010-06-30", "time": "17:06:29", "categories": "Caterers, Event Planning & Services", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 47, "predit_yelp_score": 1.2750000000000001, "actual_yelp_score": 2.0}, {"review_id": "GK3FOrZ8Fxz0ak3w8mnkug", "user_id": "0eCP9trys7usCvNcNE1y0w", "business_id": "lxNujGFgeVEgO7H9othc-A", "review": [["Great massage! I was so tight from working on my computer for an intense 2 month course. And Skylar worked all  of the tightness out of my neck, lower back and calves. Thank you!"]], "date": "2017-04-28", "time": "20:49:25", "categories": "Massage Therapy, Beauty & Spas, Massage, Health & Medical, Day Spas", "city": "New Orleans", "state": "LA", "stars": 5.0, "business_review_count": 207, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "TTom77tzR9HBdeslM6obIw", "user_id": "AP3DpJoToJJVHSdnfI99gg", "business_id": "8BhNur6_XKLjCDvbhX2CNg", "review": [["10 years ago I thought this place had the best breakfast in New Orleans.\n\nAfter my recent visit though, I won't be back. Servers were RUDE, portion was so small that it looked like someone had eaten my breakfast before they gave it to me!\nBreakfast for 10 or 12 dollars didn't even come with bread or toast, are they joking?"]], "date": "2014-11-10", "time": "01:21:17", "categories": "Restaurants, Breakfast & Brunch, Cajun/Creole, Seafood", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 735, "predit_yelp_score": 1.275, "actual_yelp_score": 2.0}, {"review_id": "caBF8b51xKpWqbWPFqw5pA", "user_id": "msW2BT41MN2Pl0h73mDTYw", "business_id": "sitve7-2mPUQQ2bV8jLCRg", "review": [["There I was enjoying a glass of wine in our room and reading through an in-room publication when I spotted their ad.\n\nMy husband loves to cook, so on a whim we decided to book their class for the next day.  TIP: they seat people in order of your reservation, so don't wait to sign-up in store.\n\nClassroom was comfortable and spacious, holding up to probably 40-50 people.   The chef's cooking and prep area included a ceiling mirror, allowing an excellent view of everything he was doing and what was happening in the pans.\n\nChef Kevin is a character - perfect at encouraging you to experiment with his beloved creole cuisine.\n\nOur menus included gumbo, red beans & rice, pecan pie & pralines.\nBring an appetite to the 10am class, since at the end of the 2.5 hours, you enjoy a meal of all of the items, with iced tea or beer with a side of cornbread. YUM\n\nWe would do this AGAIN in a heart beat -  Best $30ish per person deal in NOLA!"]], "date": "2014-07-15", "time": "19:22:30", "categories": "Hotels & Travel, Cooking Schools, Restaurants, Tours, Specialty Schools, Education", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 525, "predit_yelp_score": 4.925000000000001, "actual_yelp_score": 5.0}, {"review_id": "1-dC4Zq3AwnPkf_cfrR9Yg", "user_id": "IUdMN4F2qqumV9eViCmktA", "business_id": "I2YZuyG1KjiTbtwfNFHaOQ", "review": [["Came here cos we love the show (Pit bulls and Parolees) and proceeds from this bar/restaurant go towards the rescue center. Service was excellent, the manager and bartender were both super friendly. We ordered fried green tomatoes caprese style and the twice cooked pork. Both dishes were delicious, pork was melt in your mouth, the fried tomatoes were perfectly seasoned. I'd definitely recommend this place if you're visiting New Orleans."]], "date": "2019-08-07", "time": "15:23:17", "categories": "Bars, Nightlife, Latin American, Restaurants, Cocktail Bars, Comfort Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 156, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "5aRlKgYxlIoWo00m2Nnfcg", "user_id": "bfq5L0rWgG5VQF3tU1TF5w", "business_id": "pym7c6ZFEtmoH16xN2ApBg", "review": [["Take fresh seafood and slap it on a beignet, a local delicacy, and you have yourself something special.\n\nI've noticed NOLA does neighborhood eateries with a certain panache. Being in Katie's, is being in a lively and communal restaurant, that smells heavenly on first arrival. The bones are nothing out of this world special, but the feeling you get is hard to replicate through decor. It can only really be expressed through people.\nIf you come here, and fancy yourself seafood you must, MUST, get the seafood beignet. It absolutely breaks my heart we have nothing like it in my neck of the woods. That is one memorable dish.\n\nHad the catifsh po'boy. Which was very good too...although, I gotta be straight, it's not quite on par with some of those gas station heroes you can get in this city. Great but not exceptional.\n\nA solid choice nonetheless, and not outrageously expensive either. Big up, Katie's."]], "date": "2019-03-13", "time": "01:15:37", "categories": "Restaurants, Bars, Nightlife, American (Traditional), Cajun/Creole, Seafood", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 1289, "predit_yelp_score": 3.1999999999999997, "actual_yelp_score": 4.0}, {"review_id": "HfOK2geLmv5FZSLNI0Y4yw", "user_id": "Yk1oOhJRMcDr0xK4bMQ4bA", "business_id": "_393npnr0Dw1aGKy83x_0A", "review": [["Absolutely recommend! The restaurant is beautiful with ample seating. We sat upstairs and we got a Birdseye view of the whole first floor including the kitchen which was really cool. The staff was beyond attentive and friendly. \n\nOkay now onto the food...The food and drinks were SO GOOD!!! Definitely some of the best food I have had in a while. I loved everything we ordered. Don't miss out on the squid ink pasta! I don't eat red meat so I can't share about those dishes, but I can't wait to go back!"]], "date": "2021-10-06", "time": "02:28:12", "categories": "Restaurants, Pizza, American (New), Breakfast & Brunch, Mediterranean", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 507, "predit_yelp_score": 4.375, "actual_yelp_score": 5.0}, {"review_id": "u1QyuEmD_3PqN61NLyqLUw", "user_id": "jgIIuTE8M6sZaDzdQt_Eug", "business_id": "qb28j-FNX1_6xm7u372TZA", "review": [["This was highly recommended by a few locals and tourists.  Gaylin Martin, because you are truly interested in what your patrons are saying, this will have some details for you, since I'm really hoping to retry the restaurant again.\n\nOur server passed by our table at least 5 times without acknowledging that we were even there.  Granted, he didn't have to stop and chat or see if we were ready to order - a \"Hi, how are you, I'll be right with you all\" would have sufficed.  Just so we knew that he knew we were there.  My friend had to call him over to order.  Once we had our food, our server never checked on us to see if our food was ok and didn't ask if we wanted the check, just brought it.\n\nThe food was so bland and tasteless that it made me want to call this a tourist place.  I had the namesake gumbo.  Now, it doesn't have to be spicy - it would have been fine at any spice level, as long as it had flavor.  The worst part was that the rice was underdone, to the point of it being crunchy.  Flavor or no flavor, that rice made the dish an epic fail.  The jambalaya that we ordered was done, but again, no flavor.\n\nBlah food, bad service.  That sums up my experience."]], "date": "2013-06-18", "time": "02:30:20", "categories": "Cajun/Creole, Seafood, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 3902, "predit_yelp_score": 1.75, "actual_yelp_score": 2.0}, {"review_id": "BnjkmQvCDgFm0vtXuVPeiw", "user_id": "JHHw5YbbP_-fq6xybID3VA", "business_id": "RLlOK2fL6xU1sfIPiP2QBw", "review": [["We enjoyed the Giant Seafood Platter! Feed 6 of us with leftovers!  Soft shell crabs, catfish, oysters, shrimp, fries and crawfish balls.  We also had onion rings, and the red potatoes were scrumptious!"]], "date": "2018-01-29", "time": "17:59:14", "categories": "Restaurants, American (Traditional), Food, French, Specialty Food, Seafood, Diners, Cajun/Creole, Seafood Markets, Event Planning & Services, Southern, Caterers, Salad", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 2473, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "IQd4wuVRLrohfDhVjwDoxQ", "user_id": "j16xNJSUxkcB8JI5KtMIjQ", "business_id": "srPwdMyFdHxvRkG9P_sRDA", "review": [["Booty's is hands down my favorite bar in New Orleans. Their cocktails are the perfect mix of sweet and strong, and they have a rotating menu so there is almost always something new to try. The orange flower-type spray that they put in some of their drinks is crazy delicious. \n\nTheir food is also yummy. The ramen comes with the broth in a teapot . . . adorable! And I've always found the bartenders and waiters to be really friendly, and the atmosphere is generally warm and lively.\n\nNothing not to love."]], "date": "2014-02-24", "time": "23:23:45", "categories": "Breakfast & Brunch, Restaurants, Tapas/Small Plates", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 250, "predit_yelp_score": 4.375, "actual_yelp_score": 5.0}, {"review_id": "BM7AMJ1J8Btdhn_Xupe3NQ", "user_id": "GlZhUgYJah0ug7pa1F0Ndg", "business_id": "nTBStZYJfHGdSZJbpaBiPA", "review": [["The BEST brunch I had. Service is also great. I had waffle with chicken tender and chief's omelet with chilli. Waffle is thin and crispy, chicken tender not oily, but crispy. Chief's special omelet. just wow. \n\nCoffee is also very good and you get refill. This place has an open kitchen, but you don't really smell smoke. I recommend everyone to check this place out."]], "date": "2016-12-23", "time": "16:38:13", "categories": "American (New), Food, Breakfast & Brunch, American (Traditional), Restaurants, Coffee & Tea, Burgers", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 933, "predit_yelp_score": 4.675000000000001, "actual_yelp_score": 5.0}, {"review_id": "Nzh5sxdLu1AJQq57Yc-MaQ", "user_id": "hLt-plzvszhdspHJ3FbM5A", "business_id": "tZc8xxp78LGOns_gzFdgWQ", "review": [["I've been to this nail salon a few times.  I would give it a 3.5 if that was an option.  You can tell immediately that it's a family owned establishment and they are all hard workers and eager to please.  They do a nice job with a spa pedicure as well as a regular manicure.  \n\nMy last visit is the one that keeps me from rating it a 4.  I opted to do a gel manicure and I think they left my hands under the UV light for far too long.  I began to feel a burning sensation in my fingers.  It happened in both hands and that's never happened to me before.  The UV light is supposed to stay on for 1 minute and then it shuts off but then it restarts again.  I asked the lady if I was supposed to take them out or let them go another cycle and she said they could stay in.  I don't get gel nails very often but I thought you're only supposed to need 1 cycle (maybe 2 at the most).  Mine went 3 cycles for each hand and that's when the burning started.  Even they were a bit concerned.  \n\nIn the end, my nails were fine and the polish lasted the 2 weeks that it's supposed to, but the burning sensation was cause for concern.  Also, when I went back 2 weeks later to have the gel soaked off, I was charged $10.  I've had other salons do this service for $3 and one salon I know of even does it for free, so I was a bit shocked by the $10.  But they did do a bit more than those other salons that just have me soak my hands until it comes off.  They used the rotating file to scrape the polish loose and plus brushed some cuticle oil over the nails to help them heal - so I guess that's why the $10 charge."]], "date": "2014-12-18", "time": "22:03:52", "categories": "Nail Salons, Beauty & Spas", "city": "New Orleans", "state": "LA", "stars": 2.5, "business_review_count": 11, "predit_yelp_score": 1.6, "actual_yelp_score": 3.0}, {"review_id": "MgW4m1cDS9oWDr27kgcCgw", "user_id": "qiyWFOLy2Vl6XE9KNQhhcQ", "business_id": "aH3xlewNKQk5K4mEko6qQQ", "review": [["The pizza here is has very thick bread. I have yet to try their thin crust... but the bread is a little too thick for my taste. I also like my dough really chewy when it comes to thick deep dish pizzas. This dough isn't that chewy. Maybe I'll rate midway again after I try the thin crust. \n \nThe service is always great\n\nThey have their own custom ice cream called the midway crunch. I highly recommend it."]], "date": "2017-02-28", "time": "02:33:39", "categories": "Restaurants, Pizza", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 339, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 3.0}, {"review_id": "zCrdTbW2EMTyf3CdLoCE9g", "user_id": "IWSRrjEhpr66YETlU9Q7_g", "business_id": "XFErz9a-TEuh38fkwaqPWg", "review": [["This is not Reflexology, it's foot rubbing!  We have a great and reputable place that we have a standing reflexology appointment each week.  They start by bathing our feet in hot water, then spend 50 minutes doing an intensive and effective treatment, ending with hot stone and hot towels.  This place today was nothing but an overpriced tourist trap that we couldn't wait for it to end!"]], "date": "2018-03-08", "time": "02:42:16", "categories": "Massage, Health & Medical, Reflexology, Beauty & Spas", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 33, "predit_yelp_score": 2.475, "actual_yelp_score": 1.0}, {"review_id": "LmY6CdrfPnVsBO0beG_iCg", "user_id": "Hb2RzG3b9YEBlrwBWzGtCA", "business_id": "vN6v8m4DO45Z4pp8yxxF_w", "review": [["Small local breakfast spot located in the lower garden district. We came on a Saturday during St. Patrick's Day weekend and waited about 45 minutes. You will have to wait outside because there is no room to stand inside. If you have a larger party you will not be able to sit together.\n\nThe waitstaff was super friendly and the food did not take too long to come out. I had the shrimp and grits and it was the best I've ever had."]], "date": "2018-03-22", "time": "22:48:45", "categories": "Vegetarian, Restaurants, Breakfast & Brunch, Cafes, Juice Bars & Smoothies, Sandwiches, Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 2084, "predit_yelp_score": 4.925000000000001, "actual_yelp_score": 5.0}, {"review_id": "4k9rnC_3ndsz99J98Gl0pA", "user_id": "1Lze6OSQqA4-QBIi8g0AFQ", "business_id": "K8_zJDBpDEOMRuVk9bOGgw", "review": [["I used these guys because of the previous review.  However my experience wasn't so good.   First, they charge $85 for an estimate.   That wouldn't be so bad because if you use the service, it will be taken off the bill.   However, the estimate was not complete.   I asked them to install a shower from the existing faucet and they didn't give me an estimate at first.   Then when I asked for it, they gave me an estimate to completely remove my tube and fit me with a new shower ($1200).   The cost to reset a toilet ($150).   That seems very unreasonable but was the only thing that I could use them on because the estimate had already cost me the $85.   The other problem was that the person that you talk to on the phone is not the person that actually does the work.   So the communication between them isn't so good.   The tried to call me before setting up an appointment to see if I was around to do the work.  I told them that I was out of the country and that my roommate would be their contact.   They just didn't have any work that day so they thought they would just \"drop by\".   Then when they did have an appointment, they had to cancel it because the job before mine went wrong and the plumber couldn't make it to the appointment.   I would highly not recommend them for future jobs.   Very pricey, not good communication and the estimate that costs money was not complete."]], "date": "2014-01-05", "time": "21:42:25", "categories": "Home Services, Plumbing", "city": "New Orleans", "state": "LA", "stars": 2.0, "business_review_count": 26, "predit_yelp_score": 0.35, "actual_yelp_score": 1.0}, {"review_id": "wPZYC1QC_MWnhfHIckwiYQ", "user_id": "rvN_7x0-E_N-8H0nWc4irA", "business_id": "gTC8IQ_i8zXytWSly3Ttvg", "review": [["Amazing.  I have eaten at Butcher many times and the quality of food is top notch and the place doesn't break the bank.  I have attempted to work my way through the menu but the ones I keep going back to are the Pig Mac and the Spiced Lamb.  Seriously - every positive thing written about the Pig Mac on this board is absolutely true - it is a fantastic guilty pleasure.  Everything else I have tried is also excellent but I keep going back to those two.  The specials are also generally spot on - I am a sucker for any variation of their meat pies.  The wine list is reasonable and it is a fun space to enjoy a bottle in the evenings. Certainly I have been going more since the expansion into the building next door as securing a table is now a likely possibility. Service is a counter/table hybrid which is a little confusing but it is quick and friendly and if you sit down someone will take care of you shortly.\n\nLocal and tourist alike - the is definitely a must do.  If you are visiting and want to try more Louisiana inspired options the Muffaletta, the Head Cheese, and the Boudin are all strong."]], "date": "2014-10-22", "time": "16:48:15", "categories": "Shopping, Butcher, Restaurants, Sandwiches, Food, Meat Shops, Specialty Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 3837, "predit_yelp_score": 4.15, "actual_yelp_score": 5.0}, {"review_id": "c0Ot5Qt4Ss2un9TcW9BwGg", "user_id": "UD6w7Mvqq4-2pnolkcVueg", "business_id": "VVH6k9-ycttH3TV_lk5WfQ", "review": [["BEST FRIED CHICKEN I HAD.\n\nPerfect crispy skin, perfectly seasoned. It was amazing. Please arrive before 11 so you do not have to wait in line. \n\nTakes about 30 mins for food to come out but it is worth the wait."]], "date": "2020-01-28", "time": "19:39:36", "categories": "Comfort Food, Restaurants, Southern", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 3582, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "aOGQ6ICcZaL9clbSuCrBqA", "user_id": "fONB2QGyjduwlvfoMZDTOQ", "business_id": "kdqoDMuvyNedsouc1i33vQ", "review": [["Absolutely terrible experience. Food was beyond bad.  Meat was extremely tough. Service was so bad, our waitress quit while in the middle of serving us. The only halfway decent thing is the atmosphere. Everything was way over priced. The \"pickled vegetables\" we're so small and bad it was literally  served  in a side condiment cup which maybe held only one ounce of contents. \nDO NOT WAISTE YOUR TIME OR MONEY!!!"]], "date": "2015-05-10", "time": "02:03:18", "categories": "Tacos, Cocktail Bars, Nightlife, Bars, Restaurants, Soup, Beer Bar, Food, Mexican", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 312, "predit_yelp_score": 0.375, "actual_yelp_score": 1.0}, {"review_id": "mlRLErLg-lzMAIP01YUv_w", "user_id": "rvN_7x0-E_N-8H0nWc4irA", "business_id": "YmF6Bh0MkjW5qci5KI6D2Q", "review": [["Awesome new spot in the Channel.  They basically bought the block between Second and Third on Thcoup and have set up a covered bar with a large patio area.  There is a huge parking lot which is basically unheard of in this part of town and plans for expansion of an indoor bar.  Its a nice change for the neighborhood - love the existing bars - but if you have 10 people and want to be able to find a seat and have everybody hang out there are few options.  The beer list is solid and served in chilled schooners.  Dog friendly and there are generally food trucks or dudes grilling awesome rotisserie meats.  The only downside is that it is all outside for now so its basically a zillion degrees.  Some misters or more fans would be a huge plus."]], "date": "2016-08-09", "time": "15:04:28", "categories": "Nightlife, Bars", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 195, "predit_yelp_score": 3.85, "actual_yelp_score": 5.0}, {"review_id": "ReedhfYYUXUdyC6bkGvXOw", "user_id": "_3o0rkaBZrByRvrExiejRw", "business_id": "lw7nHvA2vRdid29mdCRvvg", "review": [["I attended my sister's wedding there. Very disappointing.  The woman doing the ceremony just went through the motions. There was no music to play as the bride walked down the aisle & they weren't told they needed to provide any. And Do Not pay for them to do the pictures!! Almost every one of hers has such a glare from the front door that washes out everything. You would expect that someone being paid to do them would know how to use their camera.\nThe positive reviews are about 2 years ago & something has changed since then. Do your homework & check it out before you spend the money."]], "date": "2021-04-10", "time": "21:23:28", "categories": "Wedding Chapels, Wedding Planning, Event Planning & Services, Officiants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 34, "predit_yelp_score": 1.525, "actual_yelp_score": 1.0}, {"review_id": "416vQl_8pgyVfwqlj5h1nA", "user_id": "Hm5uY4xxxoK4lPYp7taQUA", "business_id": "h8h1QvEQruTkBI50NlWsyA", "review": [["In New Orleans to pick our daughter up to return home after college sophomore year. SO many choices but easy decision where to enjoy our LAST meal...we all agreed on Vincent's! Every morsel of food is scrumptious and the service/ambience is exceptional. Always a 5-star experience. \n\nThe staff works HARD and seems genuinely focused on making sure every single guest has a 5-star experience!\n\nHubby is obsessed with chicken parm and Vincent's is delish beyond words. Daughter's favorite is the creamy crab soup in the bread bowl...ummm...YES PLEASE! I got a heavenly dish with eggplant medallions, crabmeat and shrimp, so fresh, every flavor popped. \n\nVincent's never disappoints, a New Orleans treasure :)"]], "date": "2016-05-10", "time": "14:15:30", "categories": "Restaurants, Italian", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 534, "predit_yelp_score": 4.275, "actual_yelp_score": 5.0}, {"review_id": "jwOko6T80GZvolIPqYT2Ug", "user_id": "oiXLUiDACGTV_uKeaZjiug", "business_id": "CgO-MoFaV3uTg36xzVeHXA", "review": [["So I'm a dude, and the only thing I'd actually buy at the Trashy Diva is something for my wife (who would probably move into one of the change rooms and live there if she was permitted to). I was with my wife for a few of her shopping trips, and I thought it would be fun to review the Diva from a dude's perspective.\n\nGoing into a women's clothing store is about as exciting for me as going into a gun store is for her. But, I also like it when my wife dresses in cute clothes, and I especially like it when there's helpful sales staff that actually know what they're doing (read carefully: no disaffected teenagers smacking gum and surfing on their phones). The women at the Diva were clearly into their work and knowledgeable about their merchandise, and they immediately zeroed in on a few things that would work well with my wife's look and style. This isn't my first trip to a woman's clothing store, and I appreciate the skill and talent that goes into this sort of sales(wo)manship.\n\nI enjoyed sitting outside of the change room and contributing what I could to the discussion about which dress to buy, which bolero might look cute with it, appropriate footwear (which they conveniently sell in the neighboring shoe store), and even which lingerie might look cute under it (also conveniently sold in another neighboring Diva boutique). The woman helping us struck the right balance of pleasant, funny and witty, and it goes without saying that money was dispersed and merchandise brought home.\n\nI tip my hat to the Divas; they are stylish *and* professional and know how to run a clothing store, and that deserves to be commended."]], "date": "2015-03-12", "time": "03:06:14", "categories": "Lingerie, Used, Vintage & Consignment, Accessories, Children's Clothing, Shopping, Fashion, Women's Clothing", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 47, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "9rrgsxy38QzoFcYEe0mdpA", "user_id": "iOgAMYKJFZVhaK_TxoMCwA", "business_id": "xJGT-TKhhxzUtzOA7zWDow", "review": [["Really like the merchandise in this store, they always seem to have original stuff for guys.   They even have bags and a few sale items in the back.  The problem however is that this place is ridiculously expensive even for its sale items.  You can probably find as nice and cheaper stuff either online or at one of the many shops on magazine."]], "date": "2016-03-15", "time": "23:26:25", "categories": "Shopping, Fashion, Women's Clothing, Men's Clothing, Accessories", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 8, "predit_yelp_score": 2.0, "actual_yelp_score": 3.0}, {"review_id": "It8U0EokHz88O4z22z9Diw", "user_id": "CvQl041EOD2spqtLaLScFQ", "business_id": "oBNrLz4EDhiscSlbOl8uAw", "review": [["Over the top breakfasts!  Wide menu with tasty presentations. Plan ahead as it is mighty popular. Consider using the online reservations as it can be mighty crowded. A great place!"]], "date": "2018-05-28", "time": "19:07:36", "categories": "Restaurants, American (Traditional), American (New), Cafes, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 5193, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 4.0}, {"review_id": "RLtS-9VBP3h-NRgXaj2c2w", "user_id": "zYM6lpFougeIHDfqcX3l4g", "business_id": "yE6aDcbbK8pmvNroXnQYQA", "review": [["Asked our hotel staff where we could get a nice full service breakfast close to the hotel. I did not expect what we found at this place. We ordered the CBB, which is their signature breakfast. It was fantastic! Everything is made fresh, but be prepared for the heat. The jalapeno cheese sauce is very spicy and to die for. Don't miss this little gem if you're in New Orleans!"]], "date": "2015-01-16", "time": "21:02:52", "categories": "Diners, Sandwiches, Restaurants, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 866, "predit_yelp_score": 3.85, "actual_yelp_score": 5.0}, {"review_id": "dRzN7d2NCm7_kkQzE85Btw", "user_id": "Jq7_BrstmcAhJxYjG9PVCw", "business_id": "0vi741BLMGl2QPeTXWeG2w", "review": [["This place was so bad it was comical...till they overcharged us. First we were told to sit anywhere. We did, then servers and staff did little but stare at us from the wait station. I finally asked a non uniformed person (a mature lady, possibly manager) for a cup.of coffee. 20 minutes later our server came. She really seemed like she lost a bet taking care of our table. We ordered, my husband ordered the bavarian cream waffle. Waitress seems confused and uninterested all at the same time. She came back with water, only to briefly set it in front of my, then take it away to the other near by table. Then she brought my husband a blueberry waffle. He said this is not what i ordered. She disagreed, even though we pointed to the menu item when ordering.  She didnt seem to care, later came back with what i assume was bavairan cream stuff, flung it on the table. The waffle was by now ice cold. And we got chaged and extra 2.00 on top of the 6.95 for 1 \"fancy waffle\". The waitress and the rest of the staff seemed perfectly fine with the crazy rude service..food really sub par as can tell from one order they actually bothered to get right. So many better breakfast spots, skip this bummer of a place"]], "date": "2017-12-22", "time": "17:05:42", "categories": "Sandwiches, Southern, Restaurants, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 550, "predit_yelp_score": 0.7, "actual_yelp_score": 1.0}, {"review_id": "tLZkn7NwUPpuH8mCDWIfAg", "user_id": "7mApzJypNjxf48NDiVSXTg", "business_id": "VVH6k9-ycttH3TV_lk5WfQ", "review": [["If you're craving some southern comfort food, this is the place!  Amazing fried chicken!  The mashed potatoes and white bean is pretty good too."]], "date": "2017-01-19", "time": "20:04:38", "categories": "Comfort Food, Restaurants, Southern", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 3582, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "ko4PKoGE7alrUQI0FFCAeg", "user_id": "8yd2aUneWCcjL9u_5xNO8w", "business_id": "Bt7NBqA31uOI4H_hvasLLg", "review": [["here's a hidden gem for you. super friendly, relaxed but excellent food (mostly). i have been for breakfast a few times, and throughly enjoyed it. went for lunch a few days ago, and while the Club sandwich was stellar, the BBQ shrimp po boy was really bland. both my friend and i were struck by how flavourless it was. added some siracha and it was fine, and really the rest of the place is so good, and they are soooo friendly, i'm totally willing to let this one slide and stick with the five stars.\n\ndog friendly sidewalk seating too!"]], "date": "2015-02-06", "time": "15:18:23", "categories": "Caterers, Venues & Event Spaces, Breakfast & Brunch, Gastropubs, American (New), Restaurants, Food, Event Planning & Services, Bars, Cocktail Bars, Seafood, Nightlife", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 597, "predit_yelp_score": 3.275, "actual_yelp_score": 5.0}, {"review_id": "rlJ75zbqZ_qx44xRhueT2w", "user_id": "MxBY4DEyrPOtsqXpoNuOcw", "business_id": "g04aAvgol7IW8buqSbT4xA", "review": [["This place reputation is marvelous on Yelp for a reason.  French toast here is possibly the best in the world.  Not even sure why I ordered it since I'm not big on bread but I am a fat boy and my body knew what my mind had yet to discover.  Seafood Benedict and shrimp étouffée both out of this world.  \n\n\nGemma is a Gem.  Customer service is what keep us going back for more and Gemma is a keeper."]], "date": "2021-01-15", "time": "17:58:22", "categories": "Breakfast & Brunch, Coffee & Tea, Food, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1865, "predit_yelp_score": 4.7749999999999995, "actual_yelp_score": 5.0}, {"review_id": "lh5doP7DV3GCvOzpsZsRtw", "user_id": "Q267YpN-moT4GlX9BNPvNQ", "business_id": "1S8IRBk4uIhm_KZri7VTqA", "review": [["Love this place! Food is delicious and customer service on point! I had the seafood potato with crab added."]], "date": "2020-09-30", "time": "17:21:30", "categories": "Food, Event Planning & Services, Caterers, Food Trucks, Seafood, Restaurants", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 38, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "Y87zxmfELS8LQljzuJXtDQ", "user_id": "IEVwzXbjCGST1mfu-ijeVg", "business_id": "5Jta7dTc7lteIyeMfLUJWQ", "review": [["Our first night in New Orleans and we were just looking for dinner. Popped our head in and they said they were closing in 30 minutes but they told our party of 7 to take a seat. The entire staff was fun and amazing and we had the whole place to ourselves. Everyone's meal was great from the raw and chargrilled oysters to the gumbalaya. We were so impressed that we decided to make it our last meal stop in New Orleans before we left 5 days later. Another round of great meals and wonderful a waitress who let us kill 2 hours eating and drinking before we had to head to the airport. We will definitely be back next trip."]], "date": "2021-12-30", "time": "20:38:09", "categories": "Seafood, Cajun/Creole, Restaurants", "city": "New Orleans", "state": "LA", "stars": 2.5, "business_review_count": 651, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "Kh4HmIyxxgA_OOuaTywcOQ", "user_id": "tzafO6e8PNpzudC5VVtfpQ", "business_id": "j4kYliTkKf7k-oDqVgyXYA", "review": [["Poor food and service. Was not impressed.\nThe crab claws were tough and dry. They forgot to put in my entree and side, when asked about it, they put in the entree but forgot my side. Once I received the entree the fish was not good-extremely fishy. They did finally bring me my Brussel sprouts, which were the only good thing I got."]], "date": "2014-03-20", "time": "19:32:41", "categories": "Nightlife, Restaurants, American (Traditional), Sports Bars, Bars, Burgers, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 774, "predit_yelp_score": 0.875, "actual_yelp_score": 1.0}, {"review_id": "u-_QFh4JtfrHUYqYJ9XEBw", "user_id": "aJp-5Ed5y8JMdaVbuEjg5A", "business_id": "G4kmb7lGpbER5Jd2Al2TLw", "review": [["The food was amazing but the staff seem mad sexist and rude?? My friend and I, both female, went twice during our trip (partially bc she's vegan and it was a safe choice), and the first time we went at a slow part of day and the bartender barely spoke to us. When he did he was dismissive to an almost performative degree. Then a guy walked in an sat at the bar, also a nonlocal, and he immediately started chatting and taking his order like it wasn't the biggest burden in the world. We thought maybe our experience was a fluke, and the food was so good that we didn't write it off completely.\n\nWe went back the late at night our last night of the trip. Different bartender, same flippant attitude towards us. To top it off, he kept making little comments and gestures about us to his male friend at the bar, and to his coworkers. So yeah I deeply hate this place."]], "date": "2019-06-23", "time": "05:26:48", "categories": "Shopping, Dive Bars, Art Galleries, Restaurants, Nightlife, Tapas Bars, Arts & Entertainment, Tapas/Small Plates, Bars, Cocktail Bars", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 333, "predit_yelp_score": 0.9, "actual_yelp_score": 1.0}, {"review_id": "cUQBJmStH-Z3LxGfR5K82g", "user_id": "51GIawrC8dlaFPXHlopZdA", "business_id": "VVyLNrGBx5cJaLueRaKXQQ", "review": [["LOVE LOVE LOVE Mia Bella! We were in town for a wedding this weekend, and needed hair and make up services. So glad we found Mia Bella online based on high reviews by other satisfied clients. Mia is a doll. We drank champagne and enjoyed girl talk in the beautiful, immaculate and spacious salon.  Our group (including mother of the groom) was extremely pleased with the services provided by our make up artists (Kelly did my make up) and hair stylists (Cassidy did my hair).  They totally got the natural glow \"look\" we requested.  I highly recommend Mia Bella without reservation for special occasion beauty salon needs. Thank you ladies!"]], "date": "2017-03-14", "time": "03:54:59", "categories": "Waxing, Eyelash Service, Skin Care, Hair Removal, Hair Salons, Nail Salons, Beauty & Spas", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 85, "predit_yelp_score": 4.800000000000001, "actual_yelp_score": 5.0}, {"review_id": "O_UeBYKpfEo-KUDFGKgsQQ", "user_id": "qboiBaiwCynHgNZHFBkoGw", "business_id": "N_c2SBKMc1rmTyea75ONfw", "review": [["Haven't had the pleasure of staying here yet, but ducked in off the street to ask the concierge for last-minute dinner recommendations and these folks really came through for us. Super friendly, knowledgeable, and all class all the way. Would stay here in a heartbeat."]], "date": "2013-06-23", "time": "22:58:37", "categories": "Hotels & Travel, Hotels, Event Planning & Services", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 275, "predit_yelp_score": 2.5749999999999997, "actual_yelp_score": 5.0}, {"review_id": "TpyA8pe-GEemceJUQAyiBQ", "user_id": "JPdiC4TE-oMbrGA-xWKiEA", "business_id": "OxXMZfaRZc7SJnjMBkO1ww", "review": [["It was love at first bite!!!!\n\nWhen I chomped down into the shrimp taceaux, I almost past out! It was amazing. Mainly because of that special sauce added to the taco that makes it very unique. It instantly appeals to the senses with its tangy, sweet flavor as it explodes from your taco.\n\nMy first time trying it was during a movie production school project last year. I had to pick up the food for the day and when I first saw the truck I thought, \"What is this concoction?\" But, boy when I made it back on set!\n\nPeople were all over those tacos. I knew that they would satisfy all my hunger needs and I would eat them more often. Just gotta find that truck! I haven't seen around yet! Hahaha! Can anyone help me find it?"]], "date": "2014-07-22", "time": "00:33:20", "categories": "Restaurants, Mexican, Food Trucks, Food, Food Stands, Street Vendors", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 131, "predit_yelp_score": 4.425, "actual_yelp_score": 5.0}, {"review_id": "EPMx-GiDhx1fqE0yXNWMtw", "user_id": "715aXCh9f0FkUOg8DQai5w", "business_id": "_C7QiQQc47AOEv4PE3Kong", "review": [["another place which treats single male diners with disdain. I made a reservation, arrived, and then ended up leaving after waiting far far too long in \"the bar\" where a needlessly expensive for the quality drink was served to me only after every female who arrived after me was served. \n\nThis place needs to get over its self. I saw an empty table the entire time from the bar which was still empty after I decided to leave (literally no one else was still waiting to be seated). Went to coquette instead and was instantly greeted with a warm smile and no pretense.\n\nI'm sure the food is great, but don't treat me like a second class citizen cause i'm solo"]], "date": "2010-11-16", "time": "16:50:12", "categories": "French, Restaurants, Cocktail Bars, Nightlife, American (New), Cajun/Creole, Breakfast & Brunch, American (Traditional), Bars", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 4876, "predit_yelp_score": 1.875, "actual_yelp_score": 2.0}, {"review_id": "YjK0-pfwbIWmnWoM07GzDw", "user_id": "uTsk4ZiA73P13weEkc7eQQ", "business_id": "FxyGTyC98dVsVMhPiHXyOQ", "review": [["This place was soooooo good! I had the steak and cheese biscuit and cheesy hashbrowns. It was every bit of delicious! My friendsall enjoyedtheir French toast. Definitelytry this place for breakfast. I could tell it was going to be good as the line was long when we walked and and full of locals. There's nowhere to really eat inside so u will have to take it to go. They are also available on UberEats"]], "date": "2018-07-20", "time": "21:42:10", "categories": "Desserts, Bakeries, Donuts, Food", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 240, "predit_yelp_score": 4.925, "actual_yelp_score": 5.0}, {"review_id": "jCb1jg0kFd23zgg_ddK3Ag", "user_id": "jGUdsAMkurKYZCh6l84n7w", "business_id": "nvUoCZ-m21m2yRZq5ugQhw", "review": [["I've never understood the concept of Asian Fusion until I came here but now I see. I ordered the Thai iced tea, pork belly bao, and the coconut sticky rice. The bao is a must have! The rice was a good side, but not really anything more. The Thai iced tea totally hit home- that's the closest I've ever gotten to my favorite iced tea that I get in Bangkok. The whole meal was delicious and surprisingly inexpensive for the location and atmosphere of the place. I'd definitely go back!"]], "date": "2013-12-31", "time": "17:41:53", "categories": "Cocktail Bars, Bars, Ethnic Food, Nightlife, Specialty Food, Food, Asian Fusion, Restaurants", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 84, "predit_yelp_score": 3.875, "actual_yelp_score": 4.0}, {"review_id": "J8OdAiGKy5y33khQ0sIGsQ", "user_id": "w84Uv36jWR5bZwEUUIH_2A", "business_id": "iYUwyARgC_RNPA1rTlL3-Q", "review": [["Very traditional New Orleans Po'boys. It's fat away from the French Quarter which is good, cause 95% food in the French Quarter sucks. \n\nFound it just by passing it and I always look for places to eat that is not in the tourist area. The food here is New Orleans and you taste the soul of New Orleans here.\n\nYou want real Cajun food eat here. The staff is very helpful in ordering.\n\nFood 8/10. Service 9/10."]], "date": "2014-03-16", "time": "00:01:58", "categories": "Seafood, Sandwiches, Cajun/Creole, Restaurants, Southern", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 382, "predit_yelp_score": 3.5749999999999997, "actual_yelp_score": 4.0}, {"review_id": "P_iWnPiBwocxfN1gKGnY4Q", "user_id": "rndXnFVw9HTfCyihsDTE8Q", "business_id": "Ra9zH1CBYtAC6vMfKYsHew", "review": [["The food is so good, and they do not skimp on the shrimp! Great environment, they make thier own seasoning which is SO good! Go here! You will have leftovers and be satisfied."]], "date": "2013-01-29", "time": "23:09:09", "categories": "Salad, Mexican, Bars, Nightlife, Restaurants, Cocktail Bars", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 319, "predit_yelp_score": 4.925, "actual_yelp_score": 5.0}, {"review_id": "eiD7_HIUHWZfFpruMmU75w", "user_id": "HBXO10S8-vKkEBTuhdiuDg", "business_id": "-s6EMVPCBrsocFDuiMMqxQ", "review": [["I love this place. Amazing hush puppies!!! The blueberry hill infused drink is out of the universe good. It's a do not miss"]], "date": "2017-09-30", "time": "19:13:14", "categories": "Event Planning & Services, Venues & Event Spaces, Cajun/Creole, Caterers, Cocktail Bars, Restaurants, Bars, Nightlife", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 548, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "vyK2pLJgE9azZ5cVbwcKTA", "user_id": "qVaW87Z2X1N43BJhGpExoQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["It takes for ever to get in...lines are long.\nMany other great restaurants...not woth waiting in line."]], "date": "2015-08-15", "time": "04:30:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 3.0}, {"review_id": "UZC-hR3TBylQPLLX_I8cSA", "user_id": "66hi75oEWJPHj7_pGPrBiw", "business_id": "7CRox7xpb3vNCEe7FZ6zgA", "review": [["High Hat is a really cute little eatery on Freret Street that exudes quite the opposite of High Hattedness!   Everyone was super friendly and the older southern feel was extremely welcoming.  We split lots so we could get a taste for a few different things!  \n\nWe had the oyster and fennel soup which was really interesting because it had lots of fresh vegetables and I think tasso sausage which gave it a nice smokiness.  The soup was a little thin but not every soup has to be rich and super creamy.  We also split the baby greens salad with Hollygrove heirloom tomatoes, dijon vinaigrette and crispy little onion toppers.  The vinaigrette could have used just a little more umph but those crispy little onions - so magical!  Their batter has a bit of cornmeal so the little onions were super crispy and just different!  We got the fried chicken, pimento mac and cheese and greens to split and it was 1/2 of a chicken so we took leftovers home.  I am a connoisseur of fried chicken so I can be a bit judgey.  This chicken is so delicious because it's really juicy and their batter has flecks of cornmeal which really make the texture truly satisfying.  The mac and cheese and greens were both extremely good as well!  I ordered a fresh ginger ale and it was amazing because of the perfect carbonation, zing of ginger and little lime wedge!  I love hand crafted sodas!!!\n\nThis is a comfort food serving, cozy little place with lots of windows overlooking Freret Street.  The gentleman at the door (appeared to be the owner maybe) was so nice and hospitable but at the same time buzzing around like a bee to ensure everything was perfect.  I will definitely return."]], "date": "2014-03-26", "time": "13:49:45", "categories": "Soul Food, Burgers, Nightlife, Bars, Restaurants, Southern, Seafood", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 560, "predit_yelp_score": 4.4750000000000005, "actual_yelp_score": 4.0}, {"review_id": "tLH6BWKbKYyxQiB0eSZJXQ", "user_id": "_WNvBa5lvoDkG2NuH4fD8Q", "business_id": "8929qdZy4NYkznuS-sG-0Q", "review": [["Love this nail salon, tucked away in the neighborhood. I had an appointment for 9am and they started on my at 9am. Very clean and friendly"]], "date": "2020-09-26", "time": "21:19:15", "categories": "Beauty & Spas, Nail Salons", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 41, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "j2cFH8lCxNxOdxHldGfa7Q", "user_id": "Ye-9S8f2dt41UBfy4lXffA", "business_id": "02jAPgIHC9LPqOEtdS57SQ", "review": [["Shay was amazing! She is fast, accurate and quite helpful with menu suggestions. My lunch companion and I enjoyed 5 different tapas. They were nachos, chicken, beef, veggie and shrimp. I just returned from Spain and can affirmatively say that this place is authentic! I'll dine here again...soon!"]], "date": "2011-06-21", "time": "05:07:15", "categories": "Spanish, Restaurants", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 38, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "h4HyzotAW6w3YtoZklykkQ", "user_id": "LmtoETz4Y8P64k1ljUWcnw", "business_id": "FaY_9x8ZtsuHe5wS2iJM1Q", "review": [["Who would've guessed??! This market has terrific food! I got the Cajun chicken and mac and cheese and jambalaya. All were super tasty. My husband had a cheeseburger- it was huge and he said it was really good. It did take a little while to get our food, but it was well worth the wait. There aren't any tables out front to sit at, so we walked down and ate at the river. When I was leaving the market, the cashier mentioned that they are open 24 hours a day and they deliver everything in the market... Good to know!!"]], "date": "2016-11-13", "time": "19:35:19", "categories": "Restaurants, Convenience Stores, Grocery, Sandwiches, Food, Delis, Shopping, Beer, Wine & Spirits, Tobacco Shops, Breakfast & Brunch, Salad", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1309, "predit_yelp_score": 4.825, "actual_yelp_score": 5.0}, {"review_id": "d88GW8yI8YR_sHuODoXa6Q", "user_id": "ESNAIR6fSOz0S4ZldUhUoQ", "business_id": "98aSunfD_cXI-KgxA_sJBw", "review": [["Best Gumbo in New Orleans!!! That gumbo had me going back for more... Crawfish is fresh and delicious!!! I usually go to Castnet... but Cajun Shack has gained a loyal customer!!! Every item on menu is delicious from the meat pies to the broiled seafood to the burgers.  You can't go wrong at Cajun Shack!!!!"]], "date": "2019-12-25", "time": "16:09:20", "categories": "Cajun/Creole, Sandwiches, Restaurants, Seafood, Chicken Wings", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 18, "predit_yelp_score": 4.6, "actual_yelp_score": 5.0}, {"review_id": "krZoHPPdmuy8Nknn6MxByg", "user_id": "qX4uHhBi5QJ3N6_pgVENXw", "business_id": "JlHO0nd0yXCQbiIIvJm2jQ", "review": [["Had live music, great beer selection and a gorgeous bartender."]], "date": "2020-02-20", "time": "03:52:16", "categories": "Nightlife, Dance Clubs, Burgers, Restaurants, Bars", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 151, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "-oq9kQaRgLwnYk4QFf0JPQ", "user_id": "aLUuaZnnhxFOb_cC4SWZeA", "business_id": "mAgjr6kjRqCFk8JWPvobuw", "review": [["I hit this place up after our Airbnb host suggested it as a good dance spot for a Monday night. King James and the Special Men played and killed it. I didn't actually even get a drink because I was too into the music, so I can't say anything about the bar or service. BUT, I will say that my drunk friend gave the door man a hard time about the $5 cover and he was a saint.\n\nSomeone was cooking up so finger licking good food on the tailgate of his truck outside, and everyone we encountered that night was so welcoming. Had a baller fucking time dancing my ass off. Best memory from my whole weekend."]], "date": "2017-02-08", "time": "01:44:01", "categories": "Nightlife, Bars, Dive Bars, Lounges, Arts & Entertainment, Music Venues", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 55, "predit_yelp_score": 2.575, "actual_yelp_score": 5.0}, {"review_id": "Ols4fKRdSie2JLNQH4aoUQ", "user_id": "aVssPc9pBkTddirFjITtVA", "business_id": "fbWJdBdRRpRnpN2iRGTWPg", "review": [["My son's first haircut experience here was great & he was looking forward to coming back (he was 11) but it is challenging!\nAppointments are hard to get but we always take one when offered. Never been late!!\nWhen we were desperate for last minute emergency haircut (major tournament in 3 days for traveling team & his helmet crushes his hair into his eyes), they refused!!! Even when I offered double for after or before hours appointment!\nMy son loves his haircuts here & would have been a lifelong neighborhood client, but I refuse to put up with this type of arrogant business practices! \nGood luck, guys, when your client base ages out!!"]], "date": "2019-07-02", "time": "19:21:02", "categories": "Beauty & Spas, Barbers", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 53, "predit_yelp_score": 2.1, "actual_yelp_score": 1.0}, {"review_id": "XvAIK4qkrRT7Ka9qyBSMNA", "user_id": "iqqKf6-Zmtn54JKtqkVu8w", "business_id": "oe-iacnzvyHV8zxaNqCf7A", "review": [["We dropped in here by chance and were amazed at the exceptional experience. Josh, the bartender, makes cocktails that are excellently crafted, no mixes, only fresh juices and hand made garnishes, even on French quarter staple drinks like a Bloody Mary or hurricane. Go at happy hour, 3-6 (???) $9 for a dozen of some of the best raw oysters I've had in my life, $5 for cocktails. The overall great experience, the welcoming staff, and the sense of care that goes into every drink and dish yielded a remarkable visit we would recommend to anyone."]], "date": "2019-05-18", "time": "12:28:27", "categories": "Restaurants, Breakfast & Brunch, Southern, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 718, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "jmtk0t17zodLDn5lSv_47w", "user_id": "xmQ0CSVNwkdET1h_J7R7lQ", "business_id": "ZOZ94_vjuogm6PzmuIa1FQ", "review": [["We tried it by chance: the pub-style furniture and unappealing menu had put us a bit off. Instead we ate well: two well executed dishes with clean flavors, tasty, tender, lean meats, and plenty of fresh vegetables. The service was courteous and efficient. We will be back!"]], "date": "2017-01-19", "time": "04:21:19", "categories": "Sushi Bars, Seafood, Restaurants, Vietnamese", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 172, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 4.0}, {"review_id": "-sMcp9oJoSXiFOf9VfVUFA", "user_id": "th4VGkow1_kCKrQPB6XZow", "business_id": "PUR8xK74Js5oAvsarFkHDA", "review": [["We only went in to have drinks and watch the live music. I don't have much to go on here but I can say, the place is dated! Living off the hay days for sure. We had an app, it was ok. All the food we saw around us looked like something you would get years ago. What ever meat served with a perfect scoop of starch and steamed broccoli next to that. We have better sides and plating skills at home."]], "date": "2020-02-04", "time": "15:06:08", "categories": "Nightlife, Restaurants, Arts & Entertainment, Music Venues, Jazz & Blues, Cafes, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 101, "predit_yelp_score": 3.625, "actual_yelp_score": 3.0}, {"review_id": "Fu-5QxsRz7vQqZDI_XAO3g", "user_id": "rL2hC27iA1AB9RvdLLbkNA", "business_id": "sdFJSq-EgmtplIwUamRwTQ", "review": [["They say this place closes at 1am. At 11:30 pm, we went to eat. Guy at the door says no outside drinks. So I throw mine away just inside the door, no problem. Then he says \"The kitchen is closed.\"  I asked him why he didn't tell me that before I threw my drink away. He said \"You looked like you didn't want it anymore, buy another one\" . What a jerk.\n\nMy friends and I left, there are plenty of other places to go to be mistreated in the city.\nI will never go back, I will tell everyone I know to avoid it. \n\nif you want to be abused pick anywhere else."]], "date": "2013-08-18", "time": "13:19:16", "categories": "Beer, Wine & Spirits, Burgers, Nightlife, Bars, Food, Restaurants, Sports Bars", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 446, "predit_yelp_score": 0.975, "actual_yelp_score": 1.0}, {"review_id": "HQ1HQNF50fSOOq_rbUAtGg", "user_id": "o0iicDRbRqdWQvNlUFsS4g", "business_id": "yz0KWVamNhqiZGz7XTClzg", "review": [["Great restaurant inside the W Hotel. Fabulous Happy Hour from 3-6.  Dr. Jared, our Rx mixologist, was Awesome mixing up specialty cocktails for guests, great little small bites too. They even have 25 cent martinis during lunch."]], "date": "2017-07-24", "time": "22:34:33", "categories": "Cocktail Bars, Restaurants, Nightlife, American (New), Cajun/Creole, Juice Bars & Smoothies, Bars, Food", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1649, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "sIOVa4NSD7AFtEUWEAQPCA", "user_id": "RfbE5yot-BYnxJh3lpxAhQ", "business_id": "oBNrLz4EDhiscSlbOl8uAw", "review": [["Yum!!! What a great place! Service was awesome from beginning to end! Fun menu, cool drinks! Coffee drinks, drink drinks.... oh my! Milk punch... get one! They have veggie options, super cool pancake options, stuffed French toast! I had the triple threat Benedict! Yum! Served on biscuits!! We left full and satisfied! Definitely try this place if you're hungry and in the area!!"]], "date": "2018-04-29", "time": "21:39:37", "categories": "Restaurants, American (Traditional), American (New), Cafes, Breakfast & Brunch", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 5193, "predit_yelp_score": 4.1499999999999995, "actual_yelp_score": 5.0}, {"review_id": "h7HIWWS6cXvfWSbXj8smQg", "user_id": "RzqUH_ON22FVEpDWi2YkNg", "business_id": "gTC8IQ_i8zXytWSly3Ttvg", "review": [["A bit out of the way, but worth the trip. The muffuletta is delicious of course, but so are the the other sandwiches on the menu if you want to branch out. \n\nThe bacon pralines they have on the counter are amazing... This was the day I first believed bacon and chocolate could mix."]], "date": "2016-05-08", "time": "12:58:11", "categories": "Shopping, Butcher, Restaurants, Sandwiches, Food, Meat Shops, Specialty Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 3837, "predit_yelp_score": 4.85, "actual_yelp_score": 5.0}, {"review_id": "s3sSTGSO-XjnX6UbhUqpZA", "user_id": "FpvDZvjt-XwNnPeiHO40xg", "business_id": "wDxoeFTU69uc6eN2C57EZQ", "review": [["We had a long and exhausting first day in New Orleans and we saw the menu for this place on the table at our Airbnb! We ordered The Big Cheesy and a Cajun Shrimp Pizza and they were both delicious! The Cajun has an amazing spicy kick, just the right amount! We were told an hour and they were here with the delivery in about half the time, so thankful!"]], "date": "2019-06-01", "time": "02:12:50", "categories": "Pizza, Restaurants, Food Delivery Services, Wineries, Vegetarian, American (Traditional), Nightlife, Vegan, Arts & Entertainment, Gluten-Free, Italian, Food, Bars", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 161, "predit_yelp_score": 3.75, "actual_yelp_score": 5.0}, {"review_id": "4tQRTFOrgNGtKwqVubPYZQ", "user_id": "JaVC-hHzHYbcQMVwvugsLA", "business_id": "-VlBFlHwX-Pt6Xyzs9roGw", "review": [["Superb.  If I could give more stars, I would.  Excellent seafood.  Best oysters and Crawfish ever.  Excellent service."]], "date": "2017-02-09", "time": "00:32:40", "categories": "Brasseries, Restaurants, Cajun/Creole, Seafood", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1581, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "tQNUpmUsrv9LTtqGQpG-KA", "user_id": "I6YARR1VloAua-buFULo1Q", "business_id": "n_fUROdhfmLwd_mpBi55ew", "review": [["After reading about the famed muffaletta sandwich on yelp, I just had to have one. Once we got there my fiancee and I were planning on splitting a whole sandwich but after looking at the beast we decided on the half. The person taking my order was definately a man of few words but he was pretty efficient. The sandwich was great, especially for the price and I ate and enjoyed it which is surprising since i am not a fan of olives."]], "date": "2010-12-01", "time": "23:15:06", "categories": "Delis, Sandwiches, Restaurants, Grocery, Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 1781, "predit_yelp_score": 4.95, "actual_yelp_score": 4.0}, {"review_id": "x9lyZXQAPV59hi24cfZjog", "user_id": "DK15LZEIaFUeCdXaJcjXeA", "business_id": "OM7W1kCHvhvThZrKRnA1PA", "review": [["After going back and forth on whether to book a ghost tour or not, my friend and I were so happy we did. We had a fantastic guide named Mike, who as a previous history teacher, could tell us not only a lot about the haunted houses but also a bit more on the history of New Orleans and why it's such a unique place. Nothing but nice things to say and we were extremely happy that Mike was our guide!"]], "date": "2017-06-01", "time": "23:29:26", "categories": "Historical Tours, Tours, Hotels & Travel, Walking Tours", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 340, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "G1kz6SDrr06PHMTkBhovnw", "user_id": "__l_G6pfSvVv8ZJaEkxOWQ", "business_id": "u7uFQCoHFtBKCtbWUm6yZw", "review": [["Pretty swanky place to eat dinner solo, but the Pecan crusted drum is as good as advertised  sauce was the perfect sweetness to enhance the pecans. I love going to a high profile restaurant and everything turns out well. Servers are professional."]], "date": "2015-02-05", "time": "01:14:29", "categories": "Seafood, Cajun/Creole, Restaurants, American (New)", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1608, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "DFedDNs0jEQRt8aU3tsETA", "user_id": "1_JeDgLoAcyBL87FAT4xNA", "business_id": "3fVYGQr_ldW2_1QlXJjpaQ", "review": [["Let me start by saying the service was impeccable. We were able to make a last minute group reservation with no problems. We ordered the bottomless Mimosas and Rose' and never had a problem getting a refill. Now on to the food. I ordered the Beer Battered Crab & Chorizo Beignets and Buttermilk Fried Chicken Sandwich. The beignets were awesome! The chicken sandwich left some things to be desired. The chicken breast was too small for the bun. I couldn't taste the pimento cheese or pork belly and it was borderline dry. It was supposed to come with sweet potato chips, but I somehow ended up with lukewarm fries. I would go again because based on other reviews I've seen, I have a feeling that dinner would be better."]], "date": "2018-06-18", "time": "01:44:22", "categories": "Arts & Entertainment, Southern, Cajun/Creole, Nightlife, Jazz & Blues, Bars, Breakfast & Brunch, American (Traditional), Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 510, "predit_yelp_score": 3.15, "actual_yelp_score": 3.0}, {"review_id": "gsG4TxHm3zm7uMamFxfH1A", "user_id": "t4ASjTS7N5TMnFq2866a9Q", "business_id": "HhD8DLES5ZeULKDXmfkOOg", "review": [["This is my favorite lunch restaurant.  The Voodoo shrimp was delicious.  Lynn our server made the experience fun.  Lynn was very helpful in recommending our food order.  If you get a opportunity ask for Lynn."]], "date": "2019-04-16", "time": "18:18:33", "categories": "Nightlife, Restaurants, Sports Bars, Bars, Burgers, Sandwiches, American (Traditional), Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 508, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "225FX0dcgr5ckicaECccsw", "user_id": "yOLWr8aACfrbwSqQYAN5lQ", "business_id": "5mZyR93hm7roulrRTQoeaQ", "review": [["Love. This. Store. The staff is so friendly and I find all of my favorite brands for much cheaper than usual, and they're still on trend, unlike other off-price retailers. Definitely the first store you should go to!"]], "date": "2016-12-07", "time": "20:39:44", "categories": "Shopping, Women's Clothing, Department Stores, Shoe Stores, Fashion", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 16, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "Zt9qiRFv1yrEOcig9UUP8Q", "user_id": "gTTL5NBGIjuQ-iEG2A-xgg", "business_id": "8kh6Z3c8UHQKmsy0_TbOnA", "review": [["Shame on the Esmeralda salad.\n\nThe full size salad was tiny, unfulfilling, and boring. Flavor was fine, but it was about 1 cup of quinoa with some beans and seeds sprinkled on. Literally 5 lettuce leaves around. Paid ~$13 to Leave starving.\n\nAlso, the restaurant was out of the juice i wanted and all 5 empty tables in the front area near the windows were left dirty and unbussed, leaving only the dark back alley to sit in. \n\nLooks like it could be a good place, but they failed badly on a fri at 2pm"]], "date": "2018-03-23", "time": "23:29:46", "categories": "Asian Fusion, Vegetarian, Vegan, Seafood, Restaurants, Brazilian, Latin American, Caribbean", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 1164, "predit_yelp_score": 0.575, "actual_yelp_score": 2.0}, {"review_id": "iQwg1OWb8bytpoRnqlsBBA", "user_id": "faUidWZmyn3g6W6G7gy-bA", "business_id": "75FY8ZQx5nOWP0VFmNvWfw", "review": [["One of my favourite restaurants in New Orleans.  Atchafalaya has a menu with enough creole food for people looking for a local experience, but also many other options for people who aren't.  Atchafalaya has two distinct personalities: Dinner here is a quietly impressive, elegant affair while brunch on the weekend is loud and boisterous with great music and an incomparable bloody mary bar.  Night time dining here is great for conversation where you really notice the eclectic art collection and the huge carved wooden tree on the wall.  During brunch, the music reverberates off the walls so it can be quite difficult to talk over the noise, but it's still a lot of fun.  This is a great place to take people who are visiting from out of town.  Whether I've taken people for dinner or brunch, all my visitors have been impressed and usually say it was their favourite dining experience while in NOLA.  \n\nI have had shrimp and grits more times than I can count in the South and I still think that Atchafalaya's are by far the best I've ever had.  Coquette's are good too, but don't have the depth of flavour of Atchafalaya's.  Their fried green tomatoes benefit from the addition of crab meat; this is a much more refined version than what you'll get at other places around town.  The Atchafalaya house salad was better than described, I was surprised at how good it was.  I wasn't impressed with the side order of vegetable risotto, it was a bit of a tasteless mush, not on par with the rest of the meal at all.  All of their fish dishes are excellent, I really can't think of another restaurant that has so many tasty fish options.  Although I personally don't eat red meat, my dining companions have all stated that their NY strip steak and the filet special are some of the best they've ever eaten.\n\nThis is one of the few places I've been to in NOLA where the food and the atmosphere are equally on par.  There are many beautiful old school places to eat in the French Quarter, but none of them have the exemplary food that Atchafalaya offers.  I can't recommend Atchafalaya highly enough.\n\nside note:  90 percent of the time the shrimp and grits excel, but occasionally they are inconsistent and taste a bit lackluster, I can only assume this is if the regular chef has a night off?"]], "date": "2014-08-08", "time": "16:46:25", "categories": "Seafood, Breakfast & Brunch, American (New), Bars, Southern, Restaurants, Cajun/Creole, Nightlife", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 2037, "predit_yelp_score": 3.525, "actual_yelp_score": 5.0}, {"review_id": "PBElL5TvK4rIM6CJjmMxgQ", "user_id": "P18y0k5ICH0_vbqXZjgyiA", "business_id": "ChlcxTEoWBQJXJ2Xb2vm5g", "review": [["Unmemorable is the best way to describe our evening. \n\nService- Mediocre. We were wedged in a table in the corner on the first floor and practically had to clear our table ourselves because it was hard for our waitress to reach each person. Our lead waitress didn't say too much, she didn't explain any specials without us prompting her. Little things like serving ladies first/taking orders were done out of order. Dining at this price point should have more refined service. \n\nAppetizers- Just ok\n\nMiss Hay's Stuffed Chicken Wings- Were luke warm and boring. Chicken was chewy because it was getting cold and the stuffing was bland. \n\nWood Oven Roasted Oysters- Tasted great but we were served 4 oysters in a 6 oyster dish (like a cast iron escargot dish) which seemed weird. They either forgot 2 oysters or it's poor presentation. Should be served with a few pieces of french bread for sopping up the butter sauce. \n\nEntrees- Disappointing\n\nShrimp and Grits- 2 shrimp had full peels left on them. I usually expect to peel my own shrimp for BBQ shrimp...but not shrimp and grits and not at a fancy-ish establishment. \n\nGarlic Crusted Drum- It tasted like it was breaded in \"shake and bake.\" There was too much garlic topping and my cut of fish was so bad it almost looked like chicken. It was a very thick piece and I don't think it was cooked all the way through. It had a terrible blood line through it and was inedible. A waste of $31. I would have told the wait staff but no one checked on us until my party was finished with their entrees and at that point I was just over the entire thing. \n\nWe skipped dessert since we seemed to strike out with everything else. \n\nThere are many delicious restaurants in New Orleans that I would rather support. I will definitely skip NOLA from now on."]], "date": "2017-04-10", "time": "16:40:19", "categories": "Cajun/Creole, American (New), Southern, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 2417, "predit_yelp_score": 1.425, "actual_yelp_score": 2.0}, {"review_id": "TAviu9ejz86Tcl6hKo9pzA", "user_id": "PiC5IM1DFcXfTS56wZzvLA", "business_id": "h8h1QvEQruTkBI50NlWsyA", "review": [["Vincent's on St. Charles is one of our favorite restaurants in New Orleans. The owners and staff make a point of getting to know you and always treat us great. We love to grab seats at the bar and chat with the bartenders and then eat at the bar. The food is absolutely delicious and is always consistent!  The crab and corn bisque in the bread bowl is the best in the city!  Whether you select Italian dishes or seafood or the specials, you won't be disappointed. Love the Crab & Shrimp Parma."]], "date": "2018-08-09", "time": "20:02:19", "categories": "Restaurants, Italian", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 534, "predit_yelp_score": 4.800000000000001, "actual_yelp_score": 5.0}, {"review_id": "x553VLR10k7KOTL7nIMUbA", "user_id": "fnyvOLRzcsUNhvLlbUNTxw", "business_id": "KlZvP_k_VEJV0G-6tTqnqQ", "review": [["Over amazing restaurant friendly staff and great manager !! I would stay away from the creole pasta !!! Very blend but everything else on the menu was amazing we a great flavor profile !!! Only the creole pasta was blend !!!"]], "date": "2018-06-09", "time": "01:43:43", "categories": "Cajun/Creole, Seafood, Restaurants, Southern", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 1053, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "5QzDiMUQPGpaY23nYkiXiA", "user_id": "iD8F7ozYNGA5fGx1iFNK4A", "business_id": "8UPv1p9GW-BiZtQqUt8nOA", "review": [["It was just okay. We were in town celebrating my mom's birthday and was told that we should visit the place so we went there for lunch. \n\nI was disappointed. We were seated at a dirty table and when we asked our hostess to clean it, she asked us to just move to another table. \n\nThe best part of our meal was the appetizer because it was the only thing hot and appeared to be fresh. My friend tried to order the lunch special for that day and they said they didn't have it. When asked did they run out the hostess replied \"No, it just wasn't cooked today\".\n\nIt was just okay and needed some New Orleans spice and freshness."]], "date": "2018-08-20", "time": "01:54:25", "categories": "Seafood, Cajun/Creole, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1646, "predit_yelp_score": 2.5249999999999995, "actual_yelp_score": 3.0}, {"review_id": "a_DOP3j6MMKc3EcYmpUXHA", "user_id": "z-rmDyxfxK6JF1W29uD_wg", "business_id": "vN6v8m4DO45Z4pp8yxxF_w", "review": [["This breakfast was the truth.  Some of the best shrimp and Grits I have ever eaten.  The sausage gravy lb the visits and gravy went perfectly over a beautiful home made biscuit and the vibe is awesome in the morning.\n\nPro tip... Stay off their neighbors front lawn when it is crowded, they have mystery sprinkler times and you will get wet. It seems to come on every 10-15 minutes for about 1 minute.  It's actually pretty funny to watch though."]], "date": "2015-10-12", "time": "03:32:38", "categories": "Vegetarian, Restaurants, Breakfast & Brunch, Cafes, Juice Bars & Smoothies, Sandwiches, Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 2084, "predit_yelp_score": 4.725, "actual_yelp_score": 5.0}, {"review_id": "BJPTcg9rjYpBNHM3av4VKw", "user_id": "aUYiM76cyz2q0--sQ2bJAw", "business_id": "8ydaiLMenoOGhpra3Mzo5A", "review": [["Easily the best record shop in the NOLA.\nThe prices are right and they have a great selection. Friendly staff.. cool T-shirts' and great jazz records ."]], "date": "2021-05-22", "time": "20:56:04", "categories": "Music & DVDs, Shopping, Books, Mags, Music & Video, Vinyl Records", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 84, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "0EB9FXwoNbAUcMTMiK2ffA", "user_id": "ig-NKBAtgKnyUg8BfrkOoQ", "business_id": "i01ClJeZLkKybBtxeTPEsg", "review": [["Reminds me of sleeping in a hospital.\nYou can hear every movement of everyone on your floor... and ... the kind of people that stay here most active from midnight to 3:00 a.m.\nThank God no one was throwing a party or getting laid.\nYou can't keep the fan on either to drown out the noise.\n\nWorst thing the shower's pull up to turn faucet to shower was completly broke. No bathtub drain stop either so I get to wash cup and water method. No shampoo, conditioner, or wi-fi either.\nI mentioned broken shower to front desk and they will look at it, but for my sake they don't give a SHlT.\nBest thing is I was highly motivated to get up and get the hell out of this place.\n\nI didn't give them 1 star because they made an effort to update the style of their batroom."]], "date": "2018-04-18", "time": "13:12:32", "categories": "Event Planning & Services, Hotels & Travel, Hotels", "city": "New Orleans", "state": "LA", "stars": 2.0, "business_review_count": 43, "predit_yelp_score": 1.675, "actual_yelp_score": 2.0}, {"review_id": "59UHwObL_EnBNG16re9h4A", "user_id": "gyEnR3uGYm3tzdu0-erRqQ", "business_id": "RGXb-3iUuaORNWB_nt_RcQ", "review": [["Almost everyone at our table was happy with there food but I can speak for only me, I ordered the blackened fish and asked for a side of mashed potatoes.  The fish was over cooked and the potatoes were cold... when I asked to have it redone the fish was done excellent but was maybe appropriate for a skinny lunch portion and I would avoid the potatoes.  Nothing more disappointing than going home hungry after dinner..."]], "date": "2020-03-11", "time": "01:08:54", "categories": "Cajun/Creole, Seafood, Southern, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 730, "predit_yelp_score": 3.4749999999999996, "actual_yelp_score": 1.0}, {"review_id": "5kxe_tRQ393d2ne_fxCKpw", "user_id": "t1qlsskb8-cqzU275EoIrw", "business_id": "Xo7fwCR-Qb_7zPdHdnzZgQ", "review": [["Terrible!  Room #1 no air!  Second room 2 cockroaches and left a message with front desk to remove while we were out!  They didn't do it! Costumer service people means the world!  They did get us a new room and eventually removed bugs."]], "date": "2018-07-16", "time": "21:15:15", "categories": "Event Planning & Services, Hotels, Hotels & Travel", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 112, "predit_yelp_score": 1.425, "actual_yelp_score": 1.0}, {"review_id": "6ekncblLU1uQvvRh9VoEig", "user_id": "i681jPXSid5T5CxVPC2vtg", "business_id": "VQcCL9PiNL_wkGf-uF3fjg", "review": [["Delicious food and great service. Had gator bites, shrimp, a Po boy sandwich, a salad and spinach artichoke dip. When checking in on yelp, you get a free appetizer. Everything was wonderful here. I highly recommend"]], "date": "2018-01-05", "time": "20:39:52", "categories": "American (New), Restaurants, Sandwiches, Seafood, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 5070, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "P87eObc2eF9reAPwFZw0oA", "user_id": "jXPHmKQpmwokrgmP4ag01Q", "business_id": "1aj1hnqPt3rqoB8tVRHLEA", "review": [["Elevators smelled like vomit, someone smoking dope on my floor without hotel staff addressing, valets can't pick up phone nor can the front desk.  I will never stay here again and I don't think the staff here cares that I won't when I told them.  Not to mention last night a giant cockroach greeted me in bathroom.  Terrible experience."]], "date": "2018-11-25", "time": "18:41:42", "categories": "Hotels & Travel, Hotels, Event Planning & Services", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 767, "predit_yelp_score": 0.35, "actual_yelp_score": 1.0}, {"review_id": "Fp3caRdWnuBGxL6sFnTybg", "user_id": "z5NGLcB8oNqXt-w6Fh2NoQ", "business_id": "ku8cAVBLaF_4rI-yK6gNnQ", "review": [["Ate here on Easter Sunday. \n\n2 Stars for atrocious service. Our server was non existent. It took 10 minutes for someone to greet us, or take drink orders. Finally after about a half hour we got our food order in (it was a prix fixe menu for Easter). I had to stop the waiter multiple times to ask for another drink or something of the like- instead of him checking in with us. I almost got up to ask who our server was, but the maitre d came by just in time-one of the only people who seemed to care about the customers. I could go on, but bottom line- awful service. To the point where it negatively affected my experience.  \n\nIf this were a casual, less expensive venue I wouldn't care, but this is supposed to be one of the premiere establishments in NOLA. To say the least, it didn't live up to the expectations. I may return based on the nice ambiance and great food, but there are tons of other venues that have both of these aspects-where customers are treated like they should be.\n\nIt's sad to see this NOLA staple not live up to expectations. I have yet to try Commander's Palace, but will make reservations ahead of time there next time."]], "date": "2015-04-06", "time": "14:30:52", "categories": "Cajun/Creole, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1598, "predit_yelp_score": 0.75, "actual_yelp_score": 2.0}, {"review_id": "TAxD5seezSiu2T4FRO8KWQ", "user_id": "VSKBOgA9rV2bQmUkYDuQJw", "business_id": "WO_5ViN3KaeYZaAxTSRjdg", "review": [["Not super impressed. The buns were very dry and tofu was alright. Nothing really stuck out as delicious."]], "date": "2018-08-12", "time": "19:52:57", "categories": "Restaurants, Vietnamese, Coffee & Tea, Sandwiches, Cafes, Food, Breakfast & Brunch, Soup", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 121, "predit_yelp_score": 2.15, "actual_yelp_score": 3.0}, {"review_id": "OZlcBKP6T5MtiXfj7IpkPg", "user_id": "6CFozKX_jLeGrleFQGl8-Q", "business_id": "pz9NQ_ItX1Vsy-vbSJuf_w", "review": [["Ordered delivery and was 1hr 15 min wait on a Tuesday. Pizza was lukewarm and similar to dominos. Thin crust was identical to regular crust. Delivery guy called 3 times in 2 minutes and seemed confused. Told us to meet him outside and couldn't put tip on credit card. Chicken fingers and fries were pricey and not as good as out of my freezer. Coupon said it would be automatically added with free dessert - we received no dessert. Will not be ordering again."]], "date": "2014-08-27", "time": "02:16:02", "categories": "Restaurants, Food, Gluten-Free, Sandwiches, Pizza, Food Delivery Services", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 551, "predit_yelp_score": 0.025, "actual_yelp_score": 2.0}, {"review_id": "m2fOI9UknnagE1gXayhaNg", "user_id": "aFxbgwHKEmaqRtp5ysPHYg", "business_id": "i9ahyW_GpP1nrMomY5BoFQ", "review": [["Would be 5 star if they had regular hours. Sometimes they're closed on days the website says they're open and they close for jazz fest 10 days before jazz fest starts. Very frustrating.Always call before making the drive."]], "date": "2017-04-19", "time": "15:48:13", "categories": "Food, American (Traditional), Southern, Meat Shops, Barbeque, Restaurants, Specialty Food", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 49, "predit_yelp_score": 0.0, "actual_yelp_score": 3.0}, {"review_id": "pG9OMrSN_F5KVbDxDf9fOQ", "user_id": "e5H1tqRnp7u5J_Fe1sp-Fw", "business_id": "BCc22qCuePzF3j2AVvrkxg", "review": [["Perhaps our bartender was having an off night. Compared to the other reviews we read, our experience left much to be desired. In their defense, the food was very good. The service, however, was some of the worst I've seen in this city. The bartender was curt, inattentive, and smacked a stick of gum THE ENTIRE TIME we dined. We were placed near the service well where she huffed at every ticket that printed. Once she found out we came with a living social deal, all formalities flew out the window and we were snuffed out like we didn't belong there. We tipped appropriately considering the discount of our deal and were left with a rude slam of our check on the bar. I would not recommend this place to people who are traveling or come equipped with any sort of discounted deal because obviously people like us aren't welcome."]], "date": "2015-06-11", "time": "01:28:59", "categories": "Bars, Restaurants, Steakhouses, Seafood, Nightlife", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 347, "predit_yelp_score": 0.8750000000000001, "actual_yelp_score": 2.0}, {"review_id": "2H6NVefyvwaTnxSOeF0N3Q", "user_id": "9hBeu_8e5xvvWmIQ4r6DPA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The only thing I ever get is oysters, raw and char-grilled. Anytime I get other new orleans cuisine it really doesnt stand up to high expectations. I wouldn't ever introduce their gumbo, jambalaya, red beans or po boys to  newbies or visitors as new orleans cuisine. Im sad it just isnt good :( BUT AMAZING OYSTERS!"]], "date": "2014-04-03", "time": "15:49:42", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.35, "actual_yelp_score": 4.0}, {"review_id": "KPxx0m4j6d7BMvvH6j0Rwg", "user_id": "5tA-QJBANAicg-z_NLa4ZQ", "business_id": "Bj7DL3SwmYHZYqPduAsa2w", "review": [["Ahhhhhhhh I finally got to try you and you were amazing. Before going to New Orleans Johnny's was near the top of my foodie list and ended up being my first stop in The Big Easy.\n\nI walked in the shop and could not have been more excited to sink my teeth into a soft and tasty PO-BOY. \n\nI went with the half CATfish and half Oyster po-boy. The thing was huge and splitting the massive meal was the way to go!\n\nThe bread is amazing, the sauce is delicious and the seafood is fresh and tasty. Everyone who visits New Orleans needs to make a stop at Johnny's. They know how to deliver an outstanding and wonderful PO-BOY!"]], "date": "2011-10-25", "time": "19:42:39", "categories": "Breakfast & Brunch, Restaurants, Sandwiches", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 1451, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "wDBJHklatvariko6XI3BBg", "user_id": "aKIXVGBaSaUSJ2KpLyHbqA", "business_id": "ipTF78tNJzarh0xgIBN6aw", "review": [["Stopped by. Met Jordan and he sold me on everything in the store. He's amazing and very knowledgeable. Dev was also super helpful and knowledgeable about all types of skin and products. Loved the experience"]], "date": "2018-03-27", "time": "18:25:07", "categories": "Beauty & Spas, Cosmetics & Beauty Supply, Shopping", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 51, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "6kkvlDnjXKOw86daKaMshg", "user_id": "l9F7xAegZIMP0y-FqyzvPg", "business_id": "hy-E7DdXbdgTbwphKUYW1w", "review": [["Don't waste time and money. The \"vampire\" who leads these tours is soooo long winded and boring, we weren't the only one's who skipped out after 40 minutes!"]], "date": "2011-11-10", "time": "19:05:29", "categories": "Tours, Hotels & Travel, Historical Tours, Performing Arts, Arts & Entertainment", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1287, "predit_yelp_score": 1.175, "actual_yelp_score": 1.0}, {"review_id": "FfDpRjT41fACNEZZshoDOw", "user_id": "MhfDituy-B3Rw3bYksRo8w", "business_id": "TV_WvVzoSJfVWe-utW651Q", "review": [["Erzulie's Authentic Voodoo is my favorite Voodoo Shop in New Orleans. I have been a customer for over a decade. I have experienced only positive energy and love when I enter the shop. In fact, as a tour guide to the city of New Orleans Anna has welcomed countless guest and myself in her shop. She and the staff have shared their immense knowledge on the religion with people from around the world. If you visit Erzulie's please do so in a respectful manner. It distresses me when I see drunk tourist walk into such a beautiful positive place knocking over shelves and damaged items in the shop over the years. That being said if you want positive energy in your life or for someone else this is the shop for you."]], "date": "2016-11-06", "time": "23:34:50", "categories": "Psychics, Shopping, Spiritual Shop, Local Services, Arts & Entertainment, Supernatural Readings", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 68, "predit_yelp_score": 3.75, "actual_yelp_score": 5.0}, {"review_id": "xT474f_JL3pdB_G-AK5g0Q", "user_id": "J7duvaxtVGPguXs5rlhDLg", "business_id": "6a4gLLFSgr-Q6CZXDLzBGQ", "review": [["OMG Yelpers, THANK YOU!!!!!\n\nOur hotel was 3 blocks away from the restaurant, oh boy.. we were blessed!\n\nThere are MANY great restaurants in NOLA, too many to choose from to squeeze into our short 5 days trip. We are glad that we didn't skip COCHON! \n\nWe arrived around 9PM without a reservation and were able to get seated within 10 minutes. The restaurant was crowded (it was Thursday night), we got lucky to get seated fairly quickly! Love the decor, dim lighting, modern wooden chairs, beautiful place... great for dates!\n\nWe ordered the following:\nWood Fire Oyster Roast - came in 6 pieces, it was a bit on the salty side..nothing special\nFried Alligator with Chili garlic aioli - WOW yumm!!! certainly a fan.. it has the kick of spiciness and those novice alligator eaters, this taste like popcorn chicken..yumm!\nSpicy grilled pork ribs with watermelon pickle - it is quiet spicy.. but we loveeee it!! the watermelon pickle is genius and the ribs ..fall off the bones!\nCrawfish pie - looks like an empanada that was generously stuffed with rice and crawfish.. the pie crust was flaky and crispy..very yummy \n\nWe couldn't decide on which dessert to share so we ordered both the Black Bottomed Brown Butter Banana Cream Pie, THE BEST BANANA CREAM PIE EVER!!!! and Butterscotch Pudding... the pudding was delicious BUT it wasn't that special.. we wanted a bit more texture.. wish they crumbled the some toffee for crunch.\n\nWith a couple glasses of beer.. our bill was about $70 before tip. It was not cheap.. and we were full..especially the desserts were very rich!!!\n\nThe portions were small..but it was probably bc we ordered their small plates. \n\nThe service was ok... NOT ATTENTIVE... and our waiter was a bit snotty...one star ding.. The hostess was friendly though..."]], "date": "2011-04-25", "time": "18:47:54", "categories": "Cajun/Creole, Seafood, Restaurants", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 4421, "predit_yelp_score": 3.65, "actual_yelp_score": 4.0}, {"review_id": "848CdWGVbI1TtKZMzdzaow", "user_id": "TcELMFOH03W7ob0KeCD7hg", "business_id": "Bj7DL3SwmYHZYqPduAsa2w", "review": [["A few people recommended that I came here, but I thought this was just an average sandwich. I feel like it didn't wow me in any way. I did like how to sandwich was so big I could barely finish it."]], "date": "2018-08-26", "time": "17:00:31", "categories": "Breakfast & Brunch, Restaurants, Sandwiches", "city": "New Orleans", "state": "LA", "stars": 3.5, "business_review_count": 1451, "predit_yelp_score": 0.0, "actual_yelp_score": 3.0}, {"review_id": "RnEAYSc2LMBP4I0cnchUxw", "user_id": "8vLYt37kpmkij8nqCtbN6A", "business_id": "_C7QiQQc47AOEv4PE3Kong", "review": [["If you don't mind a little latent racism with your delicious meal and excellent service, I highly recommend Commanders Palace.\nEverything was great except the bigotry we had to witness at the hostess desk when we arrived. An African American woman was turned away because she was wearing \"shorts\". Problem is, she wasn't wearing shorts. She was wearing a perfectly suitable dress according to the dress code with a short-ish skirt with, I assume, some type of short pant underneath. Truth be told, I was standing right there and couldn't actually see the \"shorts\". All I could see was a very modest dress with a high neck, long sleeves and a skirt with an asymmetrical hemline. If she had shorts on, it was to make the outfit even more modest. I was going to step in and help argue her position but her friends were doing a fine job without my help and I thought \"well, the dress code here must be very strictly enforced.\"\nHowever, when we entered the dining room we saw several old white men in short sleeves, one with what looked like a polo shirt, and lots of white women in revealing dresses with their butts and boobs hanging out. I saw a lot of of clothing I wouldn't think would pass the \"business attire\" dress code test. But, I guess it's ok to have white skin showing. Black skin apparently automatically leads to some sort of higher scrutiny. The \"no shorts\" rule seems to have been a convenient excuse to refuse service to a black woman tonight. \nThe whole experience left me, and the others in my party, with a very negative impression."]], "date": "2018-05-22", "time": "04:56:21", "categories": "French, Restaurants, Cocktail Bars, Nightlife, American (New), Cajun/Creole, Breakfast & Brunch, American (Traditional), Bars", "city": "New Orleans", "state": "LA", "stars": 4.5, "business_review_count": 4876, "predit_yelp_score": 2.3000000000000003, "actual_yelp_score": 2.0}, {"review_id": "HX34f4qX4hAretcfYRvlQA", "user_id": "4FnHugKJ6ZzRsF3UIv6p4g", "business_id": "DKtAKuOjI6vUAHhW4NR5UA", "review": [["This place has the best stuffed crab I've ever eaten! The grilled alligator bites appetizer was delicious. However, I also had a cup of the seafood gumbo; it wasn't that great. Service was okay. They have a big stage in the middle of the restaurant, so I assume they have live music often. Overall, it's a good place to eat in New Orleans."]], "date": "2015-05-22", "time": "21:59:45", "categories": "Restaurants, Seafood, Nightlife, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 1210, "predit_yelp_score": 4.0, "actual_yelp_score": 3.0}, {"review_id": "7t4QLuaPpYIN9Yc58tatVg", "user_id": "f4mbT-nxg2AJhqxB6XgnlA", "business_id": "3db1R99-mdSvx3QwryJSNQ", "review": [["The Manhattan omelette is exceptional. The bacon was cooked perfectly to our liking at both locations (the grill NOLA) and the original.  We thought the Manhattan at the Original location uptown was just a little bit better though.\n\nThe line at the uptown original location was so long that my friend went into the nail salon next door and got a color change of her nail polish! \n\nAlso, if the line is long, it is just a few steps to the bar next door for a great Bloody Mary while you wait. Its a fun place, the food is great, and its a must go if you have not been."]], "date": "2014-01-01", "time": "20:01:40", "categories": "Sandwiches, Restaurants, Breakfast & Brunch, Burgers, American (Traditional)", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 1007, "predit_yelp_score": 3.8249999999999997, "actual_yelp_score": 4.0}]