[{"review_id": "14iG0KHY6oRm_9_VyieBew", "user_id": "f7a_w5ga3dP8vaUq0ge36Q", "business_id": "-1B9pP_CrRBJYPICE5WbRA", "review": [["Excellent food and dining experience. Recommended Appetizers: Ahi-tuna dumplings, pot stickers and Thai calamari. \nEntrees: pineapple fried rice w/ chicken or shrimp. Drinks: \"Philly Love\" \nExcellent service, reasonably priced."]], "date": "2013-04-18", "time": "11:48:05", "categories": "Asian Fusion, Restaurants, American (New), Thai, Szechuan, Chinese", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 822, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "oTwedvGYXkwfMzdD3dOOnw", "user_id": "WBlAiBpB9kMG2YbO7ngYvg", "business_id": "JomDoQafikclSVVCPkWjnA", "review": [["Woke up on a Sunday craving pancakes, turkey bacon, and scrambled eggs and didn't want to cook it....so I yelped, found this place and 30 minutes I was there waiting in line to get a seat aaaaand it was worth the wait! YUMMY food, great service, and reasonable prices...this is one of my new favorite places!!!!"]], "date": "2014-08-18", "time": "20:49:23", "categories": "Diners, Restaurants, Sandwiches, Breakfast & Brunch, Vegetarian", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 301, "predit_yelp_score": 1.8749999999999998, "actual_yelp_score": 5.0}, {"review_id": "_O6T6EGdGp_PerxKIjw4gA", "user_id": "1YBZm46O3PbJPYKMMji2pw", "business_id": "vFDGCmR5iH34PdoBhTYh_A", "review": [["Nice spot to order seafood in West Philly. Solid items on the menu, including Baked Lump Crabmeat and Oyster Baton. I order both every time, and they are always well cooked. However, the delivery is really slow, usually takes 75 minutes to get to my place. However, they are open until late night, which is a big plus. I would give it a 3.5 stars."]], "date": "2015-09-15", "time": "16:37:51", "categories": "Specialty Food, Grocery, Desserts, Food, Fruits & Veggies, Restaurants, Delis, Seafood, Salad", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 50, "predit_yelp_score": 3.0, "actual_yelp_score": 3.0}, {"review_id": "hAY2W9oikNyXp9Dv4hWGyA", "user_id": "pWxSGanb2AuY9XG9WBBjOQ", "business_id": "4hv1n1VBzMvE-T4UtIcOcw", "review": [["Though a bit pricey you can't get better meat or cheese in the city. Plus their prepared foods and lunch options are always delicious too."]], "date": "2016-07-17", "time": "01:54:40", "categories": "Restaurants, Coffee & Tea, Breakfast & Brunch, American (New), Chocolatiers & Shops, Meat Shops, Italian, Seafood Markets, Fruits & Veggies, Sandwiches, Shopping, Grocery, Specialty Food, Desserts, Food, Cheese Shops", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 550, "predit_yelp_score": 1.3, "actual_yelp_score": 5.0}, {"review_id": "j4chcN4xzOuB9e2HqJA7lw", "user_id": "hhgyq_Kd8gvfeutaqYEkNQ", "business_id": "ktMvtPI3TBkTOpSf1sTXWw", "review": [["I see why people stop coming here.  One week, I can order over the telephone.  The next week, \"we're not taking telephone orders at this time.\" \n\nThen, hungry, waiting for a burrito to fill my need, I arrive.  This is about 10 minutes later.  Guess what?  They are supposed to be open.  Guess what again?  No one is behind the counter, no one is in the kitchen.   \n\nGreat job running an eatery.  Kudos."]], "date": "2016-07-07", "time": "02:10:49", "categories": "Restaurants, Tex-Mex, Italian, Food Stands, Latin American, Mexican", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 229, "predit_yelp_score": 1.775, "actual_yelp_score": 1.0}, {"review_id": "3pTMSt3Nu2ajgh1MhDyu_g", "user_id": "kN4w3VpDbyew77S4Vz3aBg", "business_id": "2f3YghoMYzd5-GFMh_kvwQ", "review": [["Ordered take out from this Del Friscos. When I arrived I was told by the hostess the bar would help me. I wait at the bar and received  no attention. I did however see my order at the end of the bar. I identified the order as mine. As I was talking to a patron at the bar about my order, one of the female bartenders, suddenly yells at me \"what am I doing\"? I told her it was my order. Identified myself. However, she continued to question why I was picking up my order. Well, because I paid for the meal. Apparently, the staff is welcome to treat customers as they see fit. I informed one of the managers, and he agreed that is not how you treat customers, but I am fairly sure nothing will come from interaction."]], "date": "2021-04-03", "time": "23:41:14", "categories": "Breakfast & Brunch, Diners, Nightlife, Restaurants, Steakhouses, Bars", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 132, "predit_yelp_score": 1.55, "actual_yelp_score": 1.0}, {"review_id": "Rmozch8JKn0qgQLO9tjvnQ", "user_id": "RtxCA96nV_36XmFWLgTxBg", "business_id": "2ZSnGlqj8JOWcN2bNf-3SQ", "review": [["I really want to like this cute seemingly charming bakery, but the staff needs to work on their service.\n\nThe layout of the store is not very intuitive. I get an attitude whenever I ask where anything is... sorry i pop my head in every now and again and don't memorize the entire store. \n\nI've only had their hot and iced teas and they were mediocre, so chances are I probably won't be coming back here unless I'm in a forgiving mood."]], "date": "2014-08-30", "time": "22:51:42", "categories": "Restaurants, Food, Cafes, Coffee & Tea, Bakeries", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 242, "predit_yelp_score": 0.825, "actual_yelp_score": 2.0}, {"review_id": "hw8NREMWH5-mOi8F8Y_m5w", "user_id": "1suvUqjKTYrsWiHvbCswlw", "business_id": "BiSdlIuOlf6MqyEZ6aWhfQ", "review": [["Con Murphy's:\nI ordered a burger with the works, which was perfectly cooked and flavorful. A+ for that. My partner ordered the chicken burger, which also looked delicious. The rotating tap selection includes interesting beer choices which I do not see featured in many other bars. \n Overall, I was pleased with my meal, until it was time to order dessert, which is why you are receiving only 3 stars. \nI adore Key Lime pie, so ordered it to take home.  At $7per slice, I was expecting a nice sized portion, and taste to be on par with the rest of my meal. I was thoroughly disappointed to receive a tiny sliver of pie, the size you might serve to a young child. It was garnished with a raspberry sauce (very odd!)  and the taste was too tart. \nI normally love the slightly tart taste balanced with sweet, but there was no real sweetness to speak of here in the pie itself. \nPlease improve on your pie portions and taste, and you will earn more stars."]], "date": "2015-08-12", "time": "16:36:04", "categories": "Restaurants, Sports Bars, Nightlife, Bars, Pubs, Irish", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 301, "predit_yelp_score": 1.8749999999999998, "actual_yelp_score": 3.0}, {"review_id": "fZRBwUF7qaMoC5Oxy1YssQ", "user_id": "VyRICVwE3VfGynw5ly2oBA", "business_id": "wDaZZM-R-DvhoWR8y8q0mg", "review": [["I recently was on a \"world tour\" for work -Philly / DC / Richmond, all in a week's time. When I booked my trip, a hotel closer to where I work was not available. I understand there was some sort of convention in town so almost every hotel was booked. I stayed in this area last time and knew it was a nice area -it is very close to the Philly airport. This was a very nice hotel -the rooms were modern and they offered a generous, free breakfast in the morning. The staff was great and there were no issues at all. I enjoyed my stay. However, just for logistics, I would prefer to stay downtown or closer to the facility where I work to avoid a long commute. This location was about 15 minutes from downtown, and maybe 40 from where I work. Still, if you want to be close to the airport, it is a good option!"]], "date": "2014-12-14", "time": "15:01:04", "categories": "Event Planning & Services, Hotels & Travel, Hotels", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 79, "predit_yelp_score": 2.375, "actual_yelp_score": 4.0}, {"review_id": "EdFMLjRVVgN-3BlVgIfBBQ", "user_id": "VVs0OoDD7ikOS5Qtme6YQQ", "business_id": "LQIoQ4ZOXFg2iCb529b_Cg", "review": [["My son loves it here. It's kept very clean and there's plenty of room for him to run around. He also really likes the merry-go-round. That's the one thing that always catches his attention when we go here. The kids playground has slides, swings, and a seasaw (sort of). He loves going on the swing and the slide. I haven't gone on the mini golf course yet, but one day I will when he's a little older.\n\nI know they also do parties here. I was looking into throwing my son's bday here, but decided elsewhere instead, but it's always an option for the parents wanting to do something special for the young ones.\n\nThe only thing that I'm not too fond of is the parking situation. It's street parking, but it's also very limited. Try to walk here if possible.\n\nOverall: If you are around the area and need a resting place while your kids play, this is it."]], "date": "2014-09-16", "time": "12:33:48", "categories": "Parks, Active Life", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 129, "predit_yelp_score": 2.225, "actual_yelp_score": 4.0}, {"review_id": "dBBZFotGLQj0HJwZZ-FDEw", "user_id": "VDzqfqKOmWYNFVXAmU7y_g", "business_id": "3LTZYgHLXHWStzLL7cFkHg", "review": [["I don't know if it is actually closed, but they totally messed up the engraving on my sister's wedding gift. I told them her initials and he wrote them down. It came back wrong and he accused me of telling him the wrong initials (the initial of my sister's first name to be exact, pretty sure I got that right)... this is also after buying many wedding gifts there. No offer to fix - only option offered was to buy another one at full price -- which I did not do. Never going there again."]], "date": "2017-07-31", "time": "04:46:13", "categories": "Home Decor, Home & Garden, Shopping, Kitchen & Bath, Local Services, Watch Repair", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 16, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "Blc3x0fUymOREtS6jhLPbA", "user_id": "j0vJZm7cqSGMx_YqScMY8w", "business_id": "GAuweBrcC_wK3a0UhZjwfA", "review": [["Delicious enchiladas! Sorry I ate one already. I couldn't resist! Nice ambience and cute decor! Drinks were on point! Can get a bit crowded!"]], "date": "2018-08-10", "time": "00:12:58", "categories": "Restaurants, Tacos, Bars, Nightlife, Mexican", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 650, "predit_yelp_score": 1.9000000000000001, "actual_yelp_score": 5.0}, {"review_id": "LN9VZTbbQgZ6l3cVHToj4A", "user_id": "hf-H9KV4rEy7qzIDor71GA", "business_id": "_LOJW0XkOpj4O348GVRDeQ", "review": [["Went in for a quick bite on my way home at 7:30 on a Saturday and the atmosphere was pretty decent.  I immediately was able to get a seat at the bar. I ordered an amstel light and a plate of gnocchi and my bill was only $15. The bartender was attentive and quickly knew the answer to a question I had about the ravioli special that effected my choice. My gnocchi was very tasty however a little more imagination could've been used on the sauce and my plate was rather small. Next time I go back I will split a pizza with someone in addition to a single dish. Overall good experience."]], "date": "2015-03-01", "time": "01:29:18", "categories": "Italian, Wine Bars, Bars, Mediterranean, Pizza, Restaurants, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 843, "predit_yelp_score": 2.5749999999999997, "actual_yelp_score": 4.0}, {"review_id": "wR0rFrhsQLUDE3CJ9JlKzQ", "user_id": "UujI7aXyEe6geSwwuxo05Q", "business_id": "RQAF6a0akMiot5lZZnMNNw", "review": [["Oh where do I start?\nCustomer service is horrible. The ladies in there are rude and condescending. The cheesesteak had zero flavor!! Literally like I was chewing on nothing. The whiz absolutely came from a can. VERY VERY disappointing place. I threw my whole cheesesteak away and walked across the street to Chubby's."]], "date": "2019-04-20", "time": "00:06:43", "categories": "Sandwiches, Delis, Restaurants, Cheesesteaks", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 2686, "predit_yelp_score": 1.075, "actual_yelp_score": 1.0}, {"review_id": "C-Hw7Ev6NQeU8N9Iwb53vg", "user_id": "WfD1hI1qWhVtg9Y1XkMITQ", "business_id": "5xlYG_4gSOC96rDBxI_NEQ", "review": [["Typically I'm not a fan of Mediterranean food, but after giving it yet another chance, I have to admit that this place is amazing. From their calimari to their lamb entrees to their Turkish coffee- I have nothing but good things to say. I must admit, that I'm not an avid yelp reviewer but it must have taken a lot out of me to write my first review. Whenever you're on South Street Philly, be sure to give this place a try!"]], "date": "2015-03-11", "time": "03:35:01", "categories": "Restaurants, Middle Eastern, Vegetarian, Turkish", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 12, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "uOJLhKuZT-hV3wijStZVgA", "user_id": "KT37kPibwSjaYODKejDNqQ", "business_id": "GROg6x3Lf-Tp3TgiTtYsoA", "review": [["I RARELY if ever complain but this pissed me off. \n\nIt is a fun place to pass time but the patrons and management was horrible. My boyfriend, sister and I went a few months ago and we were playing Dave & Buster's Down the Clown game. We noticed there were a few extra balls in a booth but didn't think anything of it and shared the fun as a team. (P.S. we saw the people move the balls there from the other booth and played as a team for 30 min or so, which management saw and did not say anything so we used that booth afterward since there wasn't anyone in the next booth and it was short on balls). Then a patron went to the next booth to play (note short on balls) so we let him know that we will pass him so balls after we finish our round - he ignored us and then proceed to play. Then got mad and accuse us of stealing and the balls and causing him to waste his point and called management. We told the manager what happened and offered to move the balls back but instead of listening he threaten to kick us out by not playing with the rules...So unsupervised kids running around, people hogging machines and etc is ok, but once a trival complaint comes he pretends he is all that..."]], "date": "2015-11-12", "time": "22:50:05", "categories": "Restaurants, Arts & Entertainment, American (Traditional), Eatertainment, Event Planning & Services, Nightlife, Arcades, Bars, Venues & Event Spaces", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 185, "predit_yelp_score": 0.44999999999999996, "actual_yelp_score": 2.0}, {"review_id": "9RZANBMzYHsJGUi1YExr-Q", "user_id": "VULwgXbU7qqutWO8cJbXfQ", "business_id": "LgAuYz5cQe3zTxuteJ4VyQ", "review": [["Wholesome meals without having to break the bank. The hummus and lettuce wraps are heavenly. They're constantly working on new dishes which is always exciting, hello less than 300 calorie cannoli!  The menu is vegan and gluten-free friendly which is a plus in my book. They are also okay with bringing your own booze. FUEL is relatively new and still working out the kinks but you got to have faith in new restaurants with strong concepts. We'll definitely be back ;)"]], "date": "2011-01-11", "time": "01:03:21", "categories": "Sandwiches, Restaurants, Cafes, Vegetarian", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 432, "predit_yelp_score": 2.6750000000000003, "actual_yelp_score": 5.0}, {"review_id": "XdZgwRPzxtAKOCIalPk1IA", "user_id": "jDqY9q6zlxtQn_R2uiDWQQ", "business_id": "MfKScMsPZfE66VQ1CsbS0A", "review": [["A while back I visited, I havent thought of this place much because I never actually ate at this location. As I'm relaxing tonight I just had a flashback from within the depths of my memories of when we waited for an hour to be told they cannot serve us because they ran out of everything except burgers - and apparently the ovens broke. They gave my friend and I a little cup of water while we were waiting. I think I still have that cup somewhere, lol."]], "date": "2019-02-09", "time": "23:40:08", "categories": "Nightlife, Tex-Mex, Bars, Restaurants, American (Traditional)", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 99, "predit_yelp_score": 1.025, "actual_yelp_score": 1.0}, {"review_id": "r1woAwoydBuV_euKmmj2EQ", "user_id": "MHtFneReddAALmcgRYTlYQ", "business_id": "Y6hYtsrbY77Gp5eRSLWblw", "review": [["I have never been too impressed with Enterprise as their quality of service is not very good but I never stopped going there every now and then if I got a good deal. But my experience with them at this location - 36 S 19th Street was horrible. My wife met with an accident and our car was in the body shop. Geico scheduled a free pick up for me from this location. They didn't have a car which was covered under the $30 insurance cap. I was forced to pick up a car for which I ended up paying a couple of hundred $$. Checked with Geico, they have an agreement with enterprise to provide basic cars and bill geico. Thought this was a 1 time thing, went their again because my car was still in the body shop for an extra week. They did the same thing and this time they were extremely rude an arrogant. I was promised that there will be car covered under Geico insurance at 2pm. I reached there at 2:15 and I was told I need to pay another couple of hundred $$ because they gave the car to some  one else. The reps at the desk were extremely arrogant and rude. Switched to Hertz, much better experience."]], "date": "2016-04-21", "time": "13:43:59", "categories": "Car Rental, Hotels & Travel", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 51, "predit_yelp_score": 0.425, "actual_yelp_score": 1.0}, {"review_id": "MI2NDjbtRepSvQVWuZT0Gw", "user_id": "0ZRTwd5xyGwo4cW1vgQJNg", "business_id": "qQO7ErS_RAN4Vs1uX0L55Q", "review": [["Was looking for a good dessert place and found this on Yelp. I was pretty impressed by the sheer number of reviews. It's located in old city.\n\nThe atmosphere felt like an old school ice cream shop.\n\nI had a bit of a tough time deciding what to get. The menu is vast and the number of flavors of ice cream is large. I also wasn't sure, if I wanted straight ice cream or a milk shake or one their desserts. They also have different types of soda here.\n\nI ended up trying two scoops, mint chocolate chip and peach. The ice cream came in a Chinese food takeout container. This was pretty unique. The ice cream tasted fresh and was of good quality. It wasn't too sweet or overbearing in flavor. I'd definitely come back next time I'm in Philly, to try some of their other desserts."]], "date": "2019-09-08", "time": "06:22:21", "categories": "Ice Cream & Frozen Yogurt, Coffee & Tea, Food, Desserts", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 2062, "predit_yelp_score": 2.0749999999999997, "actual_yelp_score": 4.0}, {"review_id": "oOI3vhXz9R32c9rgM2Yc7A", "user_id": "ssk8jw1gTdWSN_KqFvO06g", "business_id": "hsslqZAVtu093rkguSpltA", "review": [["This place was hella fun. I learned about a comedy event through the Yelp event section. I went with my sister. There's a bar inside and couple in the parade outside so pre-gaming was easy. It was ladies of comedy. The were four main acts an they all rocked. Each performance was longer and funnier than the other. The tickets are nicely priced but you required to order 2 items during the show. The cheapest option is 2 water bottles for 7$."]], "date": "2018-11-23", "time": "02:00:21", "categories": "American (New), Nightlife, Restaurants, Arts & Entertainment, Comedy Clubs, Performing Arts, Bars", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 273, "predit_yelp_score": 2.825, "actual_yelp_score": 4.0}, {"review_id": "vIM3el-GdAEYHqzMnov-7g", "user_id": "x1NswtSImNRYvXY1nfDL9g", "business_id": "n-Ff-FPW-9lQfBRTPxNeCA", "review": [["Nice shmoody rainy type day, felt a crave for some comfort food the Vietnamese way. Me and the homie decided to try a new spot and so she got #72- broken rice pork chop combo, and I got the Pho combo. Size is very acceptable because I had leftovers. The broth was definitely what I needed, super flavorful and delicious, I was disappointed with the one piece of beef tendon I found in the soup, but it was well worth the trip. Will def be back to try their other dishes."]], "date": "2021-06-24", "time": "17:08:25", "categories": "Restaurants, Vietnamese, Soup", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 71, "predit_yelp_score": 1.3750000000000002, "actual_yelp_score": 4.0}, {"review_id": "xtqR5kkBcPvuqxO_civyrw", "user_id": "_hOihtuF_oIYxMkFRYvOFQ", "business_id": "QXGnmsKYANxOyZBqM-zlJA", "review": [["Walked in with 5 friends on a busy Friday evening.   Let me just say they were on it!   We were seated at a bar high top while waiting for our table.  The waitress was super attentive with drinks and apps while we waited.  The manager made sure we were taken care of. Food and entertainment was excellent!   Will be back!"]], "date": "2018-03-18", "time": "15:46:52", "categories": "Nightlife, Irish, Restaurants, Bars, Gastropubs, Pubs", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 454, "predit_yelp_score": 2.4, "actual_yelp_score": 5.0}, {"review_id": "mBMxu6EZ1x01z65Kh_gIbA", "user_id": "2PNFGmiSL0lQEc-38usrzw", "business_id": "mzTTdvQGkUHZ8ii7OnZC5w", "review": [["Oh, my GOD! They sell KUMQUATS! And ORANGINA!"]], "date": "2012-03-14", "time": "15:52:34", "categories": "Beer, Wine & Spirits, Shopping, Grocery, Florists, Food, Flowers & Gifts, Specialty Food", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 494, "predit_yelp_score": 4.750000000000001, "actual_yelp_score": 5.0}, {"review_id": "Cm-OsqI84-TgGnvktiyglw", "user_id": "VmIu0lkV1nZB08duROIKog", "business_id": "brtpHEdo2n0fGJO-yMBCYg", "review": [["After hitting a deer in the city I went to a few collision shops and was really freaked out by the high estimates. Maaco was the last shop I decided to try. I called ahead of time as they were closing in 20 mins. The owner Jerry met us outside and immediately gave us a very fair and reasonable estimate....2-5 thousand below the other estimates! Jerry is very kind and really eased my anxieties about the car, it looked worse than what it was. They did an amazing job and you cannot tell it was damaged at all! This shop is now my go to place and I will be recommending this shop to friends and family."]], "date": "2019-08-19", "time": "16:01:21", "categories": "Auto Detailing, Automotive, Body Shops, Auto Repair", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 7, "predit_yelp_score": 1.675, "actual_yelp_score": 5.0}, {"review_id": "-qBd5QAdn6shvIK9lIR_NQ", "user_id": "KmjtPWZXldfrg_83vUW9JA", "business_id": "8CbJAKgVEALPbYcQTzhkvA", "review": [["I love this place. Amazing liquor and wine selection. Super friendly service and LOVE the Quizzo night. Just great food, really nice staff, and a good time.. Sorry I'm not writing more.. I just don't fancy myself an amateur critic or aspiring writer.. So I don't feel the need to waste my time writing some long banal review."]], "date": "2009-11-12", "time": "10:01:28", "categories": "Nightlife, Wine Bars, Bars, Italian, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 80, "predit_yelp_score": 1.5, "actual_yelp_score": 5.0}, {"review_id": "w__jSivxNBZgE69v5PtL1Q", "user_id": "0yqxd7TcSy40GvpRG3t6CA", "business_id": "K2svtoFXk68mFIIwLjG36g", "review": [["The food is good, albeit pricey. But never order online, literally every time i order, whether through their website or grubhub, it's always always wrong. Very annoying when you're trying to get something quick and easy for lunch during a work day."]], "date": "2016-09-08", "time": "17:37:54", "categories": "Soup, Restaurants, Breakfast & Brunch, Sandwiches", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 94, "predit_yelp_score": 0.5750000000000001, "actual_yelp_score": 2.0}, {"review_id": "9dM9gH18LQ82yUvsWBlfTQ", "user_id": "FyMwJiM5s-Jd2Qzaqrfgog", "business_id": "fEqiXG_B-fn__w0aeF3nBQ", "review": [["Was treated there for a dinner for my birthday and loved it.\nWe had a tasting menu with about 7 different dishes, there was nothing bad in the meal but some of the dishes were outstanding. I would come back again when they have a new menu, definitely a great experience."]], "date": "2015-07-07", "time": "13:12:06", "categories": "French, American (New), Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 326, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "XTKc7KpSoXj2vqDYJaCwtA", "user_id": "Dk7Eo7qTYBC7T_ktHBZYcg", "business_id": "WJnWJ91JQd1Vfe2Z65uj7g", "review": [["Made an appointment the day before and was greeted and welcomed at the door. The girls there are so friendly. I asked for a light pink/purple short coffin shape for a wedding. Kim did an amazing job I can't wait to go back again... feels good to find a good one! She shaped them so perfectly and they are the perfect length and thickness. Seriously did an awesome job. They charged 50 bucks for this full set with gel. I think that's fair for this work."]], "date": "2021-05-12", "time": "23:35:46", "categories": "Beauty & Spas, Nail Salons", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 91, "predit_yelp_score": 2.625, "actual_yelp_score": 5.0}, {"review_id": "32bNEbujyppVYJo1nozk9w", "user_id": "kevzZpfAJ0zobNOnsziqvw", "business_id": "UyTx6ci7ATsWco_mE4J8Jw", "review": [["These cupcakes might be too good.  I don't think I'll be able to eat anything but pamcakes ever again and I'm certain I'll never go to Brown Betty again.\n\nI just joined yelp so that I could rate the two cupcakes I had today (too good to have just 1).  I had a red velvet and peanut butter cup.  Both were amazing; they were moist and had just perfect flavor.  I can't imagine a better cupcake."]], "date": "2011-05-25", "time": "18:47:28", "categories": "Cupcakes, Food, Bakeries", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 142, "predit_yelp_score": 2.375, "actual_yelp_score": 5.0}, {"review_id": "UJl7w1YTLaPRYefxASCg5w", "user_id": "gr1yzWoqwGC5FW66_NaCOQ", "business_id": "woTZpX92uByUgliPrh39Mg", "review": [["Very good but very pricey and everybody was very nice Our waitress was amazing to the bartender service waiting for a table would  go again"]], "date": "2021-10-07", "time": "02:40:10", "categories": "Cocktail Bars, American (New), Bars, Restaurants, Steakhouses, Seafood, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 513, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "_QR_MWNn5B0Qjc2_tdcetw", "user_id": "1dbhrvfdWcpeZMcNCje7jA", "business_id": "iaBU5h_j0TCrUFzTbjFIlw", "review": [["Legs, arms and bikini - 1st laser treatment was April 13th.  I'm a dark haired gal who has(had) to shave every day.  It is now May 8th and I am just feeling the slightest growth when I feel my shin.  Looking forward to my next treatment in two weeks and really looking forward to never, ever shaving again! It doesn't tickle, but it is worth the slight discomfort."]], "date": "2012-05-08", "time": "20:44:06", "categories": "Skin Care, Medical Spas, Laser Hair Removal, Hair Removal, Beauty & Spas, Health & Medical", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 151, "predit_yelp_score": 1.25, "actual_yelp_score": 5.0}, {"review_id": "5Md2Rs7Hvi0KnPkrPXwRwA", "user_id": "ItNR1CxsYcyiMDENM-eYqA", "business_id": "ZCj5o6j6_0JjGOe04WoLsg", "review": [["We liked it here! We came during happy hour and had the bao bun, chicken wings, and papaya salad for $3 each. We also go the half banh mi and pho combo. Overall we liked everything but the bao bun with pork was my favorite.  The chicken was double fried and crispy and the sauce had kind of a vinegary flavor and tasty. The pho tasted like it was a vegetable broth but I am not positive."]], "date": "2017-08-18", "time": "14:40:25", "categories": "Nightlife, Vietnamese, Bars, Beer Bar, Restaurants, Cocktail Bars, Food, Beer, Wine & Spirits", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 253, "predit_yelp_score": 2.175, "actual_yelp_score": 4.0}, {"review_id": "oI9gC4Ap8xIvzTl50qtnuw", "user_id": "EQMe-c5I3lm7-xH9W1lzPw", "business_id": "fYtJnehmqvxXFmRsPsny_Q", "review": [["Paul and his team built us a custom media unit and we could not possibly be more thrilled. When we first met with Paul he was attentive, thoughtful, and worked hard to learn about our preferences and style. Paul kept us in the loop throughout the entire process. We had heard great things about PTC so we had reasonably high expectations, but the actual media unit turned out even better than we anticipated. We genuinely cannot wait to order our next piece of furniture."]], "date": "2020-11-30", "time": "19:14:59", "categories": "Shopping, Local Services, Furniture Stores, Interior Design, Home Services, Furniture Repair, Home & Garden, Furniture Assembly, Carpenters", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 26, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "m8MynR0CHyNwilYo6xInmw", "user_id": "hNRhGrIIbUf00CYZ1bSxvw", "business_id": "bAqDJlYqB9j3tMVjhp29EQ", "review": [["Fresh and bursting with flavor, Mezze's wraps and sandwiches have never disappointed.  The veggie lasagna explodes with ricotta cheese and fresh spinach.  The grilled salmon wrap is not to be missed -- but be sure to get there early because Mezze always sells out of the salmon wraps by the middle of the lunch rush.\n\nYes, the prices here are steep, even by touristy Reading Terminal Market standards ($8.95 for a slice of lasagna), but you're getting great flavor and healthy fare (or so I like to think).  Mezze is my go-to place almost every time I dine at the Market.  I bet it will be yours, too."]], "date": "2011-06-17", "time": "14:43:42", "categories": "Mediterranean, Food, Grocery, Greek, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 25, "predit_yelp_score": 2.925, "actual_yelp_score": 4.0}, {"review_id": "YdGLS6FKdn_7pns6RnU4pQ", "user_id": "2yQ5T7iJ9A3N7vkLwy81JQ", "business_id": "Mz2ojdB5s1xW_tILMLXEDg", "review": [["Best authentic Chinese food been coming here for years and this is by far one\nOf the beta fine dining places for dinner with family or friends !! The best steak and pepper and. Onions on hot plate and best salt and pepper squid and scallops !! Everything is delicious here a must go when in Philly !!"]], "date": "2019-09-21", "time": "02:58:27", "categories": "Restaurants, Chinese, Seafood", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 174, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "iirDRZbo6IcWABUFQaPsQw", "user_id": "6gecNWKuulvoSTWuLta63w", "business_id": "ct1bBoZ6GdCFkpp3w0NhKw", "review": [["Do not use this service!!!!!!! I have three pet male rats and Liberty Pet sitting set me up with a someone to watch them while I was on Christmas vacation. When I returned one of my male rats had turned into a female! I have been calling and texting the pet sitting service for days with no answer! I have no idea who this rat belongs to and if she is pregnant or not. This is very unprofessional and I am sad one of my pets is missing. If something happens to someone's pet you should just tell them, instead of trying to pass off a new pet for the old one!"]], "date": "2014-01-07", "time": "17:32:57", "categories": "Dog Walkers, Pet Services, Pet Sitting, Pets", "city": "Philadelphia", "state": "PA", "stars": 1.0, "business_review_count": 9, "predit_yelp_score": 0.35000000000000003, "actual_yelp_score": 1.0}, {"review_id": "9NibzdTe6cw6pNmU2HNmew", "user_id": "jK_SY5ciS1IL82Cf3Ed1_w", "business_id": "4tU9hlfzrCpcGWTIm-OKVA", "review": [["The staff are lovely and the food is quite good but just know that the pandemic eating sitaution is not ideal. I had to take a table directly under the menu display outside, so I was subject to everyone basically getting right up against my table and leaning over to read it.\n\nThat being said, the meal itself was quite good. Pricey but reflected in the quality. I had the chicken sandwich sans avacado which was a delight, and the cauliflower appetizer which I could have had ten more plates of. The deviled eggs were less successfuly; wasn't a fan of the consistency of the yolk mix.\n\nStill, all in all a nice meal for $43.20."]], "date": "2020-09-04", "time": "00:38:12", "categories": "Breakfast & Brunch, Lounges, Restaurants, Food, Burgers, American (Traditional), Asian Fusion, American (New), Tapas Bars, French, Bars, Beer, Wine & Spirits, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 495, "predit_yelp_score": 1.3750000000000002, "actual_yelp_score": 4.0}, {"review_id": "ug-mbtAbA63jwSAcYyqb7Q", "user_id": "d3i582wefTonNg8DB9WKqA", "business_id": "9mA9qYqiv4c0T9ASid3PIQ", "review": [["Due to lack of things to do, I've really dug deep to finish these drafts of venues that aren't just in another city from the past, but also places that don't even exist anymore...Capital Grille is in the former in this case.\n\nI was only here once, a spur of the moment visit where I wasn't in proper dress code, but they were kind to let me in. I was with a few other girls, and come to think of it, none of us were properly dressed (I was covered decently at least but I cannot say the same for the other people I was with).* \n \nSince I was still in my chicken phase, I remember ordering that dish (whatever it was at the time) as the girls loaded up on martini's and steaks. Back in this day, we girls still ate meat. They lied to the server about me by telling them it was my birthday (it sure wasn't) and they brought me a slice of key lime pie (which I don't eat but to be in the spirit, took a few bites and let them finish it off).\n\nBesides that, the service to us was great, the men sitting around us were cordial as they can be to females who invaded their domain, and I don't have any complaints. \n\n*This is the kind of visit you have when you go with a bunch of strippers from Delilah's."]], "date": "2020-05-29", "time": "20:53:54", "categories": "Seafood, Restaurants, Wine Bars, American (Traditional), Italian, Steakhouses, Bars, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 634, "predit_yelp_score": 1.375, "actual_yelp_score": 3.0}, {"review_id": "Y29BW0H0MxsVAkClmHbMWA", "user_id": "C8YOser4MCSfRREiCMviWw", "business_id": "yNsMcSaJUpmo-R2PwK-GUw", "review": [["So sad to learn this place closed. It was run by the nicest man with the most affordable prices in the city. \nDefinitely my favorite place to float and feel comfortable."]], "date": "2018-10-23", "time": "17:58:13", "categories": "Health & Medical, Float Spa, Beauty & Spas, Health Retreats, Medical Spas, Hotels & Travel", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 20, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 5.0}, {"review_id": "4cf6MG91kdZV8bPC68PPZQ", "user_id": "3IE_zldKyg3Paeufa6IhSA", "business_id": "hPYVTbf3Gh4S5qpowJbyyA", "review": [["Everyone I interacted with at Rocco's was a pleasure. When dropping off, I had my four-month old daughter with me and they allowed me to pull right into the garage and offered to park the car for me once I unloaded, which was totally above and beyond. They also offered to fix the scratches on the other side of my car for only an hours worth of labor (as I was there through someone else's insurance policy), which I was so happy to hear! The team also finished my car ahead of what was originally estimated. Last, but definitely not least, Maria is an absolute sweetheart who made sure I was taken care of. Honestly, her charisma and demeanor makes you feel like you've known her forever. If I (unfortunately) need additional work ever done again on my car, I would only come to Rocco's."]], "date": "2021-07-23", "time": "23:19:41", "categories": "Automotive, Auto Glass Services, Auto Repair, Body Shops, Towing", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 16, "predit_yelp_score": 2.0500000000000003, "actual_yelp_score": 5.0}, {"review_id": "7rtvYHbORnV8QFre3PQrig", "user_id": "-TSOueTfF-CVakbd6Xcilw", "business_id": "BIGwAJH7CIvwHu-9Rog9cw", "review": [["I had a groupon and went here with a friend for the first time on Sat. We went kinda early, about 5ish, and the place was pretty sparse but service was great. Enjoyed the decor and atmosphere. I really enjoyed the food as they had several options instead of the normal \"veggie burger\" for vegetarians, like myself, which is much appreciated."]], "date": "2012-02-06", "time": "15:38:32", "categories": "Dive Bars, Nightlife, Restaurants, American (New), American (Traditional), Bars, Sports Bars, Vegan", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 197, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "-4PxUGhiv88oMst8Mo1dZQ", "user_id": "FlXBpK_YZxLo27jcMdII1w", "business_id": "UfNta35H6m-z2xN9XFI77g", "review": [["House of Thai is a solid dinner option in Northeast Philly, where they are sadly few and far between.  I ordered. A chicken curry dish with pineapple that was delicious. My dining companion ordered pad thai which looked delicious. I will definitely have to try that next time. \nThe prices were great, the food was good, service was good, and it's a BYOB. Yes I will most definitely be back."]], "date": "2013-08-18", "time": "20:53:50", "categories": "Restaurants, Thai", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 266, "predit_yelp_score": 1.875, "actual_yelp_score": 4.0}, {"review_id": "VxXWyIgx1E0lZKax7Fcrqg", "user_id": "egoo52jqz_d471EFC06Xsw", "business_id": "eFB8nsciED7EupYVyAnTyA", "review": [["I used Uber eats, so I can't say anything about the atmosphere or service.\n\nI ordered Pulled pork sandwich with wedges and coleslaw, and a side of beans. The pulled pork was delish. Unfortunately I didn't get to eat it as a sandwich because my bread was a soggy mess, even though I asked for the roll on the side. I'm guessing they don't care at all to read the comments/requests. Wedges were delish as well, super crunchy, and they give you a lot. Coleslaw left a lot to be desired. \n\nNow on to the beans. Let me just say that I love beans, in any shape or form and I eat beans almost everyday. I've had bbq beans, I've made them, I love them. These beans though, smh. They tasted like someone emptied bottles of bbq sauce in a pot, threw in the beans and onions, let them simmer, reduce, and accidentally burnt them. That then ends up a salty, burnt tasting thick, concentrated bbq sauce, with beans. Apparently they use sausage in there too, I didn't get any.\n\nAll in all the food's great, well if you get the pulled pork sandwich and wedges.......And if they read your comments, so your bread isn't a soggy, mushy mess."]], "date": "2017-07-21", "time": "20:54:20", "categories": "Restaurants, Barbeque", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 182, "predit_yelp_score": 1.55, "actual_yelp_score": 3.0}, {"review_id": "n8wOL-6YocXb6I3xUrONuw", "user_id": "zVMyH0dm78YNADi6pCGFzA", "business_id": "BPBTCvmUfRnEH6yyABzOzA", "review": [["Amazing beers and amazing atmosphere. They have a lot of different beers to try, all great! Definitely a brewery to check out!"]], "date": "2020-07-29", "time": "12:57:03", "categories": "Restaurants, Nightlife, Beer Gardens, Gastropubs, Food, Breweries", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 283, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "JFtwKLyi9wzKpWMOUuPG3w", "user_id": "OFmLSPrSzI_2E10CwM9mLA", "business_id": "Ri6-mK1e2-IjQAWBtZ7-qQ", "review": [["Best pizza growing up, best pizza place still. \nAsk for the old way or a pizzaz with hots. Love them!\nEverything on their menu is wonderful. Clean, polite family owned"]], "date": "2020-11-12", "time": "01:04:40", "categories": "Pizza, Caterers, Event Planning & Services, Restaurants, Sandwiches", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 86, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "qB8VijZMy1sr2m7SaDWklQ", "user_id": "ODU5vlt_r299tWAXtnfO9g", "business_id": "410SzJMr27T3wUusKW890A", "review": [["I had Jill as my stylist and could not recommend her more. I asked for a darker brown balayage and was SO happy with the result. She did exactly what I asked for and was so pleasant. I can't recommend her enough! \n\nThe salon is very large and open so I felt safe and everyone was following covid precautions."]], "date": "2021-04-06", "time": "22:47:59", "categories": "Hair Salons, Beauty & Spas, Massage, Hair Stylists, Hair Extensions", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 122, "predit_yelp_score": 1.575, "actual_yelp_score": 5.0}, {"review_id": "vRSYyyEhJsGpPMKXjih9fg", "user_id": "6YAPZtzvMCAtqc6RIBKC2Q", "business_id": "lIgEQlXldrdW5uw_ceVsOg", "review": [["My husband and I recently had Sunday breakfast here. My husband had the Nutella stuffed french toast which he says was delicious! It had fresh bananas inside and was a nice healthy portion. I had a fritatta which was just the right size, not too big, not too small, however, it hardly had any of the stuffings in it which was broccoli rabe, fresh mozzarella and potatoes. Even though it was  very tasty, it was a little skimpy on the add ins. Unfortunately they do not serve toast or anything with their breakfast so I was served just eggs which was odd considering all the \"hip\" places in South Philly serve all kinds of fancy toast, homemade biscuits, bagels, etc. A nice thick piece of whole grain, seeded toast or a small bicuit would have left me with a much more satisfied feeling. The service was great! Would definitely try this place again, maybe for lunch or dinner."]], "date": "2012-03-19", "time": "23:08:30", "categories": "Breakfast & Brunch, Pizza, Italian, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 180, "predit_yelp_score": 2.0500000000000003, "actual_yelp_score": 3.0}, {"review_id": "-bJ9wyVPMR42cxydOAZeRA", "user_id": "jm6zCII7rtT6y04csSUUfw", "business_id": "bAqDJlYqB9j3tMVjhp29EQ", "review": [["They have some great sandwhichs on display and there whole booth is a glass display case. there pizza on the other hand is just ok. I would recommend trying the breakfast pizza. The rice is pretty dry but there do manage to make some pretty tender cuts if meat"]], "date": "2010-01-25", "time": "14:12:23", "categories": "Mediterranean, Food, Grocery, Greek, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 25, "predit_yelp_score": 2.7750000000000004, "actual_yelp_score": 3.0}, {"review_id": "ltD76xqygD1AqMhaolsRug", "user_id": "aFyEZ0Iv8ZaNHNULMPgOsw", "business_id": "Tozj3jTcnclmQKlNViY7SA", "review": [["I tried Volver for the first time for dinner during Restaurant Week.  I was excited because their menu looked really good.  The restaurant is essentially inside the Kimmel Center, and I heard they also usually have prixe fix meals before Kimmel Center shows.  The inside is very pretty, fancy, and dark.  It definitely has a classy atmosphere.  \n\nOverall, I enjoyed the food, but a big part of their food is also their presentation.  The dishes were plated beautifully!  The portions are not huge, but perfect for a three course meal.  You won't be overstuffed afterwards, but you also shouldn't be hungry.  I ordered the Milk and Cereal, the Hanger Steak, and the Panna Cotta.  The milk and cereal was really cool, like a soup, and came out in a cute little cereal box glass that the waitress pours into the bowl for you.  The hanger steak was absolutely delicious, cooked well and probably my favorite dish of the night.  The panna cotta was interesting, very fruity and had a strong black sesame flavor.  It was cool to try and plated beautifully, but I probably wouldn't order it again."]], "date": "2019-01-17", "time": "17:38:07", "categories": "Tapas/Small Plates, Diners, Bars, Restaurants, Nightlife, American (New)", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 155, "predit_yelp_score": 2.475, "actual_yelp_score": 4.0}, {"review_id": "DufbsqH9VFLWEIuCH3pwHg", "user_id": "61FNJUiDqXReViksOYiILQ", "business_id": "Qm8pSLYuVS7eIyOx5YsWBw", "review": [["Drinks Only Review (for now)...\n\nI might have been aimlessly wandering the city this past weekend.  Actually, truth be told, I was in fact wandering old city this past weekend.  I could argue if it was indeed aimlessly, but we can debate that later.\n\nAfter checking out an event around Penns Landing that didn't quite live up to expectations, I passed Glory en route to a bus which might get me home.  They had a cute sign outside encouraging visitors to post about their experienced for a chance at fame. Maybe it was the cute sign that drew me in.  More likely, it was my desire for a drink that got me to pop in.\n\nOnce inside, I went straight to the bar.  They have a great beer selection: local, seasonal, domestic, and international.  36 on tap!  For those like me missing Eulogy, Glory is a excellent substitute.\n\nI grabbed myself a delicious 'Carton of Milk' and was happy with the price. The place was clean and service friendly.  Unfortunately, I didn't stick around too long this trip and as such can't comment on much else yet.\n\nI see myself coming back.  That trip will be intentional.  If anyone cares to debate if my previous trip was aimlessly, I'd recommend we meet over drinks at Glory!"]], "date": "2018-09-05", "time": "15:47:34", "categories": "American (New), Local Flavor, Bars, Restaurants, Gastropubs, Nightlife, Beer Bar, Sandwiches", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 203, "predit_yelp_score": 2.075, "actual_yelp_score": 5.0}, {"review_id": "21qzFG_oCv7sfbsA_Wd-5g", "user_id": "ySpW8abkeLkqIdkeMz4Yjg", "business_id": "6ajnOk0GcY9xbb5Ocaw8Gw", "review": [["Food, service, and ambience at this restaurant was awesome! Ordered the beer of the night which was only $3 after a certain time (10:30 I believe) which was awesome. Along with the beer we ordered the burger which was one of the best I had ever eaten, pasta which was pretty average in size and taste, and the octopus salad which was decent as well. Place was clean and the food was above average so I would come here again."]], "date": "2015-12-15", "time": "02:04:38", "categories": "Mediterranean, Restaurants, Pizza, Italian", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 2893, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "KjsP33-2x03uPaPhq16krw", "user_id": "JxEMhujdTF-313z-u0hjGw", "business_id": "ctHjyadbDQAtUFfkcAFEHw", "review": [["Worth they hype!!! My friend and I secured a last minute spot off the waitlist at the bar and we had such a lovely experience here. Just FYI, bring a photo of your vax card!\n\nWe were well taken care of by our waiter, and every dish was explained in detail. Our favorites included the halloumi, fish, and of course, the lamb was the star of the show. Everything was delicious and despite being stuffed at the end, we still had boxes of food to take home (which turned into two days worth of leftovers for me).\n\nA lovely experience and well worth the difficulty of getting a table!"]], "date": "2021-10-23", "time": "03:01:00", "categories": "Nightlife, Bars, Food, Ethnic Food, Middle Eastern, Vegetarian, Specialty Food, Israeli, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 3065, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 5.0}, {"review_id": "0zlI5K2VC1i8nVUsG1DQ_g", "user_id": "ninQYRqgTxEc26PL5EFyxA", "business_id": "73y1jLNyTy1A0XcSvyCYBA", "review": [["I have been planning to get laser hair removal since months but always scared from pain and burns. I started my sessions in this place (Satori) in February. By the second session I noticed the difference. I have finished 3 sessions for legs & arms, 4 brazillian & 4 underarms. I have a smoother skin, almost 95% hair free, pores are smaller almost vanished in some areas, and my ingrown hair is completely gone.  I am extremely satisfied with the results, the service, and my provider Akiko. They great monthly offers. HIGHLY RECOMMENDED."]], "date": "2018-06-24", "time": "20:16:42", "categories": "Beauty & Spas, Skin Care, Hair Removal, Laser Hair Removal, Health & Medical, Medical Spas", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 104, "predit_yelp_score": 1.9, "actual_yelp_score": 5.0}, {"review_id": "NvjpXgsoH8ybScJug7OdsA", "user_id": "BxwYzC0_wbJHqhp679-GOw", "business_id": "KutdYfcmNCM1qggUg2QYeg", "review": [["For what it is, this place does it well. You can get eggettes (gai dan jai - little balls of cake), zongzi (sweet rice wrapped in banana leaves), rice cakes, and for Chinese New Year, nian gao. Most of the stuff seems to be priced from $1-3. The staff is friendly and has given me a few tasty free samples. While nothing here is particularly healthy, the name \"Yummy Yummy House\" is a pretty good descriptor. This place specializes in sweets, but sells things you normally wouldn't find at a Chinese bakery."]], "date": "2010-02-22", "time": "05:58:32", "categories": "Food, Chinese, Desserts, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 147, "predit_yelp_score": 2.175, "actual_yelp_score": 5.0}, {"review_id": "81LbkTPhmPd0UtG4lr6nlA", "user_id": "dy7c9_IUCXxyugjRmBhBxg", "business_id": "wPi7p5fZyGTOjDU28IlTqA", "review": [["I love this place. I stayed in Philly for a few weeks. It's the only place I kept going back. There new remodel is fantastic. There's 3 clubs in one. The food is well worth the cash to. What a good vibe. Check it out."]], "date": "2012-05-04", "time": "04:09:07", "categories": "Restaurants, Bars, American (Traditional), Gay Bars, Dance Clubs, Nightlife, Pubs", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 325, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "E3A8sEvazOcd_bBtqB4YVw", "user_id": "lqfFu_sVupsN8r8Kz0BDqw", "business_id": "hFW2yaGTHtZc6bbyP0lZdQ", "review": [["Great wings! The fries are probably my favorite part lol. I've been here often and have never been dissapointed. My favorite wings are the lemon honey mustard, hot, and mango habanero. The catfish is also great and always tastes fresh. Good takeout choice for those nights you don't feel like cooking."]], "date": "2017-11-21", "time": "21:42:42", "categories": "Chicken Wings, Restaurants, American (Traditional)", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 18, "predit_yelp_score": 2.575, "actual_yelp_score": 5.0}, {"review_id": "v3VxG7-dxDtKiLGwY6OgTg", "user_id": "2GBadeu84JSeBB_DupsA6Q", "business_id": "JPfe9B-RLrE5Nz75kcKImQ", "review": [["I'm always greeted immediately by the most pleasant cashier. The food is fresh, fast and the portion size is perfect. I highly recommend the \"chicken\" cheesesteak ."]], "date": "2015-05-29", "time": "23:26:17", "categories": "Vegan, Cheesesteaks, Restaurants, Vegetarian, Sandwiches", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 476, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "scsB3n7JB_emtKw7UnNbvw", "user_id": "VAlVeOERnx4RVRzh4JfOPg", "business_id": "WWbrvdfiqWsNaNu0N9Qe2Q", "review": [["Absolutely incredible job! From the first interaction to the last, the professionalism is top notch. The cleaning job itself left me speechless, my entire apartment is sparkling. Everything was cleaned so meticulously and organized with such attention to detail. Nothing was left un-dusted or un-swept. I cannot recommend Perfect Choice Cleaning Services enough!!"]], "date": "2021-12-10", "time": "00:53:19", "categories": "Home Services, Office Cleaning, Shopping, Professional Services, Home Cleaning, Home & Garden", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 37, "predit_yelp_score": 2.4000000000000004, "actual_yelp_score": 5.0}, {"review_id": "LXuBseSUixoyFaTLKSxvFw", "user_id": "KXuIfkteRh1clnljH6KdUg", "business_id": "n5TNfoXg1i8wX5R3iY4WUA", "review": [["So sorry this closed. Cinder Fries were amazing. Can't run a business on fries, though. Happily waiting for Blush to appear."]], "date": "2019-03-30", "time": "16:34:50", "categories": "Beer, Wine & Spirits, Beer Bar, Pizza, Restaurants, Italian, Nightlife, Bars, Salad, Food, Breakfast & Brunch", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 157, "predit_yelp_score": 1.675, "actual_yelp_score": 5.0}, {"review_id": "fRuTQRr1VtgDP_6F6psiKQ", "user_id": "PcpKOk7uFBcg6jqnz5S6hg", "business_id": "tG_o4LxKqdo6tJGFyS-Qig", "review": [["I've been going here for years literally every two weeks because I love the pampering! Jane the manager is a sweetheart and always made me feel so welcomed. Maria was my go to but she left and I was saddened because she did such a good job and I tend to stick with the same person. I'm picky but I request Monica every chance I get. She does a great job and is a very caring person, this is by far the best nail salon i've been too in Philadelphia!"]], "date": "2018-10-23", "time": "02:38:40", "categories": "Hair Removal, Waxing, Beauty & Spas, Nail Salons, Massage, Day Spas", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 276, "predit_yelp_score": 1.975, "actual_yelp_score": 5.0}, {"review_id": "F6qR__NV1ruBPFe-MMGS8g", "user_id": "YDAxis1kAjbwBrcR8Zd1vw", "business_id": "Sey5Zgrg9BU0CwdYTJ7CmA", "review": [["This is, hands down, one of the worst gyms I have ever been to. The cardio machines seem \"modern\" and \"brand new\" at first glance, but upon first usage I came to find out that half of the machines were not functional. That, unfortunately, was not the worst of issues with this gym. In fact, the billing company is something that everyone should be aware of.\n\nIntoxx uses ASF Billing Company (based out of Colorado) and they are the most corrupt and incompetent group of individuals  I have had the misfortune of dealing with. After moving from Philly and back to my current home (in NY) I tried to end my contract of $20 a month. ASF said they needed proof of an address change in order to do so. I provided them with my former house's new lease (showing that I was no longer a tenant) and my current bank's account summary with my name and new address on it, but this was not acceptable for them. According to ASF it was not an agreeable form of identification as stated in my contract. They then told me I had outstanding fees still due but was never notified until today. In fact, had I not called in regards to my contract cancellation I would have still accrued charges without further notification. They claimed to have emailed and called me over the phone, but they never did from the very beginning.\n\nAvoid this place at all costs as they are nothing more than a sad collaboration of swindlers and crooks."]], "date": "2011-09-19", "time": "18:56:33", "categories": "Gyms, Trainers, Active Life, Fitness & Instruction", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 35, "predit_yelp_score": 0.2, "actual_yelp_score": 1.0}, {"review_id": "gcKpqni5UXM9ghBeZYDMtA", "user_id": "qO1cqMA92muAQh0FHNib8g", "business_id": "1yJPs54BqmU46nqI1Htuhw", "review": [["Had a maternity massage this weekend at Body Restoration. It was very enjoyable! I thought the spa was very clean, and worth the cost. My only complaint was that getting on and off the table w/o help at 37 weeks pregnant is not easy! No assistance was offered and I was truly worried about falling after the massage.  The pillows you are propped up on are very comfy, but again climbing off of them while covered with sheets is very scary!  I wondered if the masseuse had ever been pregnant."]], "date": "2013-03-06", "time": "01:30:21", "categories": "Beauty & Spas, Skin Care, Massage, Waxing, Massage Therapy, Day Spas, Hair Removal, Health & Medical", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 175, "predit_yelp_score": 1.125, "actual_yelp_score": 4.0}, {"review_id": "7JtdyMaIC8dLGUZleRyUbA", "user_id": "lgRg0XQ8cdDgNvJ7aTXBCw", "business_id": "sEf8VsIbhGwSnKte1IBm-Q", "review": [["My sisters and I, along with our respective husbands hit this place the morning after Christmas. There was about a 15 minute wait, and we browsed the menus during that time.\n\nLocation-wise, it wasn't very hard to find, as long as you knew what you were looking for (the sign for the place in the lobby of an condo building). C.E.'s parking lot could seriously use some more spaces; since there weren't any free spots, and we didn't want to risk getting towed in the complex's lot, we parked on the street, right in front. No biggie.\n\nThe food was very fresh, and we all loved it. I got the \"Special Pizza\" (chicken, scallions, cheddar, and ranch on a thin, crispy crust). The others in our group got the Eggs Benny (didn't try), Shirred Eggs (had a bite of this, and it was seasoned perfectly!), Breakfast Pizza (my brother-in-law didn't like that it had homefries on it, and I think it ruined the overall taste too), and the Croque Madame (the French Toast portion of it was amazing, though I didn't care for the rest of the sandwich). \n\nI saw families with kids there, but they were pretty well-behaved, so I'm not sure whether to recommend this for kids, in general. We all went sans-offspring, and were better off that way. :)\n\nOverall, I would go there again, probably on a weekday and try more of their menu, especially their paninis.  Happy eating!"]], "date": "2010-01-04", "time": "23:54:25", "categories": "American (New), Breakfast & Brunch, Sandwiches, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 205, "predit_yelp_score": 2.1, "actual_yelp_score": 3.0}, {"review_id": "gw7rqAo8OICjethvueYwIQ", "user_id": "psUH_4AQo682NVzDueuyQA", "business_id": "QMHd6Z2djm_SBLzGhLvFqw", "review": [["It was one of my worst experiences in a hotel. The room was over 200 dollars a night and had a king size bed and a really uncomfortable \"full\" size sofa. We were told the room was good for 4 people. Needles to say I slept at the edge of a king size bed that I shared with my husband and son. Actually I didn't sleep too much. Breakfast is not included and overpriced. I paid over $7 for coffee and a bowl of oats."]], "date": "2016-05-15", "time": "14:34:50", "categories": "Event Planning & Services, Hotels & Travel, Hotels, Venues & Event Spaces", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 59, "predit_yelp_score": 0.8500000000000001, "actual_yelp_score": 1.0}, {"review_id": "Rqd1H3s3Eq-Bgd8918ie3A", "user_id": "vIhhToQztfyTn09gLcSqXQ", "business_id": "Ntv3JRLGSFoOo4mr82U2NA", "review": [["The only reason I gave it one star is because the receptionists were pretty nice. I only went to Visionworks because my insurance company covered more towards the exam and lenses. My first visit there I saw Palmieri. My first impression of him was that he was not very welcoming. He checked my eyes and prescribed a prescription for my glasses which I picked up 2 weeks later.  I tried them for 2 days, but I got a instant headache and my vision was very blurry, so I called back and scheduled an appointment with another optometrist because I thought if \"Mr Charming\" couldn't get in right maybe his colleague could. She tried a few different lenses but couldn't get it right either. I was about ready to give up and pay out of pocket elsewhere. However, I decided to give them a 3rd try since my insurance had already been billed and made another appointment. I wasn't aware that it was scheduled with \"Mr. Charming\" again. During my visit, he kept making the comment \"as we get older our eyes get worse\" Okay, I understand that, but are you penalizing me because I'm older. How would you treat a senior? He made that comment about 6 times and kept trying different lenses, is 1 better than 2 or is A better than B. So, I said, A is better than B but it's still blurry and he made that comment again, well as we get older....I said \"isn't that why we get glasses so we can see\" and his comment was, \"I can't fix your eyes.\" I had enough. I told him to give me my glasses I'm done. Told him he was rude and walked out. I would rather pay out of pocket and go elsewhere rather then ever step foot in a Visionworks again."]], "date": "2017-06-16", "time": "21:29:08", "categories": "Optometrists, Health & Medical, Eyewear & Opticians, Shopping", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 17, "predit_yelp_score": 0.8, "actual_yelp_score": 1.0}, {"review_id": "74sx2xQ4Mb9Fg_W5KOR-EA", "user_id": "sahMIcG9gvlGWeboRw6Raw", "business_id": "EzjysPg2-lVX1E0ibStUXw", "review": [["Have ordered delivery multiple times as it's quite far from my place. \n\nPrompt deliveries. Around 45mins - 1 hour within 2 mile radius.\n\nFood is pretty good. Most dishes have appropriate spice level. \n\nAppetizers and entrees have  good portions. \n\nRice that comes along the entrees is of cheap quality. Somehow they use different rice for entrees' sides and biryani as biryani rice is quite good. So biryani is a yes yes.\n\nCOSTLY. Just a couple of things and u might see the bill to be more than $25\n\nOrder when you in mood for fancy, closest to authentic Indian food."]], "date": "2016-07-08", "time": "20:21:58", "categories": "Restaurants, Pakistani, Indian", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 436, "predit_yelp_score": 2.4, "actual_yelp_score": 4.0}, {"review_id": "vnmAg_ArkEvVXIwmFDMkYg", "user_id": "yVy3fdt7RyFqUKqP6CP64w", "business_id": "vhDWGF-8BfsxvS7Zo5Wv2w", "review": [["Amazing food, we had dinner here on New Years Eve, waitress was attentive. We had Duck and four other courses, each one of them was delicious. Bacon cream is to die for."]], "date": "2016-01-10", "time": "23:29:32", "categories": "Beer, Wine & Spirits, Nightlife, Food, Beer Bar, Bars, Restaurants, Modern European", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 640, "predit_yelp_score": 2.6500000000000004, "actual_yelp_score": 5.0}, {"review_id": "kOvbUmY5RXY3yhCI5HEVSQ", "user_id": "ZCVEZmTB_StK-UXA3WPVlQ", "business_id": "5Qz7TJFXhm8Mjc8xzoSV5Q", "review": [["They have redecorated - and it really needed it. The tacky fountain that took up the entire foyer is gone and replaced with some chairs for waiting customers to sit. The floors have been replaced by a darker wood giving the place a more sophisticated look. With new matching dark wood tables in the dining area and removal of the bright yellow table cloths the face-lift gives a nice warm feel to the room. \n\nThe salad bar has changed its options and now a few less \"authentic\" items. But it is still not very veggie friendly with most of the items still containing meat of some form or cheese. (Why a vegetarian would come here expecting options for them is beyond me.) The beans with the porky bits is now just just straight black beans. The addition of the mashed potatoes was a good thing though, it compliments the slabs of meat well. \n\nThe cuts of meats you will get are random but they seem to be happy to bring you a requested cut. That said the meats seemed under-seasoned this time which was a real disappointment. But don't expect the level of service you would get at the higher end Churrasco places downtown. We were the only people in the place for an early dinner and were all but ignored by the staff who wanted to watch the Brazillian channel on the flat screen rather than wait on customers. We were never brought a check and just had to walk up to the register and wait for someone to figure out we wanted to pay before leaving. Also the prices have gone up but you will still only pay half of what you would at Fogo or Chima."]], "date": "2009-03-20", "time": "14:09:27", "categories": "Buffets, Steakhouses, Barbeque, Brazilian, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 236, "predit_yelp_score": 1.225, "actual_yelp_score": 3.0}, {"review_id": "-ziauJklz5a8TDvFK_XbVw", "user_id": "Vf3xGir0lDSlaWSYWcGV2A", "business_id": "gwxNttwUgmOn3vsHYe0pDQ", "review": [["Definitely not a bad place, but one of the cashiers is just so unwelcoming and has made me feel uncomfortable for asking a simple question. Also for a place who seems so ecologically friendly you would think that they would have a refill price. Pretty pricey for what you're getting."]], "date": "2016-03-24", "time": "04:47:54", "categories": "Restaurants, Coffee & Tea, Gluten-Free, Food, Bagels", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 390, "predit_yelp_score": 0.05, "actual_yelp_score": 3.0}, {"review_id": "aGxUZtRTty-Ea8QhSgWmGQ", "user_id": "ZjTzwlXBbg6-I4vtXTLHHQ", "business_id": "vt_esoDw6HG5ClM12OPkMg", "review": [["I love the concept of this place. What a great way to spend your time, sipping a hot drink and eating fresh made-to-order waffles. =)\n\nWhen I arrived here, it was pretty quiet on a weekday morning. Menu looked promising too. A wide selection of coffees and hot drinks and belgain waffles that you can customize with different flavors and fruits. \n\nI ordered milk with honey and a belgian waffle with stawberries. Bf ordered a cafe latte (the barista recommended it) and a waffle with chcolate and bananas. \n\nWhile we sipped our drinks (the drinks were yummy!) we watched them make the waffles (very fresh), and I was really excited to try it.  When I finally did...it was ok....I couldn't taste the strawberries in the waffle, even though it had been mixed into the batter. Maybe the fruit was too mild. But all I tasted was dough. The sugar crystals mixed inside was a bit too sweet for me. I could have done without it, because the waffle batter had a good amount of sweetness in it too. My bf's waffle tasted a bit better. The chocolate taste was prominent but you couldn't taste too much banana. Waffle size was also a bit small, could have been a little bit bigger for the price ($2.95 for a waffle plus en extra 60 cents for each add-in).\n\nOverall, not bad. Maybe if I ever come by again...I can ask them to customize the waffle a bit (i.e no sugar crystals). It is a lovely concept though, I wish we had more Wafflerie establishments in California!"]], "date": "2011-10-07", "time": "16:33:50", "categories": "Coffee & Tea, Restaurants, Breakfast & Brunch, Food, Ice Cream & Frozen Yogurt", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 115, "predit_yelp_score": 2.05, "actual_yelp_score": 3.0}, {"review_id": "K6v0kik2zYY79tWi_RsZMg", "user_id": "9fieYahDV0b72_usul2IrA", "business_id": "B_Kk8Nq9NqfvwFrN8uOR9w", "review": [["Joe was quick and did an effective job no bugs entering really since he sprayed. 5-stars"]], "date": "2017-06-27", "time": "22:51:41", "categories": "Local Services, Home Inspectors, Pest Control, Home Cleaning, Professional Services, Home Services", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 231, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "oMx8GHducFlo9b1uQjSIpg", "user_id": "ET8n-r7glWYqZhuR6GcdNw", "business_id": "YNzyPt4RdhDGUDlwxFtTQQ", "review": [["I hit Zavino last night for a quick meal before heading to an event in the neighborhood. It was surprising to see such a crowded restaurant early in the evening on a rainy Tuesday. Some of that could probably be chalked up to the awesome happy hour, which featured several wine, beer and food selections. \n\nWe passed on the drinks and stuck with non-boozy bevvies. To start, we ordered a grilled shrimp and avocado salad which was a special. It was served warm with cannellini beans and was absolutely delish. They should really make that a regular on the menu. \n\nWhen we first walked in, a server walked by with a delicious-looking plate of pasta, so I had my heart set on ordering the same dish (fettuccine with pork ragu and parmesan). The homemade pasta was great. The sauce was flavorful though maybe a little heavy on some of the herbs. And I also came across a bone which was unfortunate. I also had a slice of the polpettini pizza which was really nice. I haven't had pizza from Zavino since they first opened their Midtown location, but I've clearly been missing out. Can't wait for my next visit, where I will undoubtedly partake in the happy hour!"]], "date": "2014-05-28", "time": "15:31:30", "categories": "Bars, Tapas/Small Plates, Nightlife, Italian, Restaurants, Wine Bars, Pizza", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 314, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 4.0}, {"review_id": "48XLY4UJo1ghlV-sQ34s6A", "user_id": "Mo1DN1grB0oZZaf1625AxA", "business_id": "d974XBCRIZwoYbUrY2Rd3w", "review": [["Wild mushroom and cactus tacos - full of grease!  Flavor ok, but so oily you can't eat them.  Strawberry habanero guac very goid, but flour chips thick and distracting.  Pass on eating here - too many other nearby places to try."]], "date": "2016-04-23", "time": "00:04:46", "categories": "Mexican, Restaurants, Tacos", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 179, "predit_yelp_score": 1.35, "actual_yelp_score": 2.0}, {"review_id": "6GrQ0tRL_Zuwmgp2mTJ1Fg", "user_id": "Rti3GfyQrK8xVsR2Dv3rig", "business_id": "cPDX2Y4H0fks-Qj5tfBduA", "review": [["Great tarts!!!! They make them daily and they are always fresh I love the coconut cream tart (only sold on weekends)!! It's a very small shop and prices are reasonable for the quality of goods!! Will definitely be back!"]], "date": "2014-06-05", "time": "02:56:49", "categories": "Desserts, Bakeries, Food, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 181, "predit_yelp_score": 2.55, "actual_yelp_score": 4.0}, {"review_id": "eTKoGKQh_HFsemsJw2IEtw", "user_id": "HuNH8ts6G5Ogajrr0yMUvw", "business_id": "URZBu9dOuRYzpNZ1P0hhwg", "review": [["Painted interior of my house and did a great job. Super nice guy well dressed professional and he gives a fair price. Super clean paint lines and does a great job of protecting flooring with tarps plus plastic. I would highly recommend pinnacle house painters for any projects around Philly."]], "date": "2016-04-18", "time": "18:23:46", "categories": "Home Services, Decks & Railing, Drywall Installation & Repair, Painters", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 10, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "1cgtSTcwT_u-XTQywg9duw", "user_id": "pVgl2V9Oa6f1y3O3-JTr0w", "business_id": "Wkjt6DUTGX1zKpX0OnsvcQ", "review": [["I hate giving Korean restaurants over-ratings, but for the fact that it's in walking distance of my friend's apartment on Rittenhouse, it gains a star.  So technically, it's a 3-star Korean Restaurant.\n\nAlthough my preference is for real charcoal, dirty floors, and tin top tables with a bunch of ajumma's forcing food down your throat, for what it is, Miga is a good alternative to \"authentic\" Korean food.\n\nApparently open only for the past few months, it's BYOB until next week (according to our waiter).  We ordered two orders of galbi at $22 bucks an order  (horrifyingly close to NYC prices, but reasonable for the quantity provided), kimchi chigae (non-Korean dinner companion's request), and was provided a hae-mul (seafood) pajun (service!  woot woot!).  The galbi was cooked on an infrared electric stove top (with a charcoal log for flavor in the base - so we were told).  To be fair, it was surprisingly effective in grilling the meat - as I feared it might boil/steam as tends to be the case on electric stove tops.  A secondary plus with the electric grill was that it created far less smoke than a true charcoal or gas contraption.  This is obviously necessary at Miga, as they do not have the individual table vents.\n\nThe kimchi chigae had no teeth, but flavor-wise was passable.  It whiffed of that \"we're serving non-Koreans who might die from the spice\" flavor, but then again, it's kimchi chigae, hard to f*&^ that up.\n\nThe pajun was also passable - doesn't evoke thoughts of grandma's pancakes with a tin kettle of makoli, but then again, you're in the heart of Center City.\n\nBanchan was intriguingly varied and plentiful; always a key component of a good authentic Korean joint.  They even offered Ggae-jjang (spicy raw crab); but the offering was petite, to be kind.\n\nAs already indicated, it's a 3-Star Korean restaurant in Center City.  The quality of meat and quantity (two orders + some stew = good enough for 3 people), plus location earns it (fairly or not) an extra star."]], "date": "2009-09-21", "time": "15:51:08", "categories": "Restaurants, Korean", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 179, "predit_yelp_score": 1.6750000000000003, "actual_yelp_score": 4.0}, {"review_id": "5vDN41-jCpls_RM7g0v7Tw", "user_id": "d7TKkDf_TJyitv6vHyhnqA", "business_id": "rLpW8LAQSM9ReTl5YAQLDg", "review": [["This is a great vet in a convenient location with extended hours. We have been bringing our two kitties there for checkups and other issues since they opened. Each time the staff members have been super helpful and the vet has provided the treatment or advice we needed."]], "date": "2015-11-16", "time": "07:33:30", "categories": "Pet Services, Veterinarians, Pets, Pet Groomers", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 24, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "PSQVQiWO21N0d0D8K1pT1Q", "user_id": "8TisELa1KpEybV2oYhNykA", "business_id": "OhbQMaBVv5TSJh5CdWpwiA", "review": [["I made a Yelp account just to write this review. I had an emergency related to my senior thesis art show and I needed custom mats for photographs on extremely short notice. The guys at American Picture Framing were incredibly nice and helpful, and they got all my mats done in less than a day. They also helped me carry a bunch of heavy boxes of frames, even though I'd bought the frames elsewhere, and they kindly helped me wrap them up with string so they'd be easier to carry. This is the kind of mom-and-pop place where you can just tell that they are experienced craftsmen who take pride in their work and care about their customers. My only possible complaint is that the prices seemed a bit expensive, but then I have never bought frames or mats before so I guess I don't have anything else to compare them to.\n\nOverall, a great little place with the nicest staff you could imagine!"]], "date": "2014-05-01", "time": "22:45:55", "categories": "Framing, Arts & Crafts, Shopping", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 7, "predit_yelp_score": 1.8, "actual_yelp_score": 5.0}, {"review_id": "2hMXZ-uYowmEHTKs17470A", "user_id": "4_OVSuZ8N8gqyHQjV7W8Bg", "business_id": "ADe114o7Z4vb1O6HkM6YEA", "review": [["I went here with a coworker for lunch, and this place was packed and busy with local students and hospital workers- always a good sign. The food is hot, fresh, and reasonably-priced. They have a nice selection of typical American lunch fare (burgers, hoagies, etc.) and Greek food (gyros, spanakopita, souvlaki, etc.)- and a large number of veg options for a Greek place. Lots of feta was seen on all plates headed for tables- another good sign. \n\nThere were many workers behind the counter, and they were all working very hard, but they simply couldn't keep up with the volume. My friend ordered spanakopita and fries, which should have been fast. We waited for 20 minutes for the takeout order. It may have been longer, but my coworker started to ask the staff questions. \n\nThe food is excellent. Portions are very generous. I would strongly suggest going early, calling ahead to get takeout, or ordering delivery."]], "date": "2015-08-27", "time": "17:04:16", "categories": "Greek, Fast Food, Restaurants, Breakfast & Brunch, Mediterranean, Salad", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 461, "predit_yelp_score": 2.375, "actual_yelp_score": 4.0}, {"review_id": "9z3QwivlGENnJQiWnTs7iQ", "user_id": "2--3--v8yHU3a3FljCcBRg", "business_id": "jBwfTPuxHgyAhsfTUONXdA", "review": [["Gotta give it up for Euphoria.  This place is probably the most affordable spot in the Piazza, has free wifi, friendly servers, and of course has those adorable pocket sandwiches.  I love em!  They're like freshly-made Hot Pockets, but without the frozen centers and soggy crusts.  Definitely try the bulgogi pocket and the chicken marinara pocket.  I will be back for the egg and sausage breakfast pocket too.  They also have combos where you can get huge smoothies with a pocket for around 6 bucks.  Not bad at all.  Pocket!!\n\npocketpocketpocketpocket."]], "date": "2010-10-12", "time": "02:52:03", "categories": "Coffee & Tea, Juice Bars & Smoothies, Food", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 86, "predit_yelp_score": 2.4499999999999997, "actual_yelp_score": 5.0}, {"review_id": "0fojNWmfm17uR_VMW4tn5A", "user_id": "370Zxmz1OCNl9cxvEp8qKQ", "business_id": "L4kfcADLCU4T33i7Z0CkuA", "review": [["Had a fantastic dinner here on Saturday. I enjoyed a delicious salad and veal dish. Prices were high but I thought the quality matched them."]], "date": "2015-12-07", "time": "23:36:06", "categories": "Restaurants, Bars, Wine Bars, Mediterranean, Italian, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 546, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "mt1HxQGW5ZYyEUx_XpKW-Q", "user_id": "HBLDsdGpWd13cnu6hoeR5w", "business_id": "sb8-TzsXOV7IsErbpHZo3g", "review": [["Came here for dinner on a week night. It can be kinda confusing to find this place, you have to go upstairs outside to get to the actual restaurant. The restaurant was pretty busy at 6 PM on a weeknight, so I would guess you definitely need a reservation here. The decor of the restaurant is very unique, the patterns are a little busy, but it is definitely memorable. The restaurant is very spacious and open. We were seated and ordered drinks right away (not alcoholic ones). For an appetizer, we ordered the arancini. The arancini was just ok, I have had much better arancini at other restaurants, so I probably wouldn't order that again. Even though this is an Italian restaurant, they sadly didn't give complimentary bread for the table. So we put in an order for some. I assume they charged us for it, but I forgot to check the receipt and see how much. For my entree, I ordered the seafood gnocchi which was amazing! The gnocchi was delicious and cooked perfectly. The seafood was octopus, shrimp and mussels and it had a good amount in it. I ate every last bite. My dining companions were also satisfied with their meals. Service was good without being overly intrusive, which I appreciate  when I'm not in a hurry. Prices I didn't think were bad for the city. Parking also isn't as insane here as it is in say Rittenhouse, we're able to get a metered street parking spot. I would eat here again."]], "date": "2021-05-27", "time": "02:47:59", "categories": "Breakfast & Brunch, Lounges, Seafood, Bars, Nightlife, Restaurants, Italian, Tapas Bars", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 689, "predit_yelp_score": 1.6249999999999998, "actual_yelp_score": 4.0}, {"review_id": "4nnp-nKhK3B9GHbEvjyCAw", "user_id": "w6RFOQf3tL2v6q93NYmSdQ", "business_id": "jHVotJhyPKOLuO7MVnmbtQ", "review": [["Royal Tavern has a rep of having one of the best burgers in Philly, and though I haven't tried every burger in town, RT didn't disappoint.  The burger came with excellent, perfectly seasoned and textured fries, and unlike most places that serve you 1lb of fries, they nailed  the perfect amount. I think this was the first time I finished my meal and all of my fries. \n\nOne of the stranger things on the menu is the Chicken Frankie. I've never seen that anywhere in Philly, so I had to order it. My family is from Mumbai, so I'm quite familiar with the dish, and I can say this is not a frankie. (In my experience, a frankie is chunks of spicy, slightly tangy meat, wrapped up with chilies, onions, and chutney inside an egg-washed chapati.) Their version is shredded chicken in a stereotypical Indian curry, served with some slaw in a wrap. Don't get me wrong, it was good, but it certainly wasn't anything I consider a traditional frankie, and I'm not sure it belongs on a bar menu.\n\nTheir draft list, though well chosen could stand some expansion.  I think they have a total of 6 taps, which I don't really consider acceptable."]], "date": "2012-12-10", "time": "20:36:00", "categories": "Vegan, Vegetarian, Sandwiches, American (New), Wine Bars, Cocktail Bars, Nightlife, Bars, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 669, "predit_yelp_score": 2.1, "actual_yelp_score": 4.0}, {"review_id": "e9W546FhyLSVKVmYykDZqA", "user_id": "_WDTga3IXfIZUfMhdZmiLg", "business_id": "LEwyF97d5SS_V4kLwSMu3A", "review": [["Food: my husband and I split the mushroom tacos, fish tacos, and pulled pork tacos. Each comes with 2 tacos. The mushroom tacos were our favorite (the goat cheese on top was amazing). The pork tacos were a close runner up. The tacos were great and would get them all again. \n\nSides: the guacamole was average but there was a good amount for the price. The cheese and chips were my favorite out of the 2 and cheap.\n\nService: the service was scattered and disorganized, but to their credit they did seat 5 tables at once when we got there. We had wine so the wait wasn't horrible."]], "date": "2013-11-14", "time": "02:20:31", "categories": "Food, Restaurants, Mexican", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 39, "predit_yelp_score": 1.7500000000000002, "actual_yelp_score": 4.0}, {"review_id": "UrOikd0H3-rCccQl022exQ", "user_id": "ZMl12B8M1BGhoKI886VJ5A", "business_id": "zU5PPd9j4bYC_MepNSEDcA", "review": [["I was fortunate enough to attend a private event here and was treated to some of the best dim sum in the city. To start off, the look of the restaurant is fantastic. Might be the chicest dim sum restaurant i've been to. You can tell the decor and ambience was set and picked out very meticulously and it all works. \n\nThe food was all great but the 3 dishes in particular that left me wanting more were the scallion pancakes with beef, their soup dumplings and a pork belly dish that was accompanied with a very good brown sauce which i can't remember what it was comprised of. \n\nLooks like another option has opened up in the city for delicious dim sum. Well worth the trek to UCity, and parking is probably easier to find here than in chinatown."]], "date": "2016-12-27", "time": "04:35:08", "categories": "Restaurants, Chinese, Nightlife, Dim Sum, Event Planning & Services, Bars, Cantonese, Venues & Event Spaces", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 451, "predit_yelp_score": 2.6750000000000003, "actual_yelp_score": 5.0}, {"review_id": "A56N9aSQqEoebXGxHk5h1A", "user_id": "ftC9xKu_0dYiAQnGZ-VTSQ", "business_id": "qISf5ojuYbD9h71NumGUQA", "review": [["No doubt the best Sichuan restaurant in Philadelphia, and one of the better ones between DC and New York too. The range of spice is impressive - if you like spicy food it this is the place. On the other hand, if you don't like spice just let them know since dishes are cooked to order. I had been going out to Exton to eat at their other restaurant but now that there is a location in Philadelphia couldn't be happier. The portions are big, so you'll probably have leftovers, which are great the next day when the flavors really sink in."]], "date": "2010-01-20", "time": "13:50:38", "categories": "Beer, Wine & Spirits, Chinese, Restaurants, Food, Szechuan, Noodles, Soup", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 1474, "predit_yelp_score": 1.875, "actual_yelp_score": 4.0}, {"review_id": "i1MFwOSsmhzckFLNI8zItw", "user_id": "5kcLlhJPLJL_GLwrAdbZAA", "business_id": "ZyDCgfTgmfS8R0yjdV1cjg", "review": [["My friends, Frank and Sandy, invited me to dinner at Ansill. We got caught in the torrential downpour, but managed to get to the restaurant only a few minutes late. Sitting at the bar near the entrance was the Executive Chef himself. \"Aren't you David Ansill?\" I asked. \"Yes, ma'am,\" he replied. \"I've been here once before two years ago and loved the food, so I'm bringing new friends here,\" I said. \"Oh, our chefs have changed since then,\" he said, \"so look over the menu again. There's lots of good stuff. My suggestion... try the pork belly.\" I smiled and thanked him. We looked over the menu and selected several plates, actually almost the entire menu, including the specials. It was truly a sumptuous feast of epic proportions and we shared everything. We started with the Beet Soup, a tasty gazpacho with diced green apples, and quickly moved onward to the Frutti di Mare, three tasty ceviches of oyster, scallop, and striped bass; Bone Marrow, a delightful beef bone-flavored spread; Steak Tartar with Quail Egg, perhaps the best version I've had yet; tender Sweetbreads with a medley of green peas and lima beans; Baked Duck Eggs with truffled cream and porcini mushrooms; Broccoli Rabe, a pungent and spicy side dish; Grilled Branzino, two decandent pieces of fish accompanied with delicious mushrooms; Parpadelle Pasta with Braised Squid, absolutely my favorite dish of all; and the chef-recommended Pork Belly, a delicious blend of crispy skin, tender meat, and flavorful fat sitting in a lovely sweet and sour sauce. I shared a small bottle of ice wine with Frank that I totally loved. Chef Ansill sat near us at the bar, perhaps curious as to how two little girls and a guy could eat so much. I wish I had my camera with me!"]], "date": "2009-02-23", "time": "19:43:37", "categories": "Modern European, American (New), Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 40, "predit_yelp_score": 2.4000000000000004, "actual_yelp_score": 4.0}, {"review_id": "z7_s4cvl6no-HLfVmd7tow", "user_id": "GZ3mLpc_kfPiie-Sp6qMiw", "business_id": "pRk4_ElCW8pZU58WIZ8jMg", "review": [["i will never go anywhere else for issues with electronics! poured water all over my macbook air by accident, and after messaging Wise Guy through yelp with all the details about my problem, Garrett replied within one minute advising me on my next steps. throughout the time they were working on my laptop they maintained communication with me with constant updates on how the progress on my laptop was going. \nthey certainly have the customer's best interest in mind as they transparently told me all of my options to repair my laptop, and how much each of those options would cost. \nin the end my laptop was irreparable (150% completely my fault due to my clumsiness) but by the grace of god they were able to extract my data for a very small fee which, for a design student about to start her senior year, is literally the best thing i could ask for. these guys deserve every 5 star review, and then some. shoutout to Nick and Garrett for keeping me in the loop throughout my entire experience and to the whole staff for being friendly, responsible, and honest!"]], "date": "2019-07-31", "time": "00:03:14", "categories": "Couriers & Delivery Services, Home Services, Data Recovery, Electronics Repair, IT Services & Computer Repair, Local Services, Computers, Shopping, Mobile Phone Repair, Mobile Phone Accessories", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 124, "predit_yelp_score": 2.2, "actual_yelp_score": 5.0}, {"review_id": "Azo9n4-W2QaWY1-CVtEieA", "user_id": "Q7Qj6rTSIC6UVQ0a9xSyEQ", "business_id": "OTNPMzKPb8LVQxX3fXJaqw", "review": [["If Rooster C. Thinks it's tasty, I would avoid it like the plague."]], "date": "2015-04-04", "time": "22:34:09", "categories": "Pizza, Food, Restaurants, Sandwiches, Burgers", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 116, "predit_yelp_score": 1.525, "actual_yelp_score": 1.0}, {"review_id": "CAprZNAqny3qhxv5tNRAmg", "user_id": "IC8jJYeX3fzzogfP1VwbJQ", "business_id": "03jQGGJ2ch0uHTtW-UUUqg", "review": [["The sandwiches are pricey, but they're also big enough to split. I got the egg salad and would guess my sandwich had 6+ eggs worth. The highlight was the wheat bread."]], "date": "2010-06-27", "time": "04:04:54", "categories": "Bakeries, Breakfast & Brunch, Delis, Restaurants, Food, Sandwiches, Desserts", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 620, "predit_yelp_score": 4.4750000000000005, "actual_yelp_score": 4.0}, {"review_id": "ANjz3k0i1g_XcRkYYBZJBw", "user_id": "ppsm8EDKjA1fp1yTCP3RrQ", "business_id": "BxfvdHqETU8jWYUjx5OL2A", "review": [["I'll go basic on this review. You probably have a good idea what this place is about from the other 365 reviews. \n\nTime from ordering the burger to getting it was about 5 minutes at 1:20 pm on a Friday. Not bad. \n\nSingle SmokeShack burger with large half and half tea was almost 10 bucks. A bit high, but I'm sure that is paying for the location. \n\nThe burger was really good. Loved the flavor, but the flavor came mainly from the condiments on it. Nothing wrong with the half and half drink at all. \n\n4 stars is right. I've had better overall burger experiences.  But I like the taste here, the staff was very friendly, and you can't beat the location on a nice day.\n\nBut I do believe that you can get 5 star burgers at cheaper places."]], "date": "2013-09-20", "time": "17:28:56", "categories": "Food, Hot Dogs, Burgers, Ice Cream & Frozen Yogurt, Fast Food, American (Traditional), Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 777, "predit_yelp_score": 2.2249999999999996, "actual_yelp_score": 4.0}, {"review_id": "fud9JHeYAcASf39veJal2g", "user_id": "Si5sPB142xG_obCe5m1wuA", "business_id": "j-qtdD55OLfSqfsWuQTDJg", "review": [["EXCELLENT place for lunch.  The atmosphere is gorgeous - well appointed and just very lovely.\n\nService was excellent!  So friendly and attentive despite how busy it was.\n\nI had the salmon tartine - a little too salty, though the bread was tasty.\n\nThe dessert was awesome!  And the coffee was very excellent.  Not sure about you, but it certainly is a relief when you can finish a meal with a delicious cup of coffee."]], "date": "2009-09-12", "time": "14:51:14", "categories": "Restaurants, French, Wine Bars, Nightlife, American (New), Bars, Cafes, Breakfast & Brunch", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 2761, "predit_yelp_score": 2.375, "actual_yelp_score": 3.0}, {"review_id": "3fmWqs_tijhmiH5NqWD-QQ", "user_id": "0DB3Irpf_ETVXu_Ou9vPow", "business_id": "eFvzHawVJofxSnD7TgbZtg", "review": [["They take credit card with no limit. Cool spot to hang out. Different vibes than the other one at Fitler Square. Much larger, tons of seating, and a few outlets around the room. Tends to run a little more loud than other shops, but good spot to get work done. Small selection of sandwiches and good fair trade coffee."]], "date": "2018-03-18", "time": "22:08:06", "categories": "Food, Cafes, Coffee & Tea, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 249, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "GbTSe2cxfTH26X7TR2Uw4w", "user_id": "fD14WAdRrqOnGJQBgy33rQ", "business_id": "c6hhh1Kpr7iau8qMH74w2Q", "review": [["Oh, the POPE. How I miss being only 30 mins away from South Philly...\n\nThis is one of my all-time favorite bars. Amazing beer selection, decent prices, great food. Gets pretty packed, but thats city life.\n\nParking is decent in the area too, never had trouble finding a close spot."]], "date": "2012-04-12", "time": "16:38:34", "categories": "Nightlife, Pubs, Bars", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 443, "predit_yelp_score": 2.1999999999999997, "actual_yelp_score": 5.0}, {"review_id": "payjxvMEqC-fNxTSaSfSvQ", "user_id": "tlbPmw0TtzODN7CfaZeC9g", "business_id": "hdtnpHXn-iIFTzPLvoOK0Q", "review": [["We had breakfast here this past Sunday.  Good food, service and coffee.  Come early or expect to wait.  Also parking is limited to street parking so consider biking, indigo or ubering to the The Dutch."]], "date": "2017-05-24", "time": "11:25:04", "categories": "Salad, Breakfast & Brunch, Sandwiches, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 334, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "36KGteQKkXKQeXlvqDXapA", "user_id": "GUKgTyDBDzGDctvyj9O9KA", "business_id": "lZX5_8qspEXtMJGFQ0-Mow", "review": [["Pluses: 1) Location! Attached to convention center, across from the market. \n2) Hotel staff is delightful from front desk to housekeeping to doormen.\nMinuses: 1) Rooms are run down. 2) Rooms are hot! 3) The staff at the lobby bar and 13 restaurant are barely existent and plain rude. Add to to that rude and defensive. A total opposite of the rest of the hotel staff. Last time I stayed at Loews next door. I loved it! Live and learn."]], "date": "2017-04-02", "time": "19:32:52", "categories": "Event Planning & Services, Hotels & Travel, Venues & Event Spaces, Hotels, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 595, "predit_yelp_score": 1.35, "actual_yelp_score": 2.0}, {"review_id": "h80B6DTRHTL2q5r7Ep4BfQ", "user_id": "Y2dhNLLyzeHTJ4zet86rRA", "business_id": "SwdHTo4A_5eA8QsfelTPdg", "review": [["Enjoyed lunch here today -- a veggie burger that was fine (definitely seemed home-made) on bread that was so-so. perhaps the bread was gluten free or some such thing and that's why it didn't taste good.  Was a nice quiet place for lunch."]], "date": "2013-04-15", "time": "19:24:55", "categories": "Health Markets, Specialty Food, Restaurants, Bakeries, Food, Gluten-Free, Sandwiches, Grocery", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 13, "predit_yelp_score": 1.675, "actual_yelp_score": 3.0}, {"review_id": "GRNUfBuJhkrcyDoNEwmtcA", "user_id": "_Fayj6NkO2vCv264Xavgeg", "business_id": "Mt6XTQfwk2DUD3AK29YIBg", "review": [["Ok, I'm giving 5 stars because while my meal specifically was not the best, everything else and the overall dining experience was wonderful. \n\nI made the mistake of ordering the Risotto al Nero. It tasted wonderful, but I could NOT stop thinking about the fact that I was eating squid ink and it didn't help to look down to black risotto swimming in it! Yick! I have no idea why I ordered that knowing full well what to expect, I guess I was being adventurous. I mean- I do love octopus, but the ink is going a step too far for me. I was also very paranoid that it was going to make my mouth and teeth turn black so I was self conscious through dinner. I'm happy to report that it does NOT make your mouth or teeth turn black, so if you're on a date feel free to order and not feel self conscious. \n\nI'm looking forward to going back to Melagrano. The hazelnut gelato was fabulous!"]], "date": "2011-09-07", "time": "18:00:25", "categories": "Italian, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 451, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 5.0}, {"review_id": "rQFjCovw8D43xQ0v6ga6yg", "user_id": "bUyZ3DN2nKPhZNjtTnWMlA", "business_id": "Hr6aM0s-woIJaW6DJSbvNQ", "review": [["AYCE is definitely the way to go here. In addition to the ample and diverse sushi offerings, you can get a variety of other dishes, including edamame, miso soup, gyoza, etc.\n\nService was friendly but the staff seemed a bit disorganized; we arrived late on a Saturday night (around 9:15) and had to wait a while at the bar due to a mix-up with reservation names. The wait time between each AYCE plate can also feel long if you are very hungry! Better strategy would probably be to order as much food as possible right up front (but beware that you do need to pay for each piece you do not consume).\n\nThe lychee martini I had at the bar was very sweet and, for some unknown reason, bright pink. I was much happier with the very generous pour of house chardonnay that I enjoyed for $7 with my meal. The place was pretty crowded and noisy in a way that made it feel quite a bit more oriented toward party night than date night. If you go, take a Groupon with you--it makes the already reasonable $27 AYCE deal even better!"]], "date": "2017-02-15", "time": "20:55:41", "categories": "Sushi Bars, Restaurants, Lounges, Ramen, Japanese, Nightlife, Bars", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 573, "predit_yelp_score": 1.5000000000000002, "actual_yelp_score": 3.0}, {"review_id": "CcjtCjlh348_Br8KDxRXag", "user_id": "lFLSuHyr22QfQxr26KkvGw", "business_id": "3ldp8B52AOzNSFnPMAY0ww", "review": [["Fette Sau is probably my second favorite Happy Hour spot in Fishtown. The $5 Manhattans can't be beat. Also, all of the draft beer is 1/2 price. The food is good, especially the burnt end sandwich. Outside of happy hour though, things get really expensive, really fast. Especially if you are ordering the ribs and brisket by the pound."]], "date": "2016-04-26", "time": "02:35:18", "categories": "Barbeque, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 631, "predit_yelp_score": 2.325, "actual_yelp_score": 5.0}, {"review_id": "cIlfo43qsVWxmMFxRvJ0ng", "user_id": "N9hqTPQu2bmI8c2Pj8F1ww", "business_id": "JMm_VEivWfEcf3TsRKfplw", "review": [["Italian Market Festival Survival Guide: There is No Guide.\n\nBecause I'm always on \"ready-mode\" to have fun, because I don't have time to find ( or broaden) my horizons, and because my busy life sometimes gets in the way, I always like to go to the Italian market festival. \nI love good street food, and there is no shame in that. You will see many stalls and small tents of both famous and big names, and small places. Some with long lines and others you won't have to wait at all. \n\nEvery year I go I like everything I try, this year I had some fried dumplings from Humpty's Dumpling and they were good. I think some of the crowd read Melissa's tip and actually went to the sidewalk, people were everywhere. Also, too many children, infants, strollers, mobility scooters and pets. Just when you might think 9th Street couldn't get any more crowded, yet more people kept coming, either swaying or cursing their way. I thought I was Italian myself for a minute. I'm sure I can pass as Italian and fit in. I tried to wash down my hypertension with Piña Colada, LimonCello and Sangria, none worked. Still, I'll. be going next year, and the year after and the one after that.\n\nThree and half yelp"]], "date": "2015-05-16", "time": "20:43:50", "categories": "Festivals, Arts & Entertainment", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 19, "predit_yelp_score": 1.425, "actual_yelp_score": 4.0}, {"review_id": "AA2ppRppGi4bJBkAzu_aTA", "user_id": "nkBpODDjnP-nD9uz1Z4YsA", "business_id": "sDaBm5V1VQMOPfCm76turg", "review": [["You'd hardly notice this Applebees if you were driving by.  Lived around the corner for a year and a half and just got around to stopping in.  It's actually a pretty nice little Applebees, but I must say it was the least crowded one I've ever dined in.  As most do, we went for the great deals, like the 2 for $20.  Ended up getting an appetizer sampler (my favorite of any restaurant) plus the two for twenty.  Everything was good as usual.  Nothing ever blows you away here.  Portions were large so both me and my fiance had left overs that I enjoyed for the next two days.  Staff were very attentive and the service was quick.  Couldn't have asked for me.  Recommend this Applebees to anyone looking for a decent meal at a great price."]], "date": "2011-12-06", "time": "13:11:00", "categories": "American (Traditional), Bars, Nightlife, American (New), Restaurants, Sports Bars, Burgers, Steakhouses", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 65, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "YMk9PWzmgjnjVk_H4sDN2w", "user_id": "I3GWyeBe0jKRDiToltYVlg", "business_id": "I1H5s9cVCGh1nH-4bhsSDA", "review": [["Best pizza. Great service. Can't wait to come back. A friend recommended this place and I'm so happy I came"]], "date": "2018-08-09", "time": "13:43:43", "categories": "Restaurants, Italian, Pizza, Breakfast & Brunch", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 469, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "E2p_7DOnfLfO-KD4j42zNg", "user_id": "lCSp5-kiB_St0nmyGfWq_Q", "business_id": "F8yozE3NWnImNApHO347gQ", "review": [["Terrific food with fast service.   Eating with your fingers with a towel on your lap is the tradition. A pleasure to support this family owned restaurant.  The chicken is so tender and juicy it's hard to imagine!  Cheap wine by the carafe makes for a fun and inexpensive meal.  \n\nIf you like Moroccan food, this place is a find!"]], "date": "2019-10-26", "time": "01:00:22", "categories": "Restaurants, Mediterranean, Moroccan", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 659, "predit_yelp_score": 2.05, "actual_yelp_score": 5.0}, {"review_id": "W8zUjBT4_zQhRlEb7eomXQ", "user_id": "nqCz_Kh5CTJyWxT19sLl4g", "business_id": "6zEWIsb6Lhr3BeoC3gm1lw", "review": [["Complete waste of money .\n#1: why are they called crab fries if they have not a drop of crab in them? \n#2: I highly doubt they are actually \"famous fries\" but okay I believe youuu *wink nudge*\n#3: never been so unimpressed with chicken tenders I mean \"chicken cutlets\" in my life.\nI went into this with my expectations set as high as the price. Fries: $6 chicken: $9\nI've been robbed"]], "date": "2020-08-17", "time": "22:31:35", "categories": "Sandwiches, American (Traditional), Seafood, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 787, "predit_yelp_score": 1.225, "actual_yelp_score": 1.0}, {"review_id": "9X-3VXsAqU9XidBSXhoOQA", "user_id": "G_ewrDXcU0hXovihr2G5og", "business_id": "DZglT5FP5VNDQJU3PuRIHw", "review": [["Found this business on Yelp when walking the Schuylkill Banks with some family. Wanted outdoor seating and somewhere with reasonable food and good drinks. La Calaca Feliz definitely delivered. We started at the bar because dinner service didn't begin until 4. We went with a pitcher of red sangria (that probably had more ice in it than it needed to) and paired that with the House Nachos. Definitely add the meat for $3. When we moved to the table at 4pm, we sat on the outback patio. It was beautiful and the rest of our food was great."]], "date": "2015-04-15", "time": "02:57:02", "categories": "Cocktail Bars, Restaurants, Mexican, Bars, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 681, "predit_yelp_score": 2.5500000000000003, "actual_yelp_score": 4.0}, {"review_id": "Ec1Fk4BcLbdgtidoeUPjRA", "user_id": "exPhuONOpfCptZ35Ur3bcQ", "business_id": "DS-aX6GzBVwRpIzP8luWBw", "review": [["I hit Reading Terminal every time I'm in Philly, it's a wonderland of food that offers something new every time I visit and this time I found Condiment.  \n\nI think my eyes glazed over at all the options at the counter: pesto, mayo, cocktail sauce, ketchup, BBQ, ranch, harissa, mustard, pasta sauce, something arugula based; and then my eyes landed on something that was simply labeled \"Schwifty\". \n\nMind you, this was the week McDonald's had released like 5 packets of their long discontinued goddamn Mulan Szechuan sauce for an entire country of Rick and Morty fans. In case you hadn't heard about it, it didn't go so great. My eyes lit up. \n\nI ended up speaking to the guy who makes the sauces and he told me it was his take on the McDonald's product. He looked up the ingredients and then tinkered, the result being something that tastes REALLY great! Sweet, spicy, tangy, similar to a teriyaki but so much better. And we did go to McDonalds and order some nuggets, and the nuggets were still gross, but his sauce really made them shine. I can't say what the McDonald's version tastes like, but this is delicious even without the hype or back story, just a solid product. \n\nCook with it! I plan on using it on fried chicken. I don't think there are preservatives, I bought a bunch and froze it. The other sauces are great too, I also bought some harissa and their cocktail ketchup. The two people I met who worked there were friendly and passionate about food, we must have talked for 20 minutes. They also didn't cut me off from sampling as many sauces as I wanted- go nuts!"]], "date": "2017-11-05", "time": "05:16:15", "categories": "Specialty Food, Food", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 18, "predit_yelp_score": 1.5, "actual_yelp_score": 5.0}, {"review_id": "6NiO1UcWfAxE8T2TpmYYBA", "user_id": "hHFdI8M4TXxU2q5kozrE7w", "business_id": "9-tZDrMjJYBbpCJoU3WXAQ", "review": [["I have been here 3 times and always enjoy it. I usually get the chicken tikka masala dish with the naan and it's delicious! My hubby likes the veggie samosas. Byob is always a plus."]], "date": "2016-11-01", "time": "02:17:37", "categories": "Indian, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 328, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "Vls95QPN_CI28VZ33St8fQ", "user_id": "lh2Pc6bHzfZ_LsSIWGDUOw", "business_id": "0QmgzzPVNHeNL76B8rwTKA", "review": [["This bank is in serious trouble and they are closing at a rapid rate don't bank here at all if you value your money you could one day come to closed doors"]], "date": "2017-10-03", "time": "11:30:29", "categories": "Banks & Credit Unions, Financial Services", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 5, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "TZeNXgDkyvkoJn4aNYCoeQ", "user_id": "rZMQ9UIN6wVC9BD_MBrJWg", "business_id": "zujdPV3HT-Y-CKE1GgkMHQ", "review": [["This is a tiny, adorable bakery and coffee shop. There is seating for four people inside. I ordered a cold brew and a blueberry apricot walnut challah muffin. The challah muffin was sticky and easy to pull apart. It was delicious. The cold brew was also very good. Our total for one muffin and two cold brews was almost $15, so my only complaint would be price. Otherwise it was delicious and such an adorable little spot!"]], "date": "2018-07-24", "time": "19:53:37", "categories": "Coffee & Tea, Bakeries, Food, Soup, Breakfast & Brunch, Restaurants", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 346, "predit_yelp_score": 2.05, "actual_yelp_score": 4.0}, {"review_id": "3qsm_taKBMt9_3PqdBvffg", "user_id": "Cn-Num317ol4anQkJm6cVg", "business_id": "9DfzRvTs9tzFuj5PnnLOrA", "review": [["I'll begin by stating that I am not an art connoisseur by any stretch of the imagination.. I went to the BF because it's so close to my apt, it felt like a miss to avoid it. As I walked through the rooms, I was blown away by the quality, quantity, and even the diversity of works on display (not diverse in comparison to other art museums but diverse considering it was a personal collection). And the architecture of the building is stunning - especially the main room. Again, I have very little experience with art yet I was able to recognize some of the paintings. The staff was very friendly and engaging. I had numerous questions and they answered them all with poise and dexterity."]], "date": "2017-12-30", "time": "03:07:08", "categories": "Art Galleries, Education, Arts & Entertainment, Shopping, Art Classes, Museums, Art Museums", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 414, "predit_yelp_score": 2.375, "actual_yelp_score": 5.0}, {"review_id": "JTTDnhf-eudJ0ht4W46roQ", "user_id": "bgVTTFqjJLiRyuz3pZY5zw", "business_id": "EzQpL3jNNGlUzeR6n3uevg", "review": [["We just had another great night at Rembrandt's. I've been a regular there for years and finally feel compelled to write something about my 'Cheers!' I love Rembrandts and hopefully always will. They have been through a lot of changes through the years, but they seem to be at a good place right now. The food is now probably at it's best, even if the management is rather unstable. One constant is the bar staff. Joe D, Molly, and Donna are some of the best bartenders in the city. These folks have been pouring me drinks with a smile since my 21st birthday (I'm 30-something now) Molly I've known from her Belgian slinging days back at Cuvée  Notre Dame, Joe brings expert wine analysis from his side job at Panorama, and Donna is just a forever lunchtime Fairmount staple. If you come to Rembrandt's, get a local beer, an awesome burger with house smoked bacon on it, and get ready to talk to a bunch of locals, because that's what this place is all about."]], "date": "2012-02-22", "time": "07:34:39", "categories": "American (Traditional), Bars, Italian, Restaurants, Nightlife", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 229, "predit_yelp_score": 2.325, "actual_yelp_score": 5.0}, {"review_id": "bAY-ciluqRLYL37ryoL6nw", "user_id": "tqXyjCPq0-z6j1jnVTLA6g", "business_id": "zy0GWJhzZCQ-mTPPHr_Ujg", "review": [["DO NOT GO THERE! \nThey only take cash \"the card machine is down\" which is a joke.\nNo receipts and no guarantees of any sort.\nThey sold me a set of tires used but \"like new\" (found out later they were the wrong size) one got flat in a few days, replaced it, another one kept going flat and I decided it was a waste of time to keep going there. Finally it was beyond repair, was in a bind for time so I thought I can give them another shot, went and paid for another one, they put the \"correct\" size on the tire this time. So I have 3+1 kinds of tires on my car!\nAlso I was checking the air they filled the tires with, first time it was 37psi and the last tire they put in for me was 45psi!!!!!!! Who fills up and R17 with 45psi?\nClueless monkeys!\n if you think you are saving money there; YOU ARE NOT!\nFUCK THAT PLACE!\n\n*Update!\nWent back today because the last tire I bought from them 3 days ago is flat now! They blamed it on the valve stem, mean while I was there I discovered they lost 2 of my original Subaru log nuts when they rotated my tires 3 days ago! Of course they mumbled and said they didn't know what happened and replaced them with cheap shitty ones and DARED to charge me $10 for the valve stem.\nFUCK you people! LIKE in FUCK YOU MOTHER FUCKERS\n\nPS. If you read this and still go there then you are a masochistic moron"]], "date": "2017-04-25", "time": "16:05:39", "categories": "Tires, Automotive", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 5, "predit_yelp_score": 0.925, "actual_yelp_score": 1.0}, {"review_id": "ShV42D0jvd4xERsF4_WKsg", "user_id": "PTMsh6nHKzy74X0osV0ofg", "business_id": "dHFEcHJG2LmPBJ0X2cfj7Q", "review": [["Normally don;t write reviews, but this place is 5 stars all the way!  And they Tottenham Hotspur fans too!"]], "date": "2016-09-27", "time": "22:05:31", "categories": "Restaurants, British, Food, Bakeries", "city": "Philadelphia", "state": "PA", "stars": 4.5, "business_review_count": 164, "predit_yelp_score": 3.175, "actual_yelp_score": 5.0}, {"review_id": "KJ41JUP8266gFeJclLbcQg", "user_id": "zPo20y61YQcYNwzSaGICvQ", "business_id": "j6usntbtSzFyuwx4n2mn1g", "review": [["Our family of 4 (with tweens) ate here a few days ago (lunch) and simply loved the food. We've eaten in many mexican places all over the country and this was simply one of the best places we've been to. We all ordered different dishes and they were all excellent. Very flavorful and well prepared and presented. Great service too. The decor of this place is so tasteful as well. Highly recommend this place. Very kid friendly too."]], "date": "2017-02-27", "time": "00:06:14", "categories": "Restaurants, Mexican", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 381, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "1GJeQMgq-kZg_IutOFQOEw", "user_id": "EIPN7GwMqVO9IJV1TKPTRA", "business_id": "xfS0MaeCdPKrWZ277H7xzg", "review": [["My Honda broke down near here a few months ago. I brought the car in and the owner said he'd take a look. He inspected it and did a road test. He gave me the bad news that my transmission was shot. He discussed options with me and then didn't even charge me for his assessment, though he certainly could have. Overall, this place seems like a trustworthy establishment. I'd go back if needed."]], "date": "2016-06-04", "time": "18:12:05", "categories": "Automotive, Car Dealers, Body Shops, Auto Repair", "city": "Philadelphia", "state": "PA", "stars": 5.0, "business_review_count": 46, "predit_yelp_score": 1.275, "actual_yelp_score": 5.0}, {"review_id": "7bh44zpV4meGyDtXTeP2BQ", "user_id": "uFgkS4U-gtnThsrNvTZIHQ", "business_id": "AFe9CAVwXMQe1LssZ-jJmQ", "review": [["I was visiting Philly from DC and I needed a break after shopping so I sat down at the bar at the back of the restaurant. The front is the pizza counter and kitchen, the back is a proper bar. I had a cider with a slice of pizza while watching all the college football games and post-season baseball. The bar had an outlet right near my knees which was awesome because I could charge my phone. Great bartender service. I'll be back if I'm ever in Philly."]], "date": "2015-10-21", "time": "13:55:09", "categories": "Italian, Mediterranean, Nightlife, Pizza, Restaurants, Sports Bars, Bars", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 215, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "oefAV9RL0HojYogOYhIO_Q", "user_id": "Z54pcWCRzLrSA8DwQPOc2Q", "business_id": "vKOFm_lNZqwhQEUv0bVkfw", "review": [["I hired them, then couldn't get a hold of them. The cell phone number they provided doesn't accept voice calls. I think that's a bad sign. Moving is stressful enough. Don't use this \"business\"."]], "date": "2018-08-09", "time": "13:09:47", "categories": "Shopping, Local Services, Demolition Services, Junk Removal & Hauling, Packing Supplies, Packing Services, Movers, Home Services", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 19, "predit_yelp_score": 0.7000000000000001, "actual_yelp_score": 1.0}, {"review_id": "BCUzKu03e7XJGExqR-WPdA", "user_id": "K17847uudqPFPIjSPgxs2A", "business_id": "Sip4hzT-4ybbzElDhCNcqw", "review": [["This is my go-to take-out spot when I am in the mood for pizza.  I enjoy the personal size stromboli and the cheesesteaks too.  \n\nI like the friendly staff and they often have coupons.  Every pizza I've ever gotten here was amazing; Tuesdays you can get a large cheese pizza for just $8 which is a total plus. The Philly cheese steak stromboli is great as well, and the bread sticks are to die for. The staff are all really friendly, and the place itself is really clean and great to eat in. They've pretty much become my go-to for pizza nights! \n\nThe ONLY problem I have is with their weird front door, its hard to maneuver with a large pizza box in tow. :D"]], "date": "2015-01-25", "time": "00:41:09", "categories": "Italian, Restaurants, Pizza, Event Planning & Services, Caterers", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 27, "predit_yelp_score": 2.05, "actual_yelp_score": 3.0}, {"review_id": "6ODt810DOpF3xZrp9RtGoA", "user_id": "qexgfkeIVmkRrtHcvrnIlQ", "business_id": "wiI0GYhfuIjrBldrQdytWg", "review": [["I didn't know this restaurant was under new management until I came in for lunch and noticed the name was changed. My boyfriend and I was meeting up his friends for lunch and his friend choose this place because one of his friend is a waiter here . But anywho, since there were four of us we decided to get the special for 4 . It came with two appetizers and three dishes . The food didn't take that long to come out considering there's a lot of dishes to be made . \n\nThe waiters were very nice and attentive . Always make sure we're taken care off . But I have to say the food were a little too sweet for my liking . Not the best vietnamese restaurant around. They need to change the ingredients in their food or something. 3 stars to the food and 5 five stars to the waiters that served us."]], "date": "2017-01-14", "time": "23:17:40", "categories": "Restaurants, Vietnamese", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 88, "predit_yelp_score": 1.9500000000000002, "actual_yelp_score": 3.0}]