[{"review_id": "MhGAfLdbzs57QsUhm9G5jQ", "user_id": "m5qjur2CkeQxqhYLxA97YQ", "business_id": "kFK8VK9sGIJ9TBRcrRZtdg", "review": [["I needed a new screw for my Ray Bans and not only did Michael repair it in a snap but also thoroughly cleaned them! Super friendly and a great price, thank you!"]], "date": "2014-04-20", "time": "05:44:27", "categories": "Eyewear & Opticians, Shopping, Health & Medical, Optometrists, Local Services", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 51, "predit_yelp_score": 4.375, "actual_yelp_score": 5.0}, {"review_id": "YgjyboRXFZ9rF1i0vsruuQ", "user_id": "LVu63p-oDcDF-AdwwCcpSA", "business_id": "GmoYBvRsVa18G5FPiXk8JA", "review": [["Charges the wrong price. I correct her and makes excuse. The price is listed right behind, regardless of hot or iced. Even the receipt shows you charged the wrong item, but nothing. Just because people are in a hurry doesn't mean you over-charge, please be considerate."]], "date": "2019-02-11", "time": "16:52:36", "categories": "Coffee & Tea, Food, Restaurants", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 33, "predit_yelp_score": 0.0, "actual_yelp_score": 2.0}, {"review_id": "9bg_7MaRv47_ZTzhds6ktg", "user_id": "RwFw8DOtgC4PcDqS9YnIIQ", "business_id": "d7OTpxB6SnJB2-pvAdCJnw", "review": [["Amazing Calzone...seriously one of the best I've had! The crust was so soft,almost like a donut and the filling had real ricotta and fresh meats! \n\nThe owner came and greeted us and made small talk. He said he was working on wings for the wing festival and asked if I would try his latest...don't want to spoil it for the competition but they were so unique and delicious! Place is awesome and even the leftovers the next day were great...definitely a new fav!"]], "date": "2014-03-16", "time": "01:22:54", "categories": "Pizza, Restaurants", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 68, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 5.0}, {"review_id": "KYYI2q0N6FebeTwLKXDVPg", "user_id": "Rdro0ZXoVNh1uNW0FvccNw", "business_id": "6dDC5PSmPEoJYuM8r8dN_A", "review": [["I have no idea what has gotten into this cashier. First of all, not a hi or hello. Then after scanning everything, he asked me if i'm paying with something something membership card, I assume he's referring to the Amazon Prime Credit Card, so I said yes and plugged in my credit card, then as I pulled up the Whole Food App to scan the barcode for any discount he said \" You are suppose to scan it before I gave you the total.\" I was like \"Ok, it's fine.\" He said \" If anything has discount there will be a big sign saying it's on sale. I didn't say anything because I thought to myself\" If I was a price conscious consumer that watches out for sale signs I wouldn't shop here.... This part is whatever since i'm not even sure if anything I bought was on sale. \nWhat really got me is that the way he bagged my things. I don't know how expensive paper bags are but I only got two hands, instead putting the milk and the cantaloupe into a bag he decided to leave them out on the counter. Emm..... again, only got two hands, and there are already 2 bags on the counter, am I suppose to carry the milk with my 3rd hand and then the cantaloupe with my 4th hand? USE YOUR BRAIN! Anyway, so I put those things myself into the two bags that are already very full. When I got home as I'm walking to the front door one of the bag broke, and u guessed it, it's the bag with milk in it. So now I'm cleaning broke glass and milk off a shared hallway and hoping my neighbors won't hate me once the milk turns rancid tomorrow when it's hot during the day. Thank you so much Mr. Cashier."]], "date": "2020-10-09", "time": "14:30:03", "categories": "Food, Grocery, Organic Stores, Specialty Food, Health Markets", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 375, "predit_yelp_score": 1.1500000000000001, "actual_yelp_score": 3.0}, {"review_id": "BYXLiFZTsB21XBrNvp3Wwg", "user_id": "EEV5sEA-BQozGg8VzOYWOQ", "business_id": "PH5Dkhrqr76sRXmsFGyXRw", "review": [["How is this place even in busines?? I spent approximately 15 minutes at Sushi Teri. Long enough to sit down, order 2 rolls, receive them, taste them, then ask for the check and leave. AWFUL. We ordered 2 very simple rolls. First, their spicy cucumber. Not even a minute later we were handed some very poorly rolled and even more poorly cut blobs of rice wrapped in stale seaweed with some cucumber in the middle and what I believe to be spicy mustard. It tasted exactly like what I put on a sandwich. Then, the Spicy Tuna. Again, less than a minute later we received cuts of stale tuna with spicy mustard (my boyfriend thinks it was thousand island dressing, but I'm sticking to the spicy mustard theory). Terrible. We exchanged looks of \"Are you kidding me???\" asked for the check and left... to the other sushi joint across the parking lot (which is excellent by the way). \nI don't know where Sushi Teri's sushi chef learned to make rolls, but he is an embarrassement to the art. I'm not surprised the place was empty, and it appears I'm not the only reviewer who wishes she could leave less than one star. If you're looking for fresh and tasty sushi, stear clear of this place. Sushi Teri is a joke."]], "date": "2012-04-14", "time": "23:04:56", "categories": "Japanese, Restaurants", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 9, "predit_yelp_score": 1.075, "actual_yelp_score": 1.0}, {"review_id": "Wa6dSeFVmDYBAqqP6KaSgg", "user_id": "chV73L-Qh62iVje3xvdG4Q", "business_id": "zhn28iqIxCTD7hQX7t04gg", "review": [["My new go to Mexican restaurant! Excellent food and service. I have dined in a few times and recently had an order to go. Pazole soup was excellent. Bean dip; a la carte chicken tacos are both very good. Food is made to order piping hot and friendly staff. Give it a try!"]], "date": "2020-12-10", "time": "19:07:29", "categories": "Mexican, American (New), Restaurants", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 202, "predit_yelp_score": 4.825, "actual_yelp_score": 5.0}, {"review_id": "vCNjuUMtLnmv2fJRGVV-yA", "user_id": "I4M62stYqfrHESgrU-Bn-A", "business_id": "OR7VJQ3Nk1wCcIbPN4TCQQ", "review": [["We went for the first time about a week ago and it was fantastic. The atmosphere was great, a nice clean restaurant, and the pizza was just amazing. The crust was perfect. The owners look like they enjoy doing what they do. They were upbeat and smiling the whole time which helps make the dining experience that much more pleasant. I've, personally, never had a pizza from the East coast (just wannabe East coast pizzas) but according to my wife it tasted just like it should. I think I might just have to say that this is the best pizza in Reno. We didn't add any extra toppings to ours this time, we just ordered a Ricotta Sicilian and tasted great as is. We will be going back to try more. The concept of the restaurant is great. I'm glad it looks like it is succeeding and hope that it sticks around for a long time to come!"]], "date": "2016-05-11", "time": "14:55:39", "categories": "Italian, Restaurants, Salad, Pizza", "city": "Reno", "state": "NV", "stars": 5.0, "business_review_count": 526, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "q1-FQAAq8gLuj1fvu3--Ow", "user_id": "7_ERyPL4vE8aJHaxgGh8AQ", "business_id": "f6AFWUqsumieMxBkqpHA7A", "review": [["Love the selection of their frozen yogurt and toppings!! My favorite is the cookies n cream with cookie dough bits on top!! Very nice atmosphere inside and also has outdoor seating!! There is also sugar free and gluten free yogurt as well! I could eat it every day!!"]], "date": "2014-05-16", "time": "02:03:32", "categories": "Food, Ice Cream & Frozen Yogurt", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 44, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "Bg_RD-hHD5uf-BavUCv01w", "user_id": "RwaY8TJSeMrzTDKRBzlkdw", "business_id": "bLC3frEZCtstsrfjmJMJiw", "review": [["Great place to buy a used car. Thanks to Doug, Kris and Jairo."]], "date": "2020-09-19", "time": "14:20:23", "categories": "Body Shops, Automotive, Auto Repair, Auto Parts & Supplies, Car Dealers, Car Rental, Hotels & Travel", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 654, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "aX_7z6AvBnxo20vajncNNw", "user_id": "M-dBbg1t6KzqCSP94lGTpA", "business_id": "YJNGOcElfNbQRZOakqm4lQ", "review": [["Tan Nguyen (Ricky) gave an outstanding pedicure and gel manicure. I have been visiting different salons as my regular salon became very inconsistent as it grew.  I decided to try NV Nails.  Wow. Classic, luxury spa level pedi and mani.  Ricky gave a complete spa pedicure with full massage, hot towels, lotion and an attention to detail I have missed for a long time. Then he gave the best gel manicure I have had in years.  Actually used cuticle oil and scissors which seems to have become a lost art at most salons. No constant grinding with a drill which was a class act. The nail length and shaping were perfect and the gel polish was applied sparingly to avoid the normal overly thick nails I have become accustomed to, but don't like.  Unlike most salons who just say, \"see ya\" once the polish is set, Ricky followed through with a real manicure; massage and lotion...the works.  What a wonderful surprise.  Ricky is a consummate professional, observant, sensitive and well spoken.  I'm so glad I decided to try NV Nails.  Thank you Ricky!"]], "date": "2016-11-11", "time": "02:04:25", "categories": "Nail Salons, Beauty & Spas", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 138, "predit_yelp_score": 3.475, "actual_yelp_score": 5.0}, {"review_id": "3yQRvEEdFTUdr2PEDvwVFQ", "user_id": "WMN_WooRW4oN8TaFhNpyWg", "business_id": "RFsp1nH2fHVyAdTSMDWuNg", "review": [["Great options. Love fried tofu appetizer. My tofu eggplant stir fry entree was a bit salty though, and the papaya salad was decent."]], "date": "2017-07-28", "time": "21:47:12", "categories": "Restaurants, Thai", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 437, "predit_yelp_score": 4.95, "actual_yelp_score": 3.0}, {"review_id": "Pe_cQ6J9X1yI0dEgS5cV3w", "user_id": "gVO3VZwCu54Otc7bUB33Mg", "business_id": "Tgq7FzfhLx97K5NBXGO5fA", "review": [["May 25, 2015 Monday at 8:30 AM Breakfast\n2 Adults\n\nAtmosphere - n/a\nFood - 3 stars\nService - 3 stars\n\nBackground - This McDonald's serves has one purpose for me.  This is an easy quick fix for a car trip.\n\nAtmosphere - Drive thru so not rating them.\n\nFood\n  Drinks - Large mocha, caffeine for the car ride to Sacramento.  I flipped the plastic notch to get my first sip and all I could see was the syrup sitting on top.\n\n  Food - This is one of my guilty pleasures, the sausage egg mcmuffin.  Two for $3.33.  Yeah they are bad but I love them.  Today the cheese was melted, okay very melted but it was not in the sandwich correctly and it was a mess as it stuck to the paper wrapper.\n\nService - The second drive thru window the server did not say a single word.  How strange and boarder line rude.  But the best part was seeing the employee walking around in a Pikachu hoddie with crazy ears attached to the hood.\n\nFuture - Sadly but probably."]], "date": "2015-05-26", "time": "02:41:59", "categories": "Burgers, Fast Food, Food, Restaurants, American (Traditional), Coffee & Tea", "city": "Reno", "state": "NV", "stars": 1.5, "business_review_count": 52, "predit_yelp_score": 1.55, "actual_yelp_score": 3.0}, {"review_id": "_2m-rVA34JhhMwlLGl4qgA", "user_id": "4DtAFfjOy9X9j8-SvPwUVw", "business_id": "YGEUMBBoNFW7X-z09gFu0A", "review": [["Mrs. Wong and her team are so accommodating and their menu selections brings back some childhood memories of what my grandmother would prepare for her family members of nine.  From the sweet and sour pork ribs to the bitter melon stir fry with pork was a delight. Their lunch and dinner specials were tasty and filling.  They do a lot of take out orders and their dining room is spacious and clean.   A lot of Chinese restaurants has their specialty and for the wok it was their specialty dishes that no other restaurants has to offer in which I was accustomed to while growing up. Well done"]], "date": "2021-10-19", "time": "17:51:48", "categories": "Food, Restaurants, Specialty Food, Ethnic Food, Barbeque, Noodles, Szechuan, Chinese, Soup", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 548, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 4.0}, {"review_id": "VpnF0wLfMNWfMi8NeywMFQ", "user_id": "-a-Czzeam1izGg2SSUN87A", "business_id": "52WiAtayDHMTtRt8dVfxCw", "review": [["Ok, so I'm not the ideal customer for a place like this, because, well, I'll admit it--I'm not the life of the party.\n\nBut I walked in anyway.\n\nAnd I wasn't sure what kinds of magical things those glass pipes did, but WOW, I wanted to buy one just because it was a beautiful work of art. There were dozens of different styles--each one carefully crafted, ornate, and I cannot imagine the blood pressure of whoever had to pack and ship those things. \n\nEveryone who walked in got the treatment of a small boutique store: a personal hello, assistance finding the right item, casual conversation, and a kind farewell upon leaving. This was bizarre considering that the store is next to Big Box stone-cold retailers. The family-run shop brings that family-feeling to the store.\n\nI felt totally comfortable and relaxed; like I would at a cousin's house. \n\nSometimes head shops put off a \"you're not cool enough\" vibe that have prevented me from even walking in, but I certainly didn't get that here. \n\nIf you've never visited a smoke shop, this is a good place to take a peek! :)"]], "date": "2015-01-08", "time": "23:17:56", "categories": "Nightlife, Adult Entertainment, Head Shops, Shopping, Tobacco Shops, Vape Shops", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 13, "predit_yelp_score": 2.975, "actual_yelp_score": 5.0}, {"review_id": "kMYkhh4ubskgbfH4Fj772g", "user_id": "rLqzi27iiyNUUYUe43B9lQ", "business_id": "3llOqyXdPRc29xo5qvXOMw", "review": [["We waited for an hour before we could be seated for dinner which is strange for a buffet.  They gave us a pager.  After waiting for a hour the food was just OKAY.  Nothing special.  \n\nI would suggest drive over to the main strip where Circus Circus, Silver Legacy, El Dorado, and Harrah's for a better buffet.  I really like the buffet at the Altantis Casino."]], "date": "2009-08-07", "time": "20:53:23", "categories": "Restaurants, Buffets", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 80, "predit_yelp_score": 2.55, "actual_yelp_score": 3.0}, {"review_id": "dz76Ko3XhWC8iDWG6GYFoQ", "user_id": "yl4twfLxtQ3X_A1MCCuE0w", "business_id": "Iyw6Nj9bYzGKopEvK4yqFA", "review": [["Got my windows tinted here a while back and bought a \"lifetime\" warranty. They told me it's under new ownership and will not honor my warranty. They said they would work with me and do the job again for 350... not cool! Brenda was nice the second time I called cause I got hung up on the first time. Take your business somewhere else. And if you do go don't buy the bogus warranty cause your just throwing money way. Hope they get their stuff together and figure it all out. I'm sure I'm not the only person who has dealt with this issue. Just plane irritating. To the owners: next time somebody calls you up with the same problem maybe try and be more willing to help out instead of screwing people over again...or not! Plenty more tint places out there."]], "date": "2020-03-13", "time": "01:59:35", "categories": "Car Stereo Installation, Automotive", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 63, "predit_yelp_score": 1.35, "actual_yelp_score": 1.0}, {"review_id": "cqrIKcYl_whTvH1AQjjPCQ", "user_id": "uA_-9hw7Qpo8DzAMN-o2IQ", "business_id": "6fU2warwiMf57FBDS-zKnw", "review": [["DMV is 2 for 2 on being terrible. Don't bother setting an appointment, I still waited 45 min. I set an appointment for 9:15am arrived and checked in at 9:05. I received a text that I was checked in and my number appeared in the list. At 9:40 my number had still not been called and I had received no text but my number just vanished out of the list without ever being at the top. I went to the info desk and they put me \"at the front of the line\". I immediately got a text saying I was #19 in line. I spoke to a supervisor and finally was seen 45 min after my appointment. The incompetence of the DMV is truly astounding."]], "date": "2016-03-17", "time": "17:08:23", "categories": "Public Services & Government, Departments of Motor Vehicles", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 163, "predit_yelp_score": 1.075, "actual_yelp_score": 1.0}, {"review_id": "G8fpa4xHkqJGGE7skzEUYA", "user_id": "jZ5IUIbT9Y-x-DrDnA2KFg", "business_id": "7_kXuKFruGrrRauN9rLJ1g", "review": [["So I go in there last night and there are four of us. You have three tables in the center of the room first one has four chairs the second one has three chairs and the third one has four chairs. Please explain to me why are you sit two people at the tables with four chairs so therefore we come in with four people we can't sit down because the waitress said she's not allowed to move one of the chairs that are empty over to the table where we were being seated. So you expect for one of us to stand up while we're spending well over $100 all because she can't move a chair over? So you lost our  money. And I'm a regular there, for years and years. And now I will tell you this I will never go to this place during the weekday ever again. Very disappointed and I'm a fellow bartender that tips very well. Customer service is key. It would not have hurt her to move one stool over to the center of the room, or to grab her manager to address the situation. But she's so kindly walked away as we stood there for another 10 minutes. Until I had to walk out. Very very disappointed."]], "date": "2020-07-24", "time": "21:30:32", "categories": "Burgers, American (Traditional), Bars, Restaurants, Sports Bars, Nightlife, Breakfast & Brunch", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 576, "predit_yelp_score": 1.275, "actual_yelp_score": 1.0}, {"review_id": "o2z6nKFm5RUWggHaYJrg6w", "user_id": "n62kqO1oCkkCHgD0PpK8BQ", "business_id": "jmMCUCuErJP7EtR_6RVRig", "review": [["Always satisfies a smoothie crave.  Fresh, friendly.  Good variety."]], "date": "2021-07-30", "time": "15:07:43", "categories": "Coffee & Tea, Food", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 150, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "z7IUsXp5-3NjY2itiiKL2A", "user_id": "sS5z-uLkMYsbIpYXaKq0Ig", "business_id": "OGSe_QZgp-zBniTi74kLrw", "review": [["I can't believe that this place is in business as I write this review they are running my name through every credit agency they can without my permission, I just got 10 hard inquiries without giving them permission, plz don't trust this business with your personal information if you plan to back out of there Terrible deals, otherwise as retaliation they are running my name over and over to every credit union and bank, thank god for fraud alert also all this occurred because of a man called Christopher Romero and his manager don't ever go to Christopher Romero he lied to my face saying the car was fine when it had several cosmetic dents that Is another horror story and if you meet their finance manager CJ run out of the room lol what a joke of a place brought my business to CARMaX where they treat you like a customer"]], "date": "2021-02-06", "time": "01:59:11", "categories": "Car Dealers, Automotive, Auto Repair, Oil Change Stations", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 149, "predit_yelp_score": 0.3, "actual_yelp_score": 1.0}, {"review_id": "K4TkDPQJ_oGizPNEsTbaEg", "user_id": "pH3qTtB1vVFzoAjNXkQLoQ", "business_id": "OvREyM6JzUogb8yQXXoF0A", "review": [["Food is always consistently decent at this location. I've never had anything that has wowed me before, though.\n\nDepending on how busy they are, service can range anywhere from good to non-existent. I recommend dining during an off-hour so you get good service and don't have to sit near screaming children."]], "date": "2012-10-02", "time": "23:19:41", "categories": "Italian, Restaurants, Soup, Salad, Bars, Nightlife, Wine Bars", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 299, "predit_yelp_score": 3.375, "actual_yelp_score": 3.0}, {"review_id": "E2eA_w7Wkfniu3wL7LaHaA", "user_id": "X7SUIYMfB2L3a6_535XQoQ", "business_id": "gndi4-wzu66Mtp4E0zHt7g", "review": [["I'm sorry I couldn't give a better review. Husbands chicken wings were not cooked very well and at 17 dollars for 6, very expensive. I was given the wrong burger. Fries were super salty, cold and not good.needs improvement for the high prices."]], "date": "2021-06-25", "time": "00:25:54", "categories": "Beer Bar, Pubs, American (New), Food, Comfort Food, Nightlife, Restaurants, Breweries, Brewpubs, Bars", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 694, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "WsTjf4bMM7CYopkSZO5eBQ", "user_id": "MZvpMPWe7fjakbpFjdf5EA", "business_id": "UaUgRZciqidjiLwZC8EkXQ", "review": [["If I could leave a 0 star review I would. My household has had food poisoning twice from this Carl's Jr in the last few months. With another recent review echoing the same thing, it's a bit concerning."]], "date": "2019-02-09", "time": "19:50:00", "categories": "Restaurants, Burgers, Fast Food", "city": "Reno", "state": "NV", "stars": 1.5, "business_review_count": 47, "predit_yelp_score": 0.325, "actual_yelp_score": 1.0}, {"review_id": "yiJnClgJV_O19713xtCgMg", "user_id": "nXyQPza_vd5san8IJWR9QQ", "business_id": "uTqmZj3IVvdXD99r3-kJxA", "review": [["Went here with my boyfriend while we were in town. This was my first time here and I was really excited to see the Tahoe exhibit. The museum itself is nice! The pieces that were featured were beautiful. My one complaint is that the whole time we were followed by this one security officer. It was irritating and took away from the experience. It was uncomfortable being hovered over and constantly watched. I understand that they have to ensure people are not touching the pieces, but it was excessive."]], "date": "2016-05-03", "time": "23:39:20", "categories": "Specialty Schools, Art Museums, Venues & Event Spaces, Art Classes, Art Schools, Museums, Arts & Entertainment, Education, Event Planning & Services", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 134, "predit_yelp_score": 2.175, "actual_yelp_score": 3.0}, {"review_id": "u27O2Y_G8oY7FdcdDwOD3Q", "user_id": "Wq_YiB4imS4Qs8ljnB4uoQ", "business_id": "N8tsAD1XOlXeOxaTScwIBg", "review": [["I'm extremely upset by the way my order was handled. \n\nI ordered through the Dickies app and when the Door Dash driver got there, they called to say they were out of chicken AND Turkey. This was a good chunk of my order and supposed to be a special dinner for my husband. I didn't want to substitute. \n\nI was asked to cancel it, but when I tried called the store I had called 6 times before somebody answered. \n\nIs this normal? Why didn't anybody call me to tell me they ran out sooner so I could make other dinner plans?"]], "date": "2021-06-05", "time": "02:38:53", "categories": "Event Planning & Services, Barbeque, Caterers, American (Traditional), Southern, Chicken Wings, Food, Restaurants", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 169, "predit_yelp_score": 1.675, "actual_yelp_score": 1.0}, {"review_id": "MIBcOFeyIu7sZhMHufHFUQ", "user_id": "Sk4LwSFrR-udUveIgbjiPA", "business_id": "W0Re-5UviF5pJoGf3ulifg", "review": [["The nicest hotel I have never stayed in Reno. I've been here 25 times in the last three years and this place is top notch. Great atmosphere, huge bar w tons of activities (skee ball, pool, bocci ball). Outdoor restaurant, indoor dining, great classy bar and views on the river. Excellent service! Staff is very attentive and knowledgeable. Free valet. You must stay here!"]], "date": "2017-09-27", "time": "01:09:57", "categories": "Hotels & Travel, Event Planning & Services, Hotels, Venues & Event Spaces", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 209, "predit_yelp_score": 4.925, "actual_yelp_score": 5.0}, {"review_id": "hcXzWaAdfqw-XPc8KHhSzw", "user_id": "EPUUU8vphFnESKfw5Ko1PQ", "business_id": "acY3cxelvpv1hMvC96lGsw", "review": [["I would give this place a negative if I could. This place is beyooooooooooooond disgusting. The manager is the absolute rudest person I've ever met with no understanding of what professionalism is. Now for the hotel room, let me list all that's wrong:\n\n-The cleanliness (our socks got black dirt markings just from walking on the carpet, the wash rags clearly have stains on them, and you can see soot marks on the base boards\n-The hotel is off balance and has multiple high/low points (We had a glass table in our room, I put my lip liner and some other pencil type items on the table and they immediately fell off. \n-The shower drain is plugged (We arrived yesterday, and hadn't taken showers or touched the shower till that evening so we know it wasn't somehow our doing)\n-The AC is disproportionate to the room and doesn't reach the other half of the room\n-The walls are PAPER thin(I could hear my wallmates entire drunken conversation)\n-Parking is on the other block and whereas that isn't my issue, the ghettoness of this parking structure was. There was people living in their cars and or very openly doing needle type drugs in their car, no security of any kind, and was just dirty. Wouldn't be surprised if my car gets broken into\nI've honestly stayed in better motel 6's. The hotel itself looks pretty but when you add up all the negatives and that managers inappropriate behavior it's honestly not worth it. My advice is to just pay the little extra and go stay at the casino hotels. At least their parking is in the same building."]], "date": "2021-10-23", "time": "15:09:12", "categories": "Resorts, Hotels & Travel", "city": "Reno", "state": "NV", "stars": 2.0, "business_review_count": 13, "predit_yelp_score": 0.675, "actual_yelp_score": 1.0}, {"review_id": "LXLPIoE7Z9USAkVcGWs0_g", "user_id": "Dh6OTRg1ajZ6QLZgbOTcBQ", "business_id": "I_mCFePUG2MGuH-zuws7bA", "review": [["I liked this place right away when I sat down, which doesn't happen very often. Casual dining spot in the same Plaza as Jus and Batch.  Every table had a bottled of water. The hostess opened the water bottle as we sat. The restaurant was pretty busy on a Thursday night. The server provided recommendations since I was having a hard time deciding. \nWe ordered the black bean burger and the double edge paleo bowl. Both very good. The aioli, that came with the burger, was delicious. I'm not sure if it is made of yogurt or something else. The cilantro lime dressing with the burger's side salad was also good. The paleo double edge came with perfectly cooked tri-tip. Now I have a go to spot if I want to get my veggie on! There were many items on the menu that I wanted try, so I will definitely be back. Oh and there was the tumeric latte. It was interesting and I enjoyed it, but I probably wouldn't order it again. I like my caffeine. \n\nThey have a rewards program but it requires something to be done online at home, I think. I didn't ask about it."]], "date": "2016-01-30", "time": "14:51:14", "categories": "American (Traditional), Breakfast & Brunch, Desserts, American (New), Restaurants, Vegan, Gluten-Free, Food", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 1227, "predit_yelp_score": 3.9, "actual_yelp_score": 5.0}, {"review_id": "Zv0wwj0evbniKnwExJobxQ", "user_id": "DThNvUdFQ88ol3-P7aOHpg", "business_id": "CBPodZLpZVUREZBd-pIp7Q", "review": [["Dr. Delacruz took my brother as a first time client at 3pm on a Friday when he was closing. He was on his way to a 3:30pm haircut but still took the time to see my brother who was only visiting for the weekend. He is very warm and welcoming. He did not make us feel rushed, and he did a very good job explaining everything he was doing. I'm glad to live close to a trustworthy chiropractor, and I will be sure to come in for myself when I need to!"]], "date": "2017-02-20", "time": "23:09:49", "categories": "Chiropractors, Health & Medical, Doctors", "city": "Reno", "state": "NV", "stars": 5.0, "business_review_count": 64, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "yGDfaIk6tKwVr_V8PygVOw", "user_id": "ugAosqATSKp2LZCVpymqUA", "business_id": "m2cZSAxeNhgfYDpAkW2mhg", "review": [["I love this grocery store! Great and very personable store manager really cares about his customers.  Whenever he sees someone walking the isles and reading signs, he always asks if he can help you find something.  Sale prices are incomparable to other stores. I upload digital coupons to my Smith's card before I shop, saving quite a bit of money.   Shopping and earning gas rewards is a huge bonus.  I end up saving my gas points and when I buy gas and it ends up being the cheapest in town."]], "date": "2017-09-21", "time": "13:48:17", "categories": "Grocery, Shopping, Drugstores, Food", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 71, "predit_yelp_score": 4.75, "actual_yelp_score": 5.0}, {"review_id": "XNmxvjqggjeHGh48Y_aF4g", "user_id": "7kdVBnGvWLlNteWawt2zXg", "business_id": "WP6581nNdDuLUpviESwpSQ", "review": [["I won't go anywhere else. They are always helpful, knowledgeable, and always seem to be able to come through when we have an emergency at inconvenient times. (And unfortunately these seem to happen more than I think they should!) Over multiple appointments and unfortunate frequent drop-ins, I have Zero complaints and only positive experiences. Again, the only place for me for tires and mechanical maintenance and emergencies!"]], "date": "2018-07-30", "time": "18:16:12", "categories": "Auto Parts & Supplies, Oil Change Stations, Auto Repair, Automotive, Tires", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 62, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 5.0}, {"review_id": "2UXGXXncSNCgHcEx-z6ZJQ", "user_id": "l2hmdMKML0zESJwjGE4dNg", "business_id": "UBIG1I0th2sSLekfXo-7jA", "review": [["Not my granmothers Mexican food, or even my nephew Pedro's half assed Saturday morning throw down.\n\nChips were good, salsa was lacking flavor. No spice, zero Mexican/Tejano flavors. Just tomatoey, watery salsa.\nAdd a chili or some cumin..maybe even a pinch of salt.\n\nI ordered the Shrimp/Octopus cocktail..really tough to mess that up except you don't expect a refreshing cocktail to be luke warm (seafood dish). A cocktail is supposed to be fresh and I understand its Reno but even here nobody wants room temperature seafood. Unless its cooked before serving, right?\n\nMy wife ordered Albondigas soup. She said it wasn't salty and made a face. I understood.\n\nService was awesome but they know their clientele.. I get it. Most seemed like regulars that made a lot of chit chat with the staff. The staff just smiled and played along in their best English possible."]], "date": "2017-07-23", "time": "08:09:20", "categories": "Mexican, Restaurants", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 500, "predit_yelp_score": 2.875, "actual_yelp_score": 2.0}, {"review_id": "JkCnLdod4sIc8Tauw-eB-Q", "user_id": "8Y6Odp_D9yjBZGR34hedyg", "business_id": "cE8U_UdSFT4U7rsLqFhZig", "review": [["If I could give 0 stars I would. We paid to get in the club then after 20 minutes of being there an employee threw a candle at my friend for no reason, and caused a huge welt. We ended up having to call the police and filing a police report. The manager did refund our money but it did not help with the issue AT ALL."]], "date": "2020-02-21", "time": "11:48:54", "categories": "Adult Entertainment, Nightlife", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 47, "predit_yelp_score": 0.4, "actual_yelp_score": 1.0}, {"review_id": "1a27H99J19jB4pAOriYcZw", "user_id": "zp9AdCRFVNmk0eWiFH1bUQ", "business_id": "qiPqy3DmtM1WRjmtzTFebA", "review": [["What can I say this place is truly one-of-a-kind!! And it is always a treat to find somewhere that serves my favorite meals from Germany! The decor is outdated... extremely... but that adds to the charm for me.  There is a dance floor in the middle of the room and a man was playing the keyboard and singing.(This was a Saturday night)  It was such a friendly atmosphere that after our meals we decided to have another round of drinks and enjoy the music... Even decided to join in when they played the Chicken Dance! \nIf you've never experienced authentic german food than this may be a surprise for you. I definitely think it is an acquired taste.  The prices were a little high, but where else are you going to go for Jaegerschnitzel? Things worth trying: Jaegerschnitzel. Its breaded and fried veal and it was delicious here! Also there potato pancakes are spot on!  I had the Saurbrauten which is like thinly sliced (beef I think?) and topped with a sour gravy.  The gravy was a little sour than I like it, but I think it was cooked true to the style, just not so much my style.  And I am usually a huge fan of red cabbage, but this one was a little too sour for me as well.  Spaetzle was great!!\nLooking for a beer to rinse it all down with? Franzikhaner is my favorite! A wonderful unfiltered wheat beer! The services was ok.  Although friendly, he seemed very forgetful as we had to remind him on numerous occasions after requesting another drink or more water, etc.\nThey have a great deli and bakery next door that is definitely worth checking out but you may want to go before your meal as they do close earlier than the restaurant.  All in all, this is one of those places I left pleased with because it was more than just a meal, but more of an experience!"]], "date": "2013-07-13", "time": "23:33:30", "categories": "Bakeries, German, Delis, Restaurants, Food", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 215, "predit_yelp_score": 3.95, "actual_yelp_score": 4.0}, {"review_id": "7CuGHzCkZNo0-HH8MLtzWg", "user_id": "lV-aP02yPrN-O9LzA22h1w", "business_id": "2oFeY8vJy_ujQPbmmnKSdw", "review": [["I found Reno Hospital for Cats when looking up a AAHA accredited facility in Reno. The doctors there are great and really caring. They take time to answer any calls with concerns and Dr Trosclair specializes in cats only. I can't recommend them enough."]], "date": "2013-01-14", "time": "23:19:49", "categories": "Pet Services, Pet Groomers, Veterinarians, Pets, Pet Sitting", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 26, "predit_yelp_score": 1.9250000000000003, "actual_yelp_score": 5.0}, {"review_id": "F1gtQ5mQh9IAbgxjXCH8Lw", "user_id": "v0ypmUP-uHhRPbNJxCN4gw", "business_id": "0eT3aABtCzZ2jw9iGVboaw", "review": [["Again, one of the best dinners of my life. Ramanza is always a solid choice for dinner and the best Italian in town. Corey is the most helpful/nicest manager that anyone could ask for. The food is exquisite, hand crafted magic and the employees are amazing. Angie, and Cynthia were amazing. They were there every time we needed them and are so kind. We will be back very soon. Highly recommend."]], "date": "2016-01-31", "time": "05:26:03", "categories": "Salad, Soup, Restaurants, Italian", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 262, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "5G2HR7D2O3maH5tP7px2MA", "user_id": "qWUZUQrUcfK224QiD-9MUQ", "business_id": "TebJaTyTkScemRVHZUAPoA", "review": [["We had a bridal shower catered and the food was amazing and and great price. Ryan was super helpful. Easy and perfect experience.  Everyone raved!"]], "date": "2018-03-03", "time": "02:14:03", "categories": "Food Delivery Services, Event Planning & Services, Delis, Sandwiches, Restaurants, Italian, Delicatessen, Mexican, Food, Caterers, Mediterranean, Coffee & Tea, Food Trucks", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 205, "predit_yelp_score": 4.8, "actual_yelp_score": 5.0}, {"review_id": "sYgjLV024t7Hudzoobnotg", "user_id": "qleK3Enl2161A6pZdVOICQ", "business_id": "bbQZwqg5mUVS8c0Exc6jHw", "review": [["If you know Downtown Reno you probably already know all about the Neva. I feel bad giving any establishment a 1 Star rating and I'll explain my decision. Due to the Neva having a ton of slot themes I like, I would probably give them another star for that. \n\nThis place has got to be tweaker central with all kinds of weirdos in and around the casino at all times of the day. (Nighttime is THE worst) What I can't stand is the hobos that aren't there to gamble or drink but, to just constantly walk around and ask people for cigs and or money. Like WTH do you even bother hiring security for?? Do you guys actually allow panhandling inside your establishment? \n\nOther than that I will admit I do love the nostalgic feel of the Neva, that old school vibe of Reno's heyday. Just wish they would do something about the guests that are hurting their business not helping it."]], "date": "2018-07-01", "time": "06:47:29", "categories": "Restaurants, Hotels & Travel, Arts & Entertainment, Casinos, Hotels, Event Planning & Services", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 283, "predit_yelp_score": 1.325, "actual_yelp_score": 1.0}, {"review_id": "HvwUaZpDtmiJelBP3A3egA", "user_id": "-v8nveSjJ3GihrRETN6j0Q", "business_id": "1ribsi4AUnJJjJxkd9SesA", "review": [["My girlfriend and I had an absolutely delightful experience. Neither of us are artists and we not even sure how to hold a paintbrush!\n\nThe guest artist was great. We were given step by step instructions and followed along with her lead. We had some friendly couples nearby who also were there for a date night and having a blast too. \n\nThe drink choices were good. We decided on raspberry mojitos which were wonderfully crafted and delicious. Drinks and art go well together it seems! We took home our paintings and have even been told they didn't turn out too bad!\n\nI'd recommend this experience for any couple looking to have a different experience for date night. Or maybe even a night where friends can go together and have a blast. By the looks of it most everyone appeared to have a wonderful evening, so yes....just go! Give it a shot :-)"]], "date": "2015-04-06", "time": "17:24:25", "categories": "Arts & Entertainment, Paint & Sip, Venues & Event Spaces, Education, Art Classes, Nightlife, Bars, Wine Bars, Event Planning & Services, Party & Event Planning", "city": "Reno", "state": "NV", "stars": 4.5, "business_review_count": 82, "predit_yelp_score": 4.85, "actual_yelp_score": 5.0}, {"review_id": "WlhJo1OMCjtd3Srt4e0gsA", "user_id": "jfsqNB8Ta-EqLT-7_CW6_w", "business_id": "LsF-tYAWHub3m2TuQGELKQ", "review": [["It's the MEN'S club and little boys are going to cry and hate. It should be called the people's club because there are some very well to-do female patrons that act the part of a boss just fine. But to be CLEAR, you need to have it together if you expect to come in here flossing. \nTo be even MORE perfectly CLEAR the entertainment in here is not ratchet it won't follow you home and your not going to end up with some STD from having been around the best in service Reno has to offer. \nThe security is gangster so do not try to test their mettle. The cops show up within seconds of their requests and I'm positive they wouldn't hesitate to put a warm hollow point in your cheek if you threaten or harm any of their coworkers. \nIf you are lucky and MAN enough, you may get into the back lounge, and if you REALLY know what's up you'll spend some great hours in the VIP with as many ladies as you can handle. Don't be mad if you don't qualify for the qualified are few and rare. \nSteve and Nate are the sibling proprietors and what makes their operation so upscale isn't only one thing. The sushi bar offers excellent options and drinks. The cuisine that can be found in the menu here is delicious and rivals some of the better restaurants in town. \nThe ladies... exquisite vintages and even though some other places may offer more variety the level of sophistication required to entertain at the MC means their catalogs are more exclusive. \nFinally if you do come here and you leave upset, there's a more than a likely chance that you just may not have been MAN enough for it."]], "date": "2021-04-17", "time": "04:08:59", "categories": "Adult Entertainment, Nightlife", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 105, "predit_yelp_score": 2.725, "actual_yelp_score": 5.0}, {"review_id": "KEB44FtDzPbglMEZGVWtxA", "user_id": "otBuALJ0o8qx8lOR6d1KMA", "business_id": "ELXPbZrMesEAlOp7LYUGAw", "review": [["I just have to give a review for the great team here! Melissa, Wyatt & Justin have been so incredibly helpful throughout the whole move in process (it was a super quick move in) and they were so awesome the whole process. I had one issue, my ice machine wasn't working and within 12 hours they had someone here and had it fixed. Derek called me an hr in advance to let me know he'd be here and got it fixed up very quickly! Not a single complaint so far! Highly recommend, safe quiet great complex!!"]], "date": "2017-08-28", "time": "16:57:40", "categories": "Home Services, Apartments, Real Estate", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 22, "predit_yelp_score": 3.65, "actual_yelp_score": 5.0}, {"review_id": "63dL2zsYdndvkehT3GBfLA", "user_id": "a2cnwcsrZS9e7-Rmp_EI4A", "business_id": "wz8ZPfySQczcPgSyd33-HQ", "review": [["One thing that's cool here is the water in the shower. Ouch!!!!!  It took so long to warm up that I wasn't sure it ever would.  The dark marble in the bathroom was very pretty and I had lots of time to admire it as I prayed for warm water and made myself coffee.  The coffee maker, microwave and refrigerator in the room make it cozy and welcoming. Back to the shower, somebody should have given such attention to basics as they did to pretty marble.\n\nThings that were less cool included the shabby housekeeping.  There was a half-eaten brownie in the refrigerator, a pair of old socks on the floor, an empty food wrapper under the sink, and a medium-size toy under the bed.  My young child was grateful for the toy and I was grateful it wasn't something harmful.  Maybe I should check under the bed myself now, in case there's something more?  Ugh, never mind!\n\nThe spa, arcade, movie theater, and shops in the basement are great.  They made the visit worthwhile.  There weren't too many people around, which probably explains why some locales were empty and some were in the midst of close out sales.  Too bad.\n\nWe came here because we were given free rooms and that's probably the only way I would come back.  My wife liked it more and says she'd return."]], "date": "2014-01-28", "time": "14:42:18", "categories": "Nightlife, Hotels & Travel, Arts & Entertainment, Music Venues, Hotels, Casinos, Event Planning & Services, Resorts", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 3345, "predit_yelp_score": 2.7750000000000004, "actual_yelp_score": 3.0}, {"review_id": "NY1QElGIO5DWJAAfx7AqCA", "user_id": "yqOKcvq885valD4FnY_r9A", "business_id": "MX7RKeGOoPgV4rh9v4LE-g", "review": [["Below is what I posted on Home Depot, but as I wrote it became apparent the Zero star should be placed with the proper place:\n\nI purchased a Tuff Shed with Home Depot.  The only thing that can explain the horrible customer service is that Tuff Shed treats Home Depot buyers of their product worse than their own clients.  This is my 4th she's with Tuff Shed, but the first time buying it through Home Depot.  I don't want to bore you with the details, but not sure what could more could go wrong when building a shed.  Their first attempt was more than a month ago and it's still not built.  \n\nI guess the real blame is on Tuff Shed, but at this point there is no contact with me, so maybe Home Depot should stop doing business with them in Reno."]], "date": "2018-06-16", "time": "20:22:13", "categories": "Shopping, Home Services, Building Supplies, Home & Garden, Contractors, Professional Services", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 40, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "JQI56_zYV37FNIwpUmIytw", "user_id": "2Sj_6bi5X14QO1PW-eAAbA", "business_id": "qKvQzhukpomdY3ITSSJ5eg", "review": [["Good service friendly service and they give us to try the ginger tea and boba was really good I like it"]], "date": "2018-12-10", "time": "05:13:58", "categories": "Bubble Tea, Food", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 200, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "Me4IlEeVohTIgRdDSySdQA", "user_id": "PiGj0hmRGIbzd4tRPhHvdA", "business_id": "6dDC5PSmPEoJYuM8r8dN_A", "review": [["Great products! Friendly staff!! Good prices as well!!!! I will be back as often as i can!!!!"]], "date": "2014-08-12", "time": "23:15:46", "categories": "Food, Grocery, Organic Stores, Specialty Food, Health Markets", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 375, "predit_yelp_score": 4.775, "actual_yelp_score": 5.0}, {"review_id": "eyYYgs7ET44pM5mw5BZXRQ", "user_id": "9s_yAVr5LrSmGs1MzWY-gA", "business_id": "4gXJxKmnGWLGseM7n3rd_Q", "review": [["After my previous review I got this message from Suzy:\n\n\"Really, I did my best. Your feet are a mess and you want to come in for $22.00 basic pedi and mani and want meto fix it . And I do know what I'm doing you shouldn't wait so long, for your feet. Best creams couldn't make them soft like you wanted. I could tell you were not happy while here. When I got here. And I know your not coming back your moving out state don't be so mean. Who knows what your looking for but may-be you should go to a place that your familiar with like WALMART\"\n\nNot very nice or professional. I wasn't trying to be mean, just honest. \n\nI also wanted to note that after a few days my polish started wearing off and my nails started peeling. My last pedicure (yes, at Walmart) lasted almost 2 months! I never complained about the softness of my feet... but I at least want the nails to be done properly and to last."]], "date": "2012-10-20", "time": "16:53:45", "categories": "Day Spas, Beauty & Spas, Eyelash Service, Hair Salons", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 13, "predit_yelp_score": 2.025, "actual_yelp_score": 2.0}, {"review_id": "V7g7vGLLWiVhUuToHqNULQ", "user_id": "MLMgli4h43UXF68WBZ5gdg", "business_id": "J6ZSgoKCLBDMMzuhM-aYGg", "review": [["i smelled something burning in the lobby and i informed the security officer  he seemed not the bit interested.  i sure glad it wasn't a hotel fire.  because i think i would have been charred in my bed. the repsonse  what might have been more customer orientated would be,  yes sir i ask about the smell, or yes we already know about  it and we are taking care of it. this place reeks of old farts. if your on a pension and have a catheter in a walker/wheelie baby this place is for you grannie!  bring your viagra!"]], "date": "2012-07-17", "time": "05:13:34", "categories": "Arts & Entertainment, Hotels, Hotels & Travel, Restaurants, Casinos, Event Planning & Services, Resorts, Venues & Event Spaces", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 934, "predit_yelp_score": 1.6, "actual_yelp_score": 3.0}, {"review_id": "TmHQKl0IM4BFy3snAr46FA", "user_id": "rcioQml40lNCDgNiQgSNhA", "business_id": "3FPi2yKCIh0Hh3iBg8faYA", "review": [["This is one of my favorite sushi restaurants in town. I was hesitant to go at first because the last two sushi places that shared this location were less than stellar. I took a chance and boy was I pleasantly surprised! My husband and I went three times in the same week! The appetizers are great and the rice ratio on the rolls is exactly how I like it. I can see us going back again and again."]], "date": "2017-08-16", "time": "23:56:41", "categories": "Asian Fusion, Sushi Bars, Restaurants, Japanese", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 836, "predit_yelp_score": 3.775, "actual_yelp_score": 5.0}, {"review_id": "e47AijT5NWeZUtuSnJoVGQ", "user_id": "Gv-D2ODquTBrmYiPVzxDlg", "business_id": "JbasD9GrfJ7SeiiucoizTA", "review": [["I had been to Chuck E Cheese's in the late 80s and their sister company Showbiz Pizza for parties when I was a kid and remember it being dirty, run down, and the pizza served was really really bad.  So I was skeptical when my toddler received an invite to a party that was being held there.  But, seeing as it was not about my wishes and it was about toddlers getting their fun on, me and my boyfriend packed us up and attended.  First impressions, I didn't expect this place to be that crowded.  It was more than crowded - it was hoppin'.  Several birthday parties were going on at once, and additionally, there were several small family groups there for the afternoon.  After checking in at the front and getting our hand stamped, we made our way to our section and scoped the place.  Every game machine was well maintained and clean, the animatronics were in great shape and engaging, the staff was on point (extremely helpful, courteous, knowledgeable and professional), and the entire place was cheerful and upbeat.  I was surprised that the pizza was actually decent, along the lines of something you would get from Dominos or Pizza Hut.  There was also a wing platter that had different flavors of wings and dipping sauce.  I didn't get a chance to check out the salad bar, but I overheard people talking about it positively.  The only things I wish were better: there needs to be more space between tables so people can scoot back and get up from the table without bumping into another party, and the actual din and crowd got to me a bit - I'm used to more quieter venues.  All in all, I was very impressed, and we are already discussing doing my daughter's 3rd birthday party (already have plans for her 2nd coming up) there."]], "date": "2015-12-13", "time": "14:36:42", "categories": "Restaurants, Arts & Entertainment, Buffets, Arcades, Active Life, Indoor Playcentre, Pizza", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 56, "predit_yelp_score": 2.725, "actual_yelp_score": 4.0}, {"review_id": "HPSEZSGm02pxowtIyuA3pA", "user_id": "vby4QFI3tgyJMLdQxeCbTw", "business_id": "qrn9ARB1gyJgAULFEi1Z1w", "review": [["Staff was great.  Food was pretty good. We had the south west chicken pie and sausage pie and were really happy with the selection.  Their salads were decent sized and well done.  Apple pie was awesome.  My wife who is a pie maker/snob was really impressed with the apple pie."]], "date": "2012-07-03", "time": "16:47:53", "categories": "American (New), American (Traditional), Restaurants", "city": "Reno", "state": "NV", "stars": 4.0, "business_review_count": 88, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}]