[{"review_id": "FK9_2sQlDgGagwpBfbezLg", "user_id": "yEDA968MHWpcyZlSKLKFFQ", "business_id": "J8vz_zwZaxzA585lV_k_vA", "review": [["If you have not been to Indochinois, and you enjoy French Vietnamese food... This is a must try!   The portions are on the small side, but big with flavor.  I recommend the Lemongrass Beef or the Bun Thit Nuong.  The Pho \"meal in a bowl\" soup is amazing and will cure what ails you!  The crunchy egg rolls are on it as well, and I suggest asking for mint and basil with them, and wrapping them up in the lettuce leaf with the egg roll and dipping in the the accompanying sauce with a little Sriracha.  This is a weekly stop for me, and once you go, you will be back Pho Sho!"]], "date": "2013-01-10", "time": "22:01:13", "categories": "Vietnamese, Restaurants", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 50, "predit_yelp_score": 4.6, "actual_yelp_score": 4.0}, {"review_id": "8r8jOOcMc21QsLLAVz5zzg", "user_id": "931K4fjIHYqwFqzDeTFLag", "business_id": "R9fJiYo5CnoikWXn25xNpg", "review": [["Food is terrible. The chips and salsa were Tostitos w store bought salsa. The wings were soggy and tasted bitter. My boyfriend and I couldn't even take more than one bite. If you go here, order the beer and not the food."]], "date": "2022-01-09", "time": "19:02:39", "categories": "Music Venues, Nightlife, Arts & Entertainment, Food, Beer Bar, Bars, Breweries", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 12, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "giUbJhaErz41dc8bR7Wdfg", "user_id": "mdPjd6x5O9YBZCLIwQba8Q", "business_id": "1aJGHPDnKyeNOZVE6Z6-dQ", "review": [["My husband is an ongoing patient of Dr Kwitko' s. Last year my husband had an eye emergency and Dr Kwitko privided immediate thorough and compassionate care. Just last week my husband again visited Dr Kwitko for follow-up of minor surgery and again I was very pleased at the very minimal waiting room time, the professional and caring office staff and of course Dr Kwitko himself and his expert treatment and follow up.  I feel so fortunate to have a great retinal expert in this area to care for my husband."]], "date": "2018-01-01", "time": "16:15:33", "categories": "Optometrists, Cosmetic Surgeons, Health & Medical, Ophthalmologists, Doctors", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 14, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "6TLAlbG_OJ7RHAlmi2STSQ", "user_id": "1bpf-MntotWRfDrjjgKbrA", "business_id": "EuzUT3fwPBWAHMXUiX5L8Q", "review": [["Fantastic breakfast.  Western omelet was perfect.  Home fried red potatoes were very fresh and grilled to a tee.  The rye toast alone is worth the trip!  Service top-notch, prompt and friendly.  Restrooms are very clean.   And the coffee is great."]], "date": "2017-09-27", "time": "15:34:51", "categories": "Cafes, Sandwiches, Restaurants, Vegetarian, Halal, Breakfast & Brunch, American (Traditional)", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 63, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "dogv48qfIEUM5081rZ9H0w", "user_id": "HMmBMOcvjGLevh0D_sT4qA", "business_id": "AsMmX7njOzFkWsJQ1jMVCg", "review": [["This place is awesome and has great locally raised beef and pork meat, farm fresh eggs, homemade beef stock, homemade sausages, tasty food and all for a good price. The boozy pig is half butchery half cafe, so all the meat they use they butcher themselves. So fresh, the taste is like no other. Their breakfast is also so good, I recommend the donut holes, the biscuits and chorizo gravy and of course the bacon! It's just all so good!"]], "date": "2019-05-03", "time": "00:19:05", "categories": "Tapas/Small Plates, Beverage Store, Breakfast & Brunch, Food, Butcher, Specialty Food, Sandwiches, Meat Shops, Restaurants, Cafes, American (New), Delis", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 134, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "lu5kU1y16zFdR8Lm6J7b4A", "user_id": "GDJpel1ZiwilghMQiMd79Q", "business_id": "s2FmB9YjpULaowp1rKDtvw", "review": [["Went here last night.  It was pretty cool to see all of the hulk hogan memorabilia in and outside the restaurant.  I ordered the margarita pizza which was pretty good.  When I'm back in Tampa again, I may check this place out a second time as I want to try some of their sandwiches.   The only downside is this place was really loud because of a band that was playing.  I think there is outside seating though."]], "date": "2015-02-15", "time": "19:26:07", "categories": "Restaurants, American (New), Beaches, Seafood, Active Life", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 284, "predit_yelp_score": 3.3000000000000003, "actual_yelp_score": 4.0}, {"review_id": "Av9B8WamK09ec3YgUpANGg", "user_id": "rS75501tvWlLaSgSLQ71rw", "business_id": "Tac9ES3xcFw-l0bChzQb4A", "review": [["Let me see where I can start with this Horrible Mexican Food Restaurant experience's I called in for a reservation for 13 people and when we got there we had to wait 25 mins for them to prep the table 2. First Mexican Restaurant that I see that there's NO WOMEN as waitress only MENS and the only WOMEN was the one in charge of cleaning the tables, that's called in my dictionary MACHISTA!!! 3. Waitress MEN was very unprofessional and very RUDE. 4. Mexican restaurant and NO HORCHATA and ANY AGUAS FRESCAS available, ONLY regular coke, sprint, sweet tea or water. 5. OH the worst part of everything I asked for a margarita and and tasted like toilet water...plus they were EXPENSIVE I lefted complete, just gave it one sippy. 6. Mexican Restaurant and can you believe NO GUACAMOLE availabe. 7. Kids meal include fries and guess what no fries available and they had the nerve to say that the plate was going to be full price 8. The plates didn't even include rice or bean they were extra charge. 9. Ordered a steak ranchero and no flavor had to add salt to get a little taste out of it 10. Ordered a shrimp QUESADILLA and plate came back with a Shrimo Taco and no rice and no bean and GUACAMOLE, so I asked at least for som pico de gallo and I was fckn charge. 11. Owner is very RUDE. To make the long story short the SERVICE SUCKS and FOOD is not good AT ALL.... Don't waste your money and TIME!!!!"]], "date": "2012-02-05", "time": "04:48:04", "categories": "Mexican, Restaurants", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 105, "predit_yelp_score": 0.55, "actual_yelp_score": 1.0}, {"review_id": "Qtvt5M86jl7nAVWQhzQ9Ag", "user_id": "KMN8mtY7qMW44kTYVujw7Q", "business_id": "Bs0JwJEUdfhL-FtLjuu3vA", "review": [["Not enough broth, cilantro, scallions, or jalapeños! Very bland. I won't be returning!"]], "date": "2021-02-16", "time": "20:05:19", "categories": "Vietnamese, Restaurants, Noodles", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 341, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "c8bKZ80s--rZVptx-acuQw", "user_id": "x7UU1bdc2INFrZFwp6yOPw", "business_id": "KIsSstR_0el76wWtADrTAQ", "review": [["Been having issues with cleaners around the Carrollwood area with something as simple as laundering a dress shirt.  Every time I have requested my shirts to be starch free , I receive them with starch its happened to me at nearly dry cleaner I have tried within a 10 mile radius of my residence.   Its a simple request and I explain that have a reaction to starch on clothing and not that I have to justify it either. \nI tried this place with the hopes of having a different end result,  unfortunately I had the same results with a starched shirt and then they tell me if i want it starch free I have to pay $6 not the $2 charge for a starched shirt.  \nIts unfortunate cause they were friendly and I was hoping for a better end result, so if any fellow Yelpers can make a suggestion of where I can go it would be most appreciated."]], "date": "2014-09-24", "time": "22:37:06", "categories": "Laundry Services, Sewing & Alterations, Local Services, Dry Cleaning & Laundry", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 6, "predit_yelp_score": 1.45, "actual_yelp_score": 2.0}, {"review_id": "xJsfXBx_Btjopu3FB_ssmw", "user_id": "3CKfIs9UkggP7h8ghz6FfA", "business_id": "fOergmiF9jTQ9wGBPrVepQ", "review": [["I had my Brazilian Butt Lift in April & I'm in love with it and I send all my friend here, the staff is very friendly and professional also has great bed side manor. If your planning on doing anything lipo surgery this is the place to go! I just started doing VeleShape here and can't wait to see how my treatments go."]], "date": "2017-02-09", "time": "17:21:24", "categories": "Doctors, Cosmetic Surgeons, Health & Medical, Beauty & Spas, Medical Spas", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 12, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "vuyZmNF1NPvCMdtBgCPF6w", "user_id": "QSIoCtJ1emofP1My3BfmHA", "business_id": "QHWYlmVbLC3K6eglWoHVvA", "review": [["We got a $15 for $30 CL Deal so Friday dinner at Datz it was! They must have renovated during the quarantine because the wrap around bar as soon as we walked in was definitely new. Instead of sitting off to the side, we opted to get seated at the table. We ordered two drinks off the tap: Cigar City homemade apple cider and a porter, the Hawaiian one was out which was a bummer. Then we ordered my favorite appetizer, Korean yum yum chicken. I am not much for chicken wings but this one is so sweet and tangy tasty and of course, being Korean I have to support it even if it's not as spicy as I would like. My husband couldn't resist the Darth burger adorned in a lovely toasted black bun with chips drizzled in ranch sauce and I got best side salad ever (that was the name, not my personal opinion).. I was less impressed by the side salad with epic name, but I ordered a cup of soup du jour, which was roasted pepper with gouda, and THAT WAS THE WINNER. The soup made up for the cocky salad with delusions of grandiose. It was nicely roasted peppery but sweet, dense and well mixed in with smokiness of gouda. We had a pretty decent service with the bartenders. There were only two of them and it was getting quite busy. I ordered one more drink, the salted caramel old fashioned. And even though it was nice and sweet, I should have probably not ordered it because it was quite potent and I think possibly made with Whiskey rather than a Bourbon, which made a difference in the morning after for me. \nOverall, pretty decent and glad they accepted my CL Deal with no issues. Now go read my DOUGH review which I did have issues using the CL Deal."]], "date": "2020-06-16", "time": "02:13:09", "categories": "Burgers, Bars, Restaurants, American (Traditional), Vegan, Asian Fusion, Cocktail Bars, Breakfast & Brunch, Soul Food, Sandwiches, American (New), Gastropubs, Comfort Food, Nightlife, Wine Bars, Delis", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 3260, "predit_yelp_score": 3.375, "actual_yelp_score": 4.0}, {"review_id": "bFNWxQj-5WaNtU6xKZ2eHA", "user_id": "Q1RVGnu06Vj7yLa2pWp-yQ", "business_id": "_u-lSQ9OcgR8fHkv_atehQ", "review": [["Una sola extrella es solo por la señora que atiende enfrente en la caja es demaciado pesada, mal educada no sabe como llevar ese lugar es un horror ella, le crita a los meseros cuando estan atendiendo a los clientes ,no save lo que esta haciendo 0 profecionalismo,nunca contestan el telefono he llamado asta 18 veses seguidas, no trabajan en orden, es un desorden total no tienen una buena Organización. Pero la comida tiene un sabor delicioso todo lo que e provado alli me encanta,"]], "date": "2020-08-15", "time": "21:21:34", "categories": "Restaurants, Latin American, Peruvian, Seafood", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 54, "predit_yelp_score": 2.5, "actual_yelp_score": 1.0}, {"review_id": "GOfSYg2Ih4P6OsCXR7K8JQ", "user_id": "5kGVjBE11L64l_hYN-ASZQ", "business_id": "hk1KO4rAxGDgwlNSAO54yA", "review": [["Local cute park    My son and I have picnics here and we bring our dog most if the time. Nice clean place by the water with a nice pier.   place to let the kids play!"]], "date": "2013-08-27", "time": "19:36:15", "categories": "Active Life, Playgrounds, Parks, Fishing", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 74, "predit_yelp_score": 4.800000000000001, "actual_yelp_score": 5.0}, {"review_id": "RRMwZwZqAZbUNFW_DCqWpw", "user_id": "57odq0YF9ShPZnE5W3H58g", "business_id": "Ny6IoMTUnRO0EwtkLt8W6w", "review": [["The food was authentic and delicious.  We read some reviews before coming that the service was slow.  There was only 1 server when we came in.  But we were OK.  She brought us a relish dish that kept us filled until the food came.  The fried chicken was super tender.  The Japchae also delicious.  The server was very nice.  I look forward to coming back again."]], "date": "2021-06-13", "time": "18:47:53", "categories": "Barbeque, Restaurants, Korean", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 83, "predit_yelp_score": 3.9250000000000003, "actual_yelp_score": 5.0}, {"review_id": "4CM4QN4_K8yZBIQBDpUevg", "user_id": "XUBi3SnqHGzH9WOHEAqmmQ", "business_id": "oGjhYdT6jaKzh6E7EyqKOw", "review": [["My package was shipped on June 18 from Naples FL, 1 month later it is still in transit with no updates since it landed at this distribution point. I am at a loss for words. How is it that this place has not been thoroughly investigated? This is a disgrace. I paid $100 for 2 day priority shipping for my item. This is truly atrocious. Customer service is of no help!"]], "date": "2020-07-18", "time": "18:27:17", "categories": "Public Services & Government, Post Offices", "city": "Tampa", "state": "FL", "stars": 1.5, "business_review_count": 40, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "vKBfRjnZNTnxw8mhsqmKTA", "user_id": "pou3BbKsIozfH50rxmnMew", "business_id": "iH3LWJ6yisLnGEnd6Ch29Q", "review": [["Why 4 stars? Because this is a great addition to Harbour Island.\n\n   ---   ---   ---\n\nMy experience is limited here, as I have only tried the Noah Bagel - lox, capers, onions, etc.\n\nI find that these don't range very much from place to place, so I don't judge Cry Baby solely on my one meal... what I dig is the vibe. The decor is hip and trendy. The bay doors are up, which leads to the an open air venue. They have a cooler with fancy sodas.\n\nI'll be back for lunch, and look forward to it!"]], "date": "2014-04-01", "time": "04:48:14", "categories": "Sandwiches, Restaurants, Breakfast & Brunch, Cafes", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 117, "predit_yelp_score": 3.6750000000000003, "actual_yelp_score": 4.0}, {"review_id": "DTR0zNaAaV02nQEdYp5Tew", "user_id": "gVzan-ALI1w1jGrUceaofg", "business_id": "n_McF_t9JQiax1uiued-Yg", "review": [["This has been the best theatre my husband and I have been to due to the seating.  The only thing I wish it had was a bigger screen, were used to having a ginormous- almost IMAX- screen in Hawaii for regular screening on new movies but it's ok, the amazing seats make up for it.  We experienced great customer service when we mistook the screening of Pirates of Caribbean 5 and almost missed 30 minutes of the movie.  Since they moved the room around that day, there was confusion of where to go when we were already rushing to our seats after being 45 min late, the manager (I wish I got his name) made it right and giving us the 12pm showing at no fee.  It made the sucky day into a great day since Pirates of the Caribbean is one our favorite franchise.  I think it's worth upgrading to AMC membership for $15 a year because they don't charge you $3 every time you buy your tickets in advance.  We wish we knew that because we saw 10 movies since Nov and we made up the $15 annual fee already from the $3 fees we paid reserving our seats.  Will definitely do it next year, just depends how many movies we feel like watching.   It's a great movie theatre, a bit far of a drive from central Tampa therefore watching the movies before 12pm for the matinee price and reserving your seats for $3 is worth it for the type of seats you get.  It gets colder than usual theatre too but you can bring your own blanket and enjoy.  We used to go to the AMC at the mall and for the same price, the seats there are not so nice as Veterans."]], "date": "2017-08-13", "time": "19:36:38", "categories": "Cinema, Arts & Entertainment", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 155, "predit_yelp_score": 3.65, "actual_yelp_score": 4.0}, {"review_id": "AZNvvjM_Jg9Ere4AKxUpDQ", "user_id": "OkX3CP9LOf0-gsKZC_WkkQ", "business_id": "ROnkVXPz5jRlMQvLw05UEA", "review": [["Cappy's is the real mvp... why have a pizza rivalry when they bring both Chicago and New York style pizzas together! They have truly mastered both styles and we get one of each every time we visit. The deep dish is so good and the ingredients always taste fresh. The New York style is cheesy and the slices are huge. I've had the Greek salad and garlic knots which are also delicious. This is one of few remaining pizza spots that you can eat AT the restaurant and feel at home. I love the decor inside and that they have trivial pursuit cards on the table. It's a cozy atmosphere, yet it is large enough to accommodate the large crowds that always gather here."]], "date": "2018-01-09", "time": "13:36:00", "categories": "Pizza, Italian, Restaurants, Greek, Salad", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 136, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "UTqyd0BjO6-Pqk3aHADpog", "user_id": "nZE77LxMEj9y7WlZT1cEAA", "business_id": "a_ts6C7QntisENtyitJRBw", "review": [["Saw on Tanya & Matt's Ice Cream Instagram page that they had a uncorn ice cream to celebrate back to school! \nSo we had to stop by, my son loves ice cream and was so excited for the unicorn ice cream! I chose a cake cone for him but you can use another cone or a cup totally up to you! I chose the Oreo Red Velvet with a chocolate dipped cone, it was really good with big chunks of real Oreo that we're nice and soft! I can't wait to go back! They have new owners and have done a great job decorating and known they have much more planned so make sure you check out a new female owned business in the area! For more foodie content follow @Eateanderandslay"]], "date": "2019-08-21", "time": "15:11:32", "categories": "Ice Cream & Frozen Yogurt, Food, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 111, "predit_yelp_score": 4.799999999999999, "actual_yelp_score": 5.0}, {"review_id": "A2c0yi56Di8BX0NkS4bM5Q", "user_id": "avXvMybPionb-Kt_MX5Grg", "business_id": "yui1n1JawiW9g7RR62a_wA", "review": [["This review is for Take Out only. \n\nIn my opinion, you just can't get a full on review quality experience.  So, this is just for the food.  \n\nEH. I ordered Bi bim bap and ban chan.  Nothing to exciting you know.  Ban chan is never a disappointment and it's always delicious.  NOMS! But the bi bim bap was so average and unremarkable that I cannot think of what to say about it.  I think that means I'm under-whelmed or unimpressed, for whatever reason. \n I actually started thinking about Austrian Peppers while I ate this, and that's not even korean food. I will say this...the portion of beef in my Bi bim bap was quite small and most of the dish is vegetables!! THAT'S A WIN FOR FUTURE SKINNY, RIGHT!!\n\nReally nothing stood out.  Oh well!  Maybe if I ever come back, I'll try the sushi!"]], "date": "2015-02-10", "time": "18:01:35", "categories": "Korean, Sushi Bars, Restaurants, Japanese", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 594, "predit_yelp_score": 1.925, "actual_yelp_score": 3.0}, {"review_id": "yMw5cN0N5cQRbWHXqArmqg", "user_id": "bOqivBmdkBA-vbDLYKY9Ig", "business_id": "WZetZIViVEVc3jUDTZEnUQ", "review": [["Wow, these guys are amazing.  This is one of the few places I feel really has the best interest of the customer at heart.  My son and I brought in an old go-cart with four flat tires and instead of trying to sell me a bunch of expensive tires or lecturing me on how I got ripped off and should buy something from them. They figured out how to fix what I had and really only charged me a service fee.  I left over whelmed at being treated not only fairly, but with true kindness.  I only wish there were more companies run like this one.  I can't say enough and could not recommend them more highly. \nMark and Shane from Odessa"]], "date": "2016-06-14", "time": "14:07:28", "categories": "Automotive, Boat Repair, Professional Services, Auto Repair, Oil Change Stations, Motorcycle Dealers, Motorcycle Repair, Boat Dealers", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 8, "predit_yelp_score": 2.9749999999999996, "actual_yelp_score": 5.0}, {"review_id": "vV9Zv3-y6l6bkLr90BwpQQ", "user_id": "uQL-fNMqRPqysomgboaX4w", "business_id": "-gUWjjws4u95dLuulwyqGg", "review": [["I love being a patient here. All of the staff members at OPT-ISM are very friendly and accommodating. They also have great, overall patient service skills. Dr. Sabin is very kind and knowledgeable as well. He doesn't rush you through your appointment. He actually listens to what your concerns are, while making sure that your vision needs are met. They are also pretty affordable. I highly recommend making an appointment!"]], "date": "2020-02-28", "time": "22:06:35", "categories": "Health & Medical, Shopping, Eyewear & Opticians, Optometrists", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 42, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "pNZfThmCRh79rMOIXXfT7Q", "user_id": "PcKYgil8utvv1YyA9X3_eg", "business_id": "sankqYOVWpYX_T5kGZRRKQ", "review": [["Love this place! It's not a fast food restaurant so it may take a little longer but everything I've ordered thus far has been hot, fresh and delicious. The restaurant is clean and the staff is friendly. You can tell they truly care about their customers and service. So excited to find this place!"]], "date": "2019-05-13", "time": "14:18:21", "categories": "Cafes, Sandwiches, Restaurants, Coffee & Tea, Breakfast & Brunch, American (Traditional), Food", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 399, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "ZuMf1nhJbILH4qFzneqsOQ", "user_id": "gVzan-ALI1w1jGrUceaofg", "business_id": "1bwEz9wJwgfNFnBdW-rWkg", "review": [["This is a decent Asian Store.  It's not an Asian Supermarket like they have in the West, therefore if you're expecting a Walmart looking type of store then you're too narrow minded.  They have good selections on Asian things and have good parking area (unlike in Hawaii Downtown, you have to pay and fight for parking).  The cashiers are nice people, they're just trying to make a living in this world. They have great selections of ceramic things and melamine spoons and serving spoons."]], "date": "2017-04-24", "time": "16:22:35", "categories": "Vietnamese, Home Services, Grocery, Restaurants, Real Estate, Food, Homeowner Association, International Grocery", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 31, "predit_yelp_score": 4.025, "actual_yelp_score": 4.0}, {"review_id": "QzSggpfMRPuDIwjIIafkkg", "user_id": "tHRP6IdWYFEXRNOAukVdrw", "business_id": "mt2fNZpZAd-PU99aK6wf9A", "review": [["Wow! Absolutely worth every dime. This is authentic Italian food.  Great atmosphere and busy.  The food\nWas great."]], "date": "2020-10-04", "time": "01:15:19", "categories": "Restaurants, Italian", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 265, "predit_yelp_score": 4.75, "actual_yelp_score": 5.0}, {"review_id": "K4HJZodKBziPTUwvtZw2dQ", "user_id": "j2U3vqFITOGULdxhZW-5uw", "business_id": "wNeZKc1VhdwvioiLAgNPMw", "review": [["This was my first time here, and I told the cashier that and she was really nice her name was Issa. Explained the whole menu to me and was very friendly. Customer service overall was good. The food took a really long time to come out which I thought was weird because it wasn't really busy. The prices do not match the portions size. A side of fried rice was 6$ and they up charge for fried rice. They need to have a small bowl and a large bowl because the regular size bowl is way to small for 10$. The fried rice wasn't really that great quality wise. I wouldn't come here again, I will definitely just stick with the Asian mom and pop shops they are less stingy with the fried rice lol."]], "date": "2021-03-21", "time": "00:08:56", "categories": "Sushi Bars, Chinese, Pan Asian, Restaurants", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 45, "predit_yelp_score": 2.725, "actual_yelp_score": 2.0}, {"review_id": "DkueCr9zTH-hRHr81sjIOg", "user_id": "xGcewh9mX82tZRkWPiV1eg", "business_id": "Ks4r6DEqSbV8D2qc04RhTA", "review": [["Excellent BBQ joint...\nI've been here three times in three weeks and have yet to be disappointed. The ribs are well seasoned and fall off the bone tender. The brisket is succulent and melt in your in your mouth good. The smoked turkey is moist and flavorful; you can definitely taste the smokey goodness. The Mac 'n Cheese is as down home and close to how gramma' used to make it as you can get. The beans are not too sweet with just the right amount of tang and brisket pieces. Lastly, but certainly not least; Missions is affordable.\nSuperb. Superb. Superb."]], "date": "2017-09-20", "time": "22:53:14", "categories": "Barbeque, Restaurants", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 344, "predit_yelp_score": 3.6999999999999997, "actual_yelp_score": 4.0}, {"review_id": "YKYQsr-yfmTsTsXH4mqgVQ", "user_id": "7CM4d0O80Jwy5M8VhEr3vA", "business_id": "RqW9S4WG9UYZHKhHRHXJZg", "review": [["This place is just addicting.  Fish tacos, ribeye sopes and tacos are my family favorites."]], "date": "2020-09-01", "time": "20:30:52", "categories": "Ethnic Food, Restaurants, Specialty Food, Mexican, Food", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 1449, "predit_yelp_score": 3.225, "actual_yelp_score": 5.0}, {"review_id": "ZQXicqALAyub0DV6EyL0bg", "user_id": "WAZ7U-ZnKxVfeGti12ICCg", "business_id": "K3WFxC7jQx39qZSJwPkqZg", "review": [["Just getting back and I don't know why I ever stopped (holidays...)\nThis is an AWESOME workout. Try platform when you're ready- LOVE Pure Barre!!"]], "date": "2017-03-23", "time": "00:54:12", "categories": "Fitness & Instruction, Barre Classes, Active Life, Cardio Classes, Shopping, Women's Clothing, Fashion", "city": "Tampa", "state": "FL", "stars": 5.0, "business_review_count": 33, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "66dgg-HTWEgSZAoZWH6-7A", "user_id": "Fh_82-7B9BV-54Lav1bLDg", "business_id": "s4nlPf6kXz97uk0yerqmHg", "review": [["This is a vegan restaurant owned by two Black chefs that sell flavorful foods that appeal to all of the senses all at once.  It's located the Ybor Saturday Market at 1901 N 19th St, Tampa, FL 33605.  The atmosphere is awesome.  You can see historic Ybor from where I was sitting at.  The decoration and painted arts on the wall reminded of African cuisine.  The food was delicious, and the staff was helpful and courteous.  The experience was a memorable one."]], "date": "2020-10-26", "time": "03:09:45", "categories": "Vegetarian, Juice Bars & Smoothies, Organic Stores, Food Delivery Services, Restaurants, Vegan, Caterers, Desserts, Food Stands, Event Planning & Services, Food, Pop-up Shops, Shopping, Cafes", "city": "Tampa", "state": "FL", "stars": 5.0, "business_review_count": 12, "predit_yelp_score": 4.7, "actual_yelp_score": 5.0}, {"review_id": "1g_7LHYeLJH21jt0DTKHbw", "user_id": "KqnrhObOdytQIfePUUHcEg", "business_id": "McA-IeWg6NjPXGLUl-AbFg", "review": [["They responded after hours promptly and properly performed the job for the agreed-upon price. Employee was friendly and knowledgeable."]], "date": "2018-07-26", "time": "21:28:25", "categories": "Plumbing, Home Services", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 37, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "T6CidzPGqB4HaKNRoSvNdg", "user_id": "eo2Y8Urd8l0x1rPJula2Uw", "business_id": "Aeoxw5AuI_yi0YWFtLlaVQ", "review": [["Quality pizza makers here! Double pepperoni pizza and a well done bbq pizza salami, Philly meat, bacon onion and pepperoni perfectly cooked."]], "date": "2019-07-20", "time": "16:21:49", "categories": "Restaurants, Pizza", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 15, "predit_yelp_score": 4.7749999999999995, "actual_yelp_score": 5.0}, {"review_id": "GaBjx-EaciluQOSnLqzDiQ", "user_id": "zJJcSYKp6oc1OU1dOd4gfA", "business_id": "j4KA-BujEH7xmG6bD5E-gQ", "review": [["My husband and I finally tried Sacred Pepper tonight.  It is very nice...decorated very tastefully inside.  \n\nI started with the Sacred Pepper House Salad.  I was not a huge fan of the coconut vinaigrette.  To me it just didn't go with the salad.  My husband liked it though.  The complimentary bread was pretty good, although we were lukewarm on the sun dried tomato olive oil for dipping.  I ordered the salmon entree and my husband got the ribeye.  We both felt like both entrees were under seasoned, but especially the ribeye.  It was pretty bland.  \n\nOne of the specials tonight was a chocolate lava cake for dessert. Being that it is one of my husbands favorites, that's what we ordered.  The cake had a weird texture, almost sponge like, not in a good way. And it wasn't warm like what a lava cake normally is.  The normally runny center was more of a chocolate glob...it did not ooze out.  The ice cream that came with it was delicious.  And they make their own ice cream in house.\n\nNot sure if we would go back for just an average meal.  Maybe we'll give it another try."]], "date": "2016-08-07", "time": "00:36:44", "categories": "Restaurants, American (Traditional), Food, American (New)", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 548, "predit_yelp_score": 3.125, "actual_yelp_score": 3.0}, {"review_id": "qOkTPOjIrWPsE7pawb2acw", "user_id": "sCi7Ky0D8JHykuhr5xO93Q", "business_id": "0qy03ppOu4-c1b423atUmQ", "review": [["Great selection and quality.  I go every couple of months and stock up and am never disappointed.  The employees help with recipe ideas and their suggestions are always on point."]], "date": "2021-03-15", "time": "13:52:36", "categories": "Meat Shops, Food, Grocery, Specialty Food, Seafood Markets", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 43, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "VJYJSbmLPVhW21Ztdmv6fA", "user_id": "gVzan-ALI1w1jGrUceaofg", "business_id": "RiC_-68qxtDJqiIs5mRR6g", "review": [["It's was ok.  The decor was on point and romantic, especially this time of the year.  Pasta was nothing special, our waitress wasn't very attentive.  We wanted to go home when she gave us our boxes to go meal but it took her what it felt like 15 min to give us our check.  I guess she wanted to surprise us with free lemon cookies for our anniversary but we didn't really want it.  Anyways, I got the linguine clams which was good but nothing spectacular.  I like how chopped clams were mixed with the saw and you just don't get the shelled clams.  The calamari were buttered light but was too salty.  It felt like Assagios in Hawaii but I like Assagios better with the scallops butter scampi."]], "date": "2019-11-26", "time": "04:50:54", "categories": "Bars, Italian, Restaurants, Nightlife", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 586, "predit_yelp_score": 2.6, "actual_yelp_score": 3.0}, {"review_id": "EqM7_saYOnivZkA6Ikklhw", "user_id": "Pjca_7hm05TpawOcKQkw5Q", "business_id": "mY4i1N0Hm2fjIgU0Eyn11Q", "review": [["Let me start off by saying that our visit to this wonderful restaurant really turned around a very negative experience that we had at another restaurant , about an hour prior to checking out Acropolis Greek Tavern. \n\nAs soon as we walked in, we immediately felt less tense, because the interior is quite eye catching! It is open, well designed, with bright clean areas. White and blue colors fill the room, it's really refreshing to take in. \n\nWe were very quickly greeted and seated by our server for the evening, his name is Jeffrey, who is an absolute gem. My fiancé said that if we were ever to own a restaurant one day, that he would be the caliber of staff we would hire.\n\nHe works so efficiently, meaning that he works smart, not just hard. He has mastered the skill of preemptively providing service, because he fulfills  requests before guests even have to ask for it. He doesn't overdo it, the perfect amount of checking in and being present, that one feels very well taken care of, but not hounded. He really is an impressive server. \n\nI had white wine to start off with, the house Pinot Grigio and later switched over to Tito's and soda. \n\nOur food experience: \n\n*saganaki (which Jeffrey presented beautifully, flambé style, table side).\n\n*calamari which was perfectly seasoned, not \n\n*side Greek salad (I love cheese, and the chunk of feta which I took home with me was creamy and flavorful).\n\n* Gyro trio was very tasty \n\nWe ended up taking food home, which after eating today, I can confidently say is well worth the visit here! \n\nThe women's bathrooms are very clean, with a baby changing station and good lighting if you need to touch up your hair/makeup. \n\nThey have a hookah station on the premises, which I'm sure adds to the overall dining experience, because it's a pretty interactive thing for guests to park take in. \n\nI can't wait to come back on a Friday or Saturday evening, dressed up and ready to sample more from their extensive menu. We will definitely check out the inside bar, perhaps during happy hour one day. \n\nThank you Jeffrey for your fantastic service, we will be sure to ask for you by name when next come to visit."]], "date": "2021-07-05", "time": "20:02:26", "categories": "Restaurants, Mediterranean, Greek, Beer, Wine & Spirits, Food", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 332, "predit_yelp_score": 4.550000000000001, "actual_yelp_score": 5.0}, {"review_id": "xe2WS4K8l2kW3xWnTOD1AA", "user_id": "PpVtxDCgWgtNJr1TJjlNEA", "business_id": "4wy0zuo-j7uOckJeoJw4uQ", "review": [["Poor customer service, long wait times due to employee issues and average bagels. There aren't many other options around Tampa for bagels but this is not the right choice regardless."]], "date": "2018-02-04", "time": "14:46:43", "categories": "Delis, Coffee & Tea, Bagels, Food, Restaurants", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 57, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "nf_xOzzd4rqT3JmVCEfDKw", "user_id": "pAhQtrUWUaS3E9teYbMSKQ", "business_id": "ixPTo6Hum7nNZ7A4VPhTXg", "review": [["Visited Brickhouse on a Sunday evening hoping to catch the football game. We ordered  the chicken and waffles, big portion and very good, and the brick grinder which was a wrap. Both entrees were good and would definitely order again; this is a great place to watch a game, grab a bite to eat and have some drinks. Overall the atmosphere is fun, the food is good, and staff very friendly. The only two negatives I found were, the food/drinks were a bit overpriced for what they were. Second the parking is a challenge, the place gets packed and sometimes you just can't find a parking spot. Will definitely be going back to check out happy hour."]], "date": "2013-11-11", "time": "16:53:50", "categories": "Restaurants, Burgers, American (Traditional), Bars, Pubs, Nightlife", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 561, "predit_yelp_score": 3.75, "actual_yelp_score": 3.0}, {"review_id": "X5vMF5K-rvylvDmod3yBXg", "user_id": "FTAQXNVx7fQxqJLouJQWug", "business_id": "qGtPd-sk178XvrN38D3kzQ", "review": [["Menu is way too large, waffle was good. Omelet was ok. Portions are large. In general the food was good, was expecting more out of the menu"]], "date": "2016-12-18", "time": "12:31:26", "categories": "Cafes, Restaurants, American (Traditional), Breakfast & Brunch", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 394, "predit_yelp_score": 2.6, "actual_yelp_score": 3.0}, {"review_id": "A18e7kFQmUR-jdzS5vCf-Q", "user_id": "r1k27eQ489oYQvmlMHAksQ", "business_id": "H5Rk-aunuEzGANXCBu-NPQ", "review": [["My favorite place for great Mexican food. Excellent food and cool relaxing atmosphere. We love the enchiladas verde!! And they surely don't skimp on the Cabo Wabo in their margaritas. So much so that now we only use Cabo Wabo to make our own margaritas."]], "date": "2018-06-07", "time": "23:38:43", "categories": "Seafood, Party & Event Planning, Event Planning & Services, Restaurants, Mexican", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 907, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "MnLyRQWaSarkNygbnqGQwQ", "user_id": "bCn8JIdnXyEFROm9iqQVdg", "business_id": "roKcuykq_7CNMcTGtNUmYg", "review": [["Went here for lunch today!  After waiting 45 minutes for food we left.  They were not busy but seemed very unorganized! Waitress could have cared less!  \nWill not go back there!"]], "date": "2017-01-01", "time": "05:30:37", "categories": "Restaurants, Chicken Wings, Nightlife, Bars, Sports Bars, American (Traditional)", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 103, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "Qk2MUOs03OIJT7pyxf0VCg", "user_id": "jScRVBSRFAIvXaBJ1-keHw", "business_id": "B1izyRia1wZ6EwbRqIAO7A", "review": [["Amazing and fresh Thai Food!! Ordered the egg rolls and skinny glass noodles. Some of the best I have gotten"]], "date": "2021-10-14", "time": "19:31:31", "categories": "Thai, Restaurants, American (Traditional)", "city": "Tampa", "state": "FL", "stars": 5.0, "business_review_count": 61, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "DZcl5P1uofhpKm7dD5pjrA", "user_id": "91GVTZIa0-yaWMn1l-lw5Q", "business_id": "3usX3vsUz1aM6-er2SMycw", "review": [["My husband bought pre packaged lettuce at Publix on cnr of South village and Northdale Mabry. I have shopped here for 25 years. I noticed the lettuce was brown with a runny liquid inside the package.   I returned the lettuce thinking I will just swop it out. All the lettuce of the same brand in the same packages were in various stages of similar deteriorated condition. I mentioned to the sales assistant at counter. She offered no apology. She took my old lettuce and threw it in the garbage can did a till switch with my new purchase. I suggested to her to please let the produce manager it at least the store manager know the condition of his product so he can rectify. She was non committal and did not give me eye contact. I walked out puzzled as to why this Publix has changed. So I'm putting this on yelp so maybe things can improve. I will continue to shop there but will be more careful with my purchases."]], "date": "2018-10-25", "time": "16:35:31", "categories": "Food, Grocery", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 21, "predit_yelp_score": 0.9, "actual_yelp_score": 2.0}, {"review_id": "VWrOKIvI_neDEiZmF8r3BA", "user_id": "Cb1OYYFoOuSWNhdhUxGC-Q", "business_id": "YVvm1Q3ir5TET0f66FOX_g", "review": [["This is by far the best Italian food I've had in Tampa! The food and service is top notch. Reasonable priced. Our server \"Sunny\" was aces!"]], "date": "2018-05-30", "time": "03:33:35", "categories": "Restaurants, Italian, Seafood", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 210, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "76N8x4ggt0zGKgbdiWuwGw", "user_id": "pou3BbKsIozfH50rxmnMew", "business_id": "6Ngr2OBI6SIA3_AYxx_lZA", "review": [["Why 5 stars? Because this is certainly one of the most unique ways to spend a day.\n\n   ---   ---   ---\n\nI've never even remotely considered going sky-diving, for real. There is a zero percent chance I'll ever do it. And it's not because I think I would die... I actually fully trust the odds that everything would be a-okay, and that I even might really enjoy it after it's done. But I just cannot bring myself to get into a plane, go up in the air, and then jump into the atmosphere. Nope, never going to do it.\n\nBut a controlled environment with gigantic fans powering you up in the air? Sounds like a fun Sunday!\n\nAs he does most of the time, unless it's letting his family bully him into going to chain restaurants, Chris W really came through here. I probably wouldn't have gone through the trouble of actually visiting iFly, but he found a Groupon that allowed us to score quite a nice discount, and I was sold. \n\nIf you're a beginner, they tell you ahead of time that this will be somewhere north of an hour and a half long, and that you'll only be experiencing two minutes of actual pseudo sky diving action. I was kind of annoyed by that beforehand, but after actually experiencing it, I feel a lot differently.\n\nOnce you're inside the tunnel, time drastically slows down. On both of my runs, I felt like so much time had gone by, but I'd only used 20 seconds of my minute. You are concentrating so hard on following all of the instructions and keeping yourself balanced, all while kind of freaking out that you're floating on air. It's quite a different feeling.\n\nYou can opt-in for the high-fly, which I definitely recommend. About halfway through your second run, the instructor will take you about halfway up the tunnel several times. It's great because he/she does all the work and you just get to enjoy the ride. It's pretty surreal and makes the experience that much better.\n\nOnce you visit a few times, you can work on your skills and get better and better to the point where you can go back in without an instructor. It's definitely tempting, because at the end, our instructor went in and showed off his very impressive skills. Imagine someone literally being able to fly around like Superman, and that's what he did. \n\nThe only problem is that you will definitely drop some serious money to get to that status, and as much as I enjoyed it, I don't know that I would want to be on the hook for that much cash. But I could definitely see getting into it if I had a few more bucks to spare.\n\nThis really was a super cool experience and I'm so glad they built one in Tampa Bay!"]], "date": "2017-11-14", "time": "17:27:14", "categories": "Active Life, Skydiving", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 79, "predit_yelp_score": 3.0749999999999997, "actual_yelp_score": 5.0}, {"review_id": "Jlw7-KhxsI8ogwqZZt1xkg", "user_id": "kIYnDGaUm6db9_xe762TiA", "business_id": "R_7IvtCqjLpcdZjAdyQYBQ", "review": [["Very smooth roller coaster with awesome boosters! Def. One of the top 3 roller coasters at Busch gardens."]], "date": "2017-09-04", "time": "23:10:43", "categories": "Active Life, Amusement Parks", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 72, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "Ja3x8wdmSU6-U0vEE_3TuQ", "user_id": "ubbZBXmvO5EZC4OujhZTng", "business_id": "lnzvlkjKKPLatw6Y7ThcaQ", "review": [["This was the best Gelato in the Tampa Bay area and it closed for good this week.\n\nThank you International mall for racking up their rent! I had been going there for over 5 years.\n\nNow thanks to that bullshit monstrosity of furniture gallery they opened there the mom & pop gelato place had to close.\n\nInternational plaza are just Bloody idiots!!!"]], "date": "2016-01-20", "time": "19:37:20", "categories": "Coffee & Tea, Ice Cream & Frozen Yogurt, Food", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 52, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "yKNnmCUKEiAJbFCtiZELNg", "user_id": "LNRGuW4z7toRnW6UTEG4Ig", "business_id": "B1izyRia1wZ6EwbRqIAO7A", "review": [["I had no idea this was here until my boyfriend asked if I'd join him. Thankfully, we just beat the late lunch rush, so there was no line. There was limited parking so we pulled over on the street. They had specials taped to the window, but I thought that was all they had. It took me too long to see the menu taped to the counter in front of my face, but they actually have a large variety for being such a small truck. We got the pork curry, chicken pad thai, and cold thai tea. I'm new to curry, but it was pretty good. The pad thai was great and came with a huuge pile of peanuts. The tea tasted like an orange creamsicle. I'm glad he pointed this place out, and I will for sure be back. I appreciated that they brought the food to our car so we didn't have to wait in the heat. They had one picnic table, but no other seating. I'm sure that's due to covid and limited space. I'll be back to try more for sure."]], "date": "2020-10-29", "time": "20:43:06", "categories": "Thai, Restaurants, American (Traditional)", "city": "Tampa", "state": "FL", "stars": 5.0, "business_review_count": 61, "predit_yelp_score": 4.2250000000000005, "actual_yelp_score": 4.0}, {"review_id": "Cib1bEWZSRCD9eNcsn1Ckw", "user_id": "11fB8W4GFpPqatBT_VPaBw", "business_id": "Z8I_4kjtadxEHqXtJ_9MBQ", "review": [["They do a good job but they take a long time relative to other places. The reason that I am giving them a low review is because they allow a glass scam to go on at their property. I came to get my car washed not be bombarded by an aggressive glass sales person dramatizing the crack in my windshield. Destiny was known by all the employees by name so this leads me to believe that it's something well known by the company and she probably spends a lot of time there. She pushes you to make an insurance claim but insists that the claim be a complete replacement rather than a repair. I will no longer be getting my car washed here."]], "date": "2019-03-25", "time": "16:43:21", "categories": "Automotive, Auto Detailing, Car Wash, Oil Change Stations", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 183, "predit_yelp_score": 2.225, "actual_yelp_score": 2.0}, {"review_id": "E7bRCbjUXvFSZlqticSy-Q", "user_id": "Za2N7jB06TaW3xnNt7Hjpg", "business_id": "H0unmI-lJTazbPh-Lt6lBQ", "review": [["Great for drinks and boba but food is overpriced and average. They have dine in available now but you serve youself. \nDrinks:  Just as good as the north tampa location.  The boba is perfection, soft and sweet and goes great with any drink.  \nI tend to prefer the milk teas since I like the creaminess and it lets you reduce the sugar content to 30% and I honestly can't tell the difference compared to 100% (for the taro milk tea), if reducing sugar id important to you without sacrificing taste. \nIf you get any of the fruit drinks, make sure to get 100% sugar if you want it sweet, anything less you will notice a huge difference and may not like it as much. \n \nFor the first few weeks after they opened, which is over 2 or 3 months now, it was obvious they were still working some things out, the boba was still kinda hard, not cooked long enough, the fruit drinks were not as sweet as they should have been at 100%, but now they worked out the kinks and serve amazing and consistent drinks. \n\nFood: Admittedly I haven't tried much of what they offer but was not impressed. \nNinja Chiken Nuggets - its ok, its fried chicken nuggets, nothing special, I really liked the Yum Yum sauce which is like a light but sweet mayo, but it seems overpriced at $7\nThe Tonkotsu ramen broth was sorta bland and disappointing, not enough meat, this was definitely overpriced for the quality and amount."]], "date": "2020-09-16", "time": "10:16:50", "categories": "Bubble Tea, Ramen, Food, Restaurants, Japanese, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 60, "predit_yelp_score": 3.125, "actual_yelp_score": 4.0}, {"review_id": "rj1MRjX_lFsqj8amQ5_J4g", "user_id": "gCe7Tfboy3lIT6o5IW4uJA", "business_id": "z_7TZeTXsDH6MmkPHQN8nQ", "review": [["Food - pretty good, the menu is never changing so once you've tried all 4 things (not literal) on the menu there's not much else to go back for. \n\nPeople - quite lovely \n\nDrinks - overall normal, except the Bloody Mary which comes with a rib on top!!"]], "date": "2017-10-14", "time": "17:51:28", "categories": "American (New), Cafes, Restaurants, Food", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 961, "predit_yelp_score": 3.325, "actual_yelp_score": 3.0}, {"review_id": "c9yms2VwpWjmWkv83-MwIA", "user_id": "VyP6zmdkQP8XcDgKUJnWZQ", "business_id": "qV3D9d2UteZ4-Mq0hqlcBw", "review": [["\"I Do!\" ... and we did, get married at the Crumb & Cork, where Joseph & Joshua treat their clientele like family and our family/guests like close friends.  When we booked the restaurant for our wedding & reception, we also received the talents of tasteful and thoughtful wedding organizer (Thanks Joseph!) as well as recommendations for music (Chuck@tampabaydj.com), florist (yborislandflowers.com), wedding cake, etc. I could boast and brag about all the details that were attended to like it was their own wedding, including the staging of the restaurant at different phases of the evening, decorating the room/chairs, presentation of the wedding cake, the unity candle ceremony, constructing the Bride's dressing/green room and an aisle for the procession, ... but the most striking part was the exceptional and personal service Joseph and Joshua provided to all of our family & friends.  Oh, the sparklers on the bottles of bubbles set the celebratory tone and the confetti cannons were an awesome surprise!  The food was great as it always is at the Crumb&Cork-usa.com, and the open bar flowed with \"first name service\" for our guests! The genuine warmth and hospitality created the atmosphere of a loving family with spot-on service. We said \"I do\" and we'd do it again, at the Crumb&Cork."]], "date": "2016-06-21", "time": "00:01:53", "categories": "Restaurants, American (New), Nightlife, Wine Bars, Sandwiches, Bars, Tapas/Small Plates, Arts & Entertainment, Jazz & Blues", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 120, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "Z6FeNQLJU20PNdwG27TuxA", "user_id": "NcnVi11ftlWTauxW2gu-Vw", "business_id": "QHWYlmVbLC3K6eglWoHVvA", "review": [["Very unique food selections, service is great and the food will send the taste buds in your mouth running- outstanding!"]], "date": "2020-10-02", "time": "02:46:06", "categories": "Burgers, Bars, Restaurants, American (Traditional), Vegan, Asian Fusion, Cocktail Bars, Breakfast & Brunch, Soul Food, Sandwiches, American (New), Gastropubs, Comfort Food, Nightlife, Wine Bars, Delis", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 3260, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "pUSq9BZH0Em8VJYkeVUSqg", "user_id": "TwXd2fJt_koPV5r3QK4BHA", "business_id": "wnAEZpQ38XgHElOz4Vd6UQ", "review": [["Best Cuban I've had since moving to Florida.  Highly recommended."]], "date": "2020-03-07", "time": "04:24:39", "categories": "Sandwiches, Soup, Restaurants", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 194, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "62H7CgQ8O5lMTWgdeZwiOA", "user_id": "68JsM4JbZUs6RocBiTmCUA", "business_id": "RVvOJikc1X-KfNgzb-oNag", "review": [["This is my favorite massage place in Tampa. Period. \n\nFirst, the location. It is close to my house, but more importantly, it is easy to find on Hillsborough Ave, on the way to Oldsmar. As you walk in from the ample parking, the strip-mall feel completely disappears and this serene, tastefully decorated space gets you ready for your treatment. \n\nSecond, the staff. Everyone is really nice from the moment you walk in. You get a reminder one or two days prior to your appointment and from the moment you walk in the door you are greeted and catered to. Timeliness is one of my pet peeves and so far, all of mi appointments have started on time. \n\nThird, the price. This is a $40 one-hour Swedish massage. Every time. No coupon required. If you sign up for their various offers, you pay even less. You can't beat that. I started getting regular massages in my early 30s when I lived in the DC area and trust me when I tell you, in DC you couldn't get a 15-minute shoulder rub at the mall for $40. Well... I guess that depends on the rub. But I digress.\n\nSummary: Great location, Great Staff, Great Prices!"]], "date": "2014-12-11", "time": "19:03:16", "categories": "Beauty & Spas, Day Spas, Massage, Skin Care", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 157, "predit_yelp_score": 4.65, "actual_yelp_score": 5.0}, {"review_id": "dh5FWF-29pVXlpXfMMpNiQ", "user_id": "uxd3NpEROuDQnnPjz_Yu3w", "business_id": "aXe-1VZjFLNHRKk3znO3Ww", "review": [["This place did not disappoint. Clean and friendly service with a smile. I'm in Florida so Grouper is a must have... Order the fish  tacos two for $5 is a great deal. The tacos were great and you can chose between the mild and spicy salsa. \n\nGet there my fellow road warriors if you are in the Tampa area. Two locations no excuses."]], "date": "2016-07-25", "time": "18:35:39", "categories": "Nightlife, Mexican, Bars, Restaurants, Food Trucks, Vegetarian, Tacos, Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 188, "predit_yelp_score": 3.3, "actual_yelp_score": 4.0}, {"review_id": "oFHCc1lOfWQm53S4anpNXA", "user_id": "xkmeYfzpJWAVxV04luVmXA", "business_id": "c0TznEkK0x57wbVEepFWrw", "review": [["This restaurant is a hidden gem. My husband and I will drive far distances for great authentic food and this will be my go to Korean restaurant. I ordered the hot stone bibimbap, every component of the dish came together making it a perfectly well balanced meal. My husband ordered a spicy chicken dish, the servings are generous which was important to him.\n\nOverall I loved the food and service. The ambience is decorated like a charming \"outdoor \"market with some semi private booths. \n  \nIf only I lived closer..."]], "date": "2015-10-24", "time": "01:36:39", "categories": "Nightlife, Restaurants, Korean, Karaoke", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 336, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "mKOoPCqgehYHcK1DZCA6Rw", "user_id": "wPbZGa1_HnClF2YHWxa0-Q", "business_id": "MOdKvwwY1cHc82W_iZR54Q", "review": [["You get the actually Thai tasty here, the Chef makes the food authentic and as home cooked.\nTerms of taste and consistency: 10/10"]], "date": "2019-06-15", "time": "15:50:39", "categories": "Thai, Restaurants", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 96, "predit_yelp_score": 4.7, "actual_yelp_score": 5.0}, {"review_id": "j49MQd3DbAwOw8nm9iDZUg", "user_id": "fkew6CTHtbpksZ-3_dHeXw", "business_id": "5XsC0tB8chKjTIW7mU6TnQ", "review": [["What delicious food! Seriously, they make the best Cuban sandwiches in town. We've (my husband and I) tried many others and even at the \"voted best Cubans\" restaurants, we weren't wowed until this place. The first time we visited, we thought we could each handle a 12\" Cuban. (Subway length, so couldn't be too much, right?) Well, it was too much. They automatically come with a drink and chips, so we managed the first half of the sandwich with the sides, but saved the rest for dinner! They make it just right - all the way with pickles and mustard and crusty bread and three meats. It was pressed into a dense sandwich that is filling and yummy.\n\nSo, the first visit was in July of 2013. When we moved here this month, we had to find the same place. It took a minute to remember where this was, but once we saw pics of the place, we knew this was it. Once again, it was great food. This time we shared a 12\" and a Devil Crab. Although the Devil Crab was good, it wasn't for us. It was hot and moist, but not the flavors I care for. However, they are very popular, so it must be good.\n\nOk. So they were shy of a 5 star review for one reason - disorganization. They're too small for the volume of customers and there is no rhyme or reason to where you are supposed to order, wait for, or pick up your meal (at least during peak lunch time). But, the staff is friendly and the owner (I think) asked my name when I was near the counter and knew who I was when my food came up - about 10-15 minutes later.\n\nIt is worth the cost (great deals) and the wait. Will definitely go again."]], "date": "2014-01-30", "time": "17:24:17", "categories": "Sandwiches, Restaurants, Cuban, Delis", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 570, "predit_yelp_score": 3.175, "actual_yelp_score": 4.0}, {"review_id": "9UdFlo_FH5DBcYMh6VGI-Q", "user_id": "GFwrTCXeEYBEJMi3mLe60A", "business_id": "gYxWVHg5ywsi7A5n8kEpWw", "review": [["Great location and very good staff they ask me play their staff fun games while I was waiting for my cab  and gave a gift card  also and not to forget they gave me late check-out too"]], "date": "2019-03-20", "time": "18:03:05", "categories": "Hotels, Hotels & Travel, Event Planning & Services", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 32, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "0UN0G9q5aWxbWwlxq2Wnug", "user_id": "kD62ATddgHdyNcbqxNPEcA", "business_id": "6KJTlLbdMH4jdDrYHZNv6w", "review": [["First and last time I will go there.  I ordered two large pizzas.  Both came out burnt and flavorless.  Toppings had no flavor.  The bottom was almost black. For $40 for two pizza's I expected the best but got the worst."]], "date": "2019-04-16", "time": "21:06:00", "categories": "Chicken Wings, Burgers, Restaurants, Pizza, Salad", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 49, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "JkmWT9M2F8FTwieSPX_L4Q", "user_id": "2xw5h_6ie_NCdGKpDv2sEQ", "business_id": "sRXC-Gz-1sb9TQOcNQrYzg", "review": [["This place is wonderful! \nWe stopped by recently really only looking for a balanced fertilizer for our houseplants. We left with 4 new plants for outside, 2 houseplants, fertilizer, and a couple other items. Everyone there was so friendly and so knowledgeable! \nWe were greeted as soon as we stepped out of the car. While we were checking out, they wheeled everything we purchased to the truck and loaded it up for us. \nWe will definitely be back for future gardening needs."]], "date": "2019-05-08", "time": "23:25:58", "categories": "Nurseries & Gardening, Home & Garden, Shopping, Home Services, Irrigation, Landscape Architects, Landscaping", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 17, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 5.0}, {"review_id": "8teW8ajwTgUakw70IRXJzQ", "user_id": "vDhJLo8ya9jIlmLwaLP6FQ", "business_id": "AFYI0sfZ6WdVELjjEYOIpw", "review": [["I remember coming here years ago and how much fun I had. After today, I'm infuriated with how poorly run it is. The layout of the park is great and the rides are fun. I love how the animals are everywhere and always near you. However, the workers were rude, every ride line was insanely long, and 2 of the rides I waited in line for an hour for shut down because of technical difficulties. I purchased the all day dining pass and the food wasn't even good. The chicken fingers tasted like rubber and the pulled pork sandwich Tasted old. I will NEVER come here again. Waste of money. Busch gardens better shape up."]], "date": "2019-01-02", "time": "23:56:49", "categories": "Active Life, Amusement Parks, Botanical Gardens, Arts & Entertainment", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 1325, "predit_yelp_score": 2.1999999999999997, "actual_yelp_score": 1.0}, {"review_id": "ApVuJO8pkEAcW6yCDIvIdA", "user_id": "nQXLUFOsV5h26ShBgRLpGQ", "business_id": "YKgaQks7mIrOcRRkuccZkQ", "review": [["I like the fact that this company still gives the discount for Disabled Veterans and is now forming a new jobs task force to help homeless and unemployed Vets find new jobs within their stores.\n\nTheir usually there to help with questions or they'll find someone that has the knowledge to help you.\n\nI have two stores within 5 miles of my house and utilize both of them.\n\nKeep up the good work and good luck with the Veterans Employment Project."]], "date": "2014-08-03", "time": "11:18:48", "categories": "Appliances, Home Services, Nurseries & Gardening, Home & Garden, Shopping, Building Supplies, Hardware Stores", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 41, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 4.0}, {"review_id": "KlhD5llhgU4c8zD-wyBbcg", "user_id": "c5-PL8JUy5TQolBZXm-GQQ", "business_id": "L5LLN0RafiV1Z9cddzvuCw", "review": [["Never sat down. Walked in for dinner about 5:30pm and even with a nearly empty dining area we were given a choice between cramped bar seating and the second floor. Staff was a tad arrogant. Might be the greatest place in town but we won't try again."]], "date": "2019-08-23", "time": "11:57:40", "categories": "Breweries, Food, American (New), Beer, Wine & Spirits, Restaurants, Seafood", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 3064, "predit_yelp_score": 1.2000000000000002, "actual_yelp_score": 1.0}, {"review_id": "vGtFJFnJFgU2C_FtLkd-Dg", "user_id": "AJkdOsxnNRTWWCnvekmLcg", "business_id": "jBHR2su_g7TgNmGDL5qPiw", "review": [["Until they rethink the Moo-ternity ward, I will have to continue to rate the fair 1 star.\n\"The greatness of a nation and its moral progress can be judged by the way its animals are treated.\" - Mahatma Gandi\n\n(Do they really have to tie the larger animals to the front of the fences so they can't escape the grabs, pokes and gropes, the worst offenders the precious 2-5 yrs old not being supervised by their oblivious parents?)\nA woman and I were horrified at a very large, more exotic breed of  cow  on the left side of the ward, appearing to be hyperventilating. while no one else noticed as they pushed and shoved their kids at her, taking photos and shrieking in delight at the size of her. She was tied so tight to the fence she could not move away from the mass of overzealous people and kept her head down, not enjoying the groping one bit. Her eyes, like the rest of the animals there, were glazed over in exhaustion.  We felt so horrible for her.)  Why would people be horrified to put a human being though something like this, but think think it's just fine to do this to an animal in a setting such as this?"]], "date": "2019-02-10", "time": "19:47:20", "categories": "Public Services & Government, Arts & Entertainment, Festivals", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 71, "predit_yelp_score": 1.5250000000000001, "actual_yelp_score": 1.0}, {"review_id": "Z9191M10pzGqCpozgsk8KA", "user_id": "3hiOnv-KqtnSIhJqiBIMlg", "business_id": "82Oovgapi1f_wo8zKRDuNQ", "review": [["I hardly ever leave reviews, but this place is SO worth it. Was looking for a dessert place to pop in and out of for to-go cake and I'm so glad I went with Chocolate Pi! Their space is adorable, their staff are always so kind, and their desserts are out of this world. The portions are GENEROUS! So good I came back twice in one week. Try the coconut cream and the guava cream cheese, you will not be disappointed!"]], "date": "2021-07-22", "time": "17:54:34", "categories": "Desserts, Food, Bakeries", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 41, "predit_yelp_score": 4.75, "actual_yelp_score": 5.0}, {"review_id": "3ubePfvYy1TEHpvc_4vvUQ", "user_id": "l9_9qWAapVfkHe_wHiFvZQ", "business_id": "dTvffuPtnhOSwSNuKP7BxA", "review": [["Military discount; beautiful location strategically placed on Tampa's breathtaking Riverwalk; and from Tampa University you can see the hotel! The staff was accommodating; but lacked on hospitality. We knew it wasn't home, but it's still in the south. It had a New York trendy feel. You must pay for parking no option to park your own car. The valets were very professional and although my children had expensive gifts in the car nothing was ever touched! Free Wi-Fi"]], "date": "2019-07-10", "time": "06:50:48", "categories": "Venues & Event Spaces, Event Planning & Services, Hotels, Hotels & Travel", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 158, "predit_yelp_score": 3.875, "actual_yelp_score": 3.0}, {"review_id": "K7GFasPNG2vLjz8QwzJD8w", "user_id": "NYeeSGlgJfnqJDxRBIsopA", "business_id": "YKsxuKccY6lwcyY4koGIzg", "review": [["I found the Promo Printing Group very easy to deal with and prompt in every request I made.  We ordered scratch and sniff cards and the turn around was only about a week.  Great service and great value for the money we paid.\n\nDave Koopman\nManager EOH&S\nAltaGas Utilities"]], "date": "2016-05-16", "time": "17:16:53", "categories": "Printing Services, Local Services", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 14, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "9ThSpMVQ-7rflwsJqmgx4A", "user_id": "w2WqbFEOF215diL15-dh9g", "business_id": "qyyD13YNNP9P1VamzaOxCw", "review": [["This place was highly anticipated and they fell short. I was excited to see a new edition in old west Tampa as a Tampa native. We drove an hour to experience brunch and ready to taste the shrimp and grits. We walked in and there was a line out the door. The dine in area was about 200 sqft. With max of 10 occupants. There was a party it appeared and no one was seated.There was a cashier taking orders. We get to the front and I hear the cashier say \"we are out of grits\". At this point we were over it so I left. Just some friendly advice: please learn better communication skills as there appeared to be a break in communication between kitchen and foh. Secondly, if the place is small find a better system such as reservations or booking app. Just very disappointed. I wish I could grade the food. But professionalism and customer service I'd give a 1 star. I was so excited to support the black chef as this is an accomplishment in itself"]], "date": "2018-07-14", "time": "17:44:28", "categories": "Seafood, Breakfast & Brunch, Restaurants, Burgers", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 39, "predit_yelp_score": 3.4000000000000004, "actual_yelp_score": 2.0}, {"review_id": "4nOhK0JkuEsMMGbliUWOdA", "user_id": "f4mbT-nxg2AJhqxB6XgnlA", "business_id": "JdR1vhCkBiTNkh_kM6Wsjg", "review": [["Great Airline. Great Airport here in Tampa, and getting better as I write this. I still think Southwest is the best airline in the country, and I fly with them nearly every time.\n\nGate and ticket counter personnel are second to none, and they are always friendly....some of them even remember my name!\n\nWe had a comfortable flight to LAX, and we were happy to get there about 20 minutes early.\n\nThanks Southwest, I appreciate you."]], "date": "2015-11-04", "time": "22:19:26", "categories": "Hotels & Travel, Transportation, Airlines", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 118, "predit_yelp_score": 4.85, "actual_yelp_score": 5.0}]