[{"review_id": "pyWFDktFtmfNdPzpFAlsXw", "user_id": "d7eMqtYoggakup56LZy2qQ", "business_id": "KbSpEQ_54ovgNxOoxKP79g", "review": [["I was still going to time market. I still don't like their coffee but their breakfast pizza's are good.  I am disappointed in the owners response to my criticism.  The coffee tastes burnt.  The lattes are not creamy.   Maybe the owner should ask what it is I do not like rather than post an ad hominem attack.   Still if you want good coffee... Raging Sage is a better choice.  Maybe the owner should try it sometime.    I have been at time market many times in the morning since my initial post and  there are not lines out the door for their coffee. Not sure I will be going back now.. Hard to give business to someone who does not know how to respond to criticism.  Too bad.  Lots of potential there."]], "date": "2013-12-21", "time": "23:11:16", "categories": "Restaurants, Food, Pizza, Delis, Beer, Wine & Spirits, Grocery", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 368, "predit_yelp_score": 2.1, "actual_yelp_score": 1.0}, {"review_id": "zI9s6F7YZvzsd184epVkFg", "user_id": "AsvW7euMpVzmrU2jY5d-4w", "business_id": "PtgpBXbgBiBwEbaGHqjY3A", "review": [["employee Alicia was very quiet and unenthusiastic, didn't make me feel very welcomed or comfortable. Didn't even smile when we picked up our order. however the food is always amazing!"]], "date": "2019-07-09", "time": "23:31:53", "categories": "Nightlife, Restaurants, American (Traditional), Sports Bars, Chicken Wings, Bars", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 207, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 3.0}, {"review_id": "PpnJUp9FhA6m8e5yyfD-Cw", "user_id": "vBAVVT1IOMnel2_NDtquaQ", "business_id": "9xndvdKagPMWyLxDq2yDUw", "review": [["Amazing restaurant, very friendly staff and I always love going here. The lunch menus are impossible to beat for the price, and I always end up with more than I can eat."]], "date": "2017-02-21", "time": "21:50:45", "categories": "Diners, Chinese, Restaurants, Soup", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 186, "predit_yelp_score": 2.775, "actual_yelp_score": 5.0}, {"review_id": "EVDG5lOAUvp6PR7D0oSS5A", "user_id": "SYyYg8-yq_tuJfuAjcWBLQ", "business_id": "wriQUBAbLgkM9LuYyVDNkw", "review": [["Used to live in Tucson and loved Macayos.  Have been back twice on visits to the city and have been disappointed both times.   Most recent was this past Thurs, party of 4 and none of our meals of the standard we used to expect. Most tasted as if the meat had gone off.  Will not be back."]], "date": "2014-03-10", "time": "00:53:56", "categories": "Restaurants, Nightlife, Mexican, Salad, Cocktail Bars, Bars", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 95, "predit_yelp_score": 1.325, "actual_yelp_score": 1.0}, {"review_id": "D-xgEY9gS2nIwQwomgQyEw", "user_id": "G7uvmJU3xErUieRmNbwiWQ", "business_id": "pWqln9L6Bn59V4pTldGaqg", "review": [["Great food, well prepared and artfully presented. Restaurant staff friendly and attentive. The patio is a lovely place to share drinks and/or a meal. The dining room and the delicious food remind me of old-fashioned \"fancy\" Italian restaurants my folks took us to when we were kids."]], "date": "2021-12-04", "time": "22:55:27", "categories": "Restaurants, Italian", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 154, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "uvkvfTLSpPUoY0rjoKFD2w", "user_id": "ge18TlBjMWlq1ZAlcDMwgQ", "business_id": "Ei5HBqe012ImhqEr2ZH2gg", "review": [["Outstanding flavors on each pizza.  The arugula salad is great too.  The flavor of the crust makes one not want to leave any pizza bones behind on the plate.  They also just got their liquor license so you can have a local Dragoon beer with your pizza.  I think the sausage pizza is my fave - spicy and delicious.  Best pizza in Tucson!"]], "date": "2017-12-19", "time": "21:27:02", "categories": "Italian, Restaurants, Food Stands, Farmers Market, Food Trucks, Caterers, Pizza, Event Planning & Services, Food", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 374, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "xwD74lP2SJ6yF0GmwR4meA", "user_id": "C_TFhaeo6T0sVTJtqjcoDA", "business_id": "8bMgMvCCtQ-JE-GF0YWEHA", "review": [["Worst company on the planet! Trying to resolve THEIR billing errors and put on hold 26 minutes to get operator who sent me to billing 22 minutes more to operator who SENT me to billing for 28 minute wait to operator who sent me to  billing finally. You've been warned. If you want bad billing, high creeping prices, TONS of commercials...Cox is for you!"]], "date": "2020-04-09", "time": "22:11:16", "categories": "Television Service Providers, Home Services", "city": "Tucson", "state": "AZ", "stars": 1.5, "business_review_count": 51, "predit_yelp_score": 0.2, "actual_yelp_score": 1.0}, {"review_id": "3GQo5CafM96BE_jRcnp8ZA", "user_id": "TKYFgDFI2326xlwGLbgeTg", "business_id": "yb6FghuECyG9qR1pgrVQ1w", "review": [["3 times in a row they were over 45 minutes late delivering.  Each time i called, the manager on duty had some excuse.  I can understand problems arise but each time they tried to explain it away and they were very rude.  Tonight while i was talking to the manager she started talking to someone else so i just hung up. I was in the food industry for years and i always tried to make my customers happy.  I'm absolutely done with Dominos!!"]], "date": "2017-06-03", "time": "06:43:07", "categories": "Sandwiches, Pizza, Italian, Restaurants, Chicken Wings", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 29, "predit_yelp_score": 1.525, "actual_yelp_score": 1.0}, {"review_id": "sStJiuVjsgx1_k6w-l_mnw", "user_id": "GwBmWXYU6ErjzT6SIcf_2w", "business_id": "u5TrBiIOqsNUFrTTvZXudg", "review": [["The sales man guys were so friendly. Finish the paperwork fast. They done good job but a little pushy. They react to my requests right away."]], "date": "2017-10-17", "time": "04:47:47", "categories": "Automotive, Used Car Dealers, Auto Parts & Supplies, Tires, Car Dealers, Auto Repair", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 89, "predit_yelp_score": 4.125, "actual_yelp_score": 5.0}, {"review_id": "LoYv65rnoocaxaZ1WSsy5A", "user_id": "py-HBAS5bIY5eGqSaym7wA", "business_id": "A5lh_QGlxWAuYWSTZKH08g", "review": [["One does not simply go the Mama Louisa's and not order the Joe's Special. The best sauce this side of Italy. I love Mama Louisa's. I've been coming here for my 18 years, and I think it's the best, such a cute and quaint restaurant. The Chicken Marsala is so good! TIRAMISU IS TOO DIE FOR!"]], "date": "2014-05-04", "time": "22:53:19", "categories": "Italian, Restaurants, Nightlife, Bars, Pasta Shops, Caterers, Food, Specialty Food, Event Planning & Services, Cocktail Bars", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 278, "predit_yelp_score": 4.0, "actual_yelp_score": 5.0}, {"review_id": "dRkZOOauPzfX3fFl3Phb4Q", "user_id": "n2n1zFSpdaat2u750EXTEQ", "business_id": "29Ok6gZ4JWBKshs0R0M-ZQ", "review": [["Delicious food and very strong margaritas. Their bacon wrapped shrimp appetizer and their chile rellenos are a must try. I love their chips and salsa as well. Use yelp coupon and go for happy hour!!"]], "date": "2015-07-21", "time": "12:43:15", "categories": "Mexican, Bars, Breakfast & Brunch, Restaurants, Nightlife", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 197, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "tpTlI1DjyHy-Mrsbfw73eA", "user_id": "arfpRZielSZH4NAO4i7zPA", "business_id": "v3OZ36tMFyAuQiqaY9tsgA", "review": [["The food is good but the service...deplorable. First, when I called to place an order for deliver, the girl answers, asks permission to put you on hold and slams the phone down before you're able to answer. That to me is rude. Then, I am given a dollar amount of what my order will be. I call back to ask a delivery time, and am told 45 mins and a different (higher) total. I ask why and the girl says \"because I forgot to add the onion. Um, okay. Maybe you should lead with that. About an hour and 15 minutes later, I call (as I have a scheduled lunch time at work) and the girl (after putting me on hold) states that the delivery man left 30 mins prior to my calling...when I explained that my work was located only a 15 min walk away, she stated she would call him and call me back. He walked in only a moment or two later with my order. As I sat down to eat the sandwich was cold and the bread completely soaked through.  I called back and explained the irritation and asked for a refund. The girl put me on hold and came to say she would get another sandwich out in 10 mins. Um, okay. Sure.\nThe Kicker: The manager comes in to my place of work and proceeds to talk to me as though I am ignorant: \"so you order a greasy sandwich and expect it to not be soggy?...Let me see the sandwich....\" I could go further into this conversation (that took place in the middle of my work lobby in front of customers and employees. Not only did he embarrass himself as the owner of a locally run business, but not one person in this building will be ordering from there again."]], "date": "2014-07-28", "time": "22:14:40", "categories": "Bars, Pizza, Restaurants, Nightlife, Italian", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 282, "predit_yelp_score": 0.875, "actual_yelp_score": 1.0}, {"review_id": "9DhPMhxOrqmR_ny-VmEJrg", "user_id": "CedXNIkxn2NY5I78lGkPDA", "business_id": "Nz0AJVskEAlMVgF2HMhFRw", "review": [["This is the humus platter we received for $23 (sad). When we called to ask what happened, the person answering the phone said \"I'm just the dishwasher and can't help you, the owner isn't here\""]], "date": "2021-03-20", "time": "21:06:02", "categories": "Restaurants, Food, Middle Eastern, Mediterranean, Greek, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 62, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "EIA1uwU1ZUfvwY1yP9OxBg", "user_id": "VB5y8GndeR3KCmzW8iEpfA", "business_id": "K_lmlGmdSJ-QsGJm-Z3f9g", "review": [["Schedule annual service they came to me. They finished in a timely manner. Excellent customer service."]], "date": "2021-08-15", "time": "23:50:36", "categories": "Auto Repair, Automotive", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 9, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "6kspElQoYsBaFTYDtv0lUw", "user_id": "LojDefMzt-_qhj-9ZjJqUw", "business_id": "uzhiTCvVaK_0fZwa7rWDzw", "review": [["Terrible service by Barista too busy chatting.\nManager was rude!\nThe place was empty and I've been served quicker in extremely busy Starbucks. \nI overheard the barista say 'it's my last day' so hopefully things might improve but I'm hugely surprised by the managers attitude because they are usually so good in Starbucks! \nMy drink was wrong but it wasn't even worth mentioning!!"]], "date": "2016-11-05", "time": "20:48:47", "categories": "Food, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 39, "predit_yelp_score": 1.025, "actual_yelp_score": 1.0}, {"review_id": "NGbDPNMNJowvP2uhOB5_aw", "user_id": "MviGv6liWmYF-GyC7SJHmA", "business_id": "IT4giLaBtYHSA9nh5FmDwQ", "review": [["I visited this salon based on other Yelp reviews and I couldn't be happier. I made an appointment with David and when I arrived I was promptly seated. The staff was friendly and greeted me as I entered. I wanted a full set with gel powder in a coffin shape and they turned out perfect!! David was very meticulous and took his time. In fact all the nail techs seemed very relaxed but focused on their clients. Thank you David for taking pride in your work and producing beautiful nails. Without a doubt \nNails by Yen is my new nail salon."]], "date": "2016-08-24", "time": "23:45:05", "categories": "Waxing, Nail Salons, Massage, Hair Salons, Skin Care, Hair Removal, Beauty & Spas", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 212, "predit_yelp_score": 4.05, "actual_yelp_score": 5.0}, {"review_id": "ZqHy2Up0S8JEzgqoPHsYzQ", "user_id": "knyL5Q53vbgGmEBQLPLxVQ", "business_id": "a8q8Kd7KubA-qHpPAAH81g", "review": [["Sauce's first problem is surprisingly a lack of sauce.  From a place named Sauce, with smears of blood like sauce strewn around the windows and walls, a lack of sauce would be the one problem I never expected to encounter.  However, that's the one consistent problem I have with all three of their locations. \n\nMy most recent encounter was at the Broadway and Rosemont store.  Now I'm a fan of the Fox Concept restaurants, but Sauce never fails to disappoint me.  I love pizza.  I could eat pizza everyday, but this place really misses the mark.  Their pizza is dry, and their pasta is flavorless (and usually lacking in sauce).  I will say that their salads are quite good.  For the food's sake, I'll start with the best dishes from my last visit, and work down to the worst. \n\nA surprising win in my opinion was their Turkey & Feta salad.  This salad is a delicious combination of turkey, almonds, avocado, feta cheese, cucumber, and tomato bathed in a lightly sweet dressing.  I would have been happy to have made a meal out of this, but sadly our food came shortly after.\n\nThe second best dish of the evenings was the lasagna.  I am actually not a fan of lasagna, but this isn't your traditional lasagna.  I'm not sure what they do differently, but it actually had some flavor.  It was a bit dry however, and could have used a bit more sauce.  \n\nNext up was the chicken, broccoli, and cheese pasta... which is actually macaroni and cheese with chicken in it.  It's not even good macaroni and cheese, because it really seems to be lacking in either cheese flavor or sauce.  (They actually have something called \"Mac 'N Cheese\" on the menu, which I suspect is the same dish, before they add chicken and broccoli.)  \n\nThe next disappointment was their white bean potato.  Despite the name, this soup had neither beans nor potatoes in it.  I thought it would be a hearty soup filled with ingredients, but what I received was a watery bean flavored bowl of garbage.  \n\nThe final loser on the list was the pepperoni pizza with crimini mushrooms.  I've had this before at the Sauce on Campbell, but this one was absolutely terrible.  The pizza was mushy in the middle, and inedible along the edges.  What I mean by that is, the middle of the pizza was so wet with greases from the cheese and pepperonis, that none of the toppings would stay on the slice.  And the outer crust was a tooth breaking chunk of rock, which no mere mortal could possibly eat.  For some reason, there was no detectable amount of sauce on this pizza.  I'm not sure if they were trying to replace the sauce with grease, but it sure seemed like it.\n\nAs for the service... well, there really isn't any.  The cashier was friendly enough, but once they get your money they really seem to stop caring.  You see, Sauce's concept runs on a pay first and get your food later idea.  (You are even supposed to tip before any of the service has started!)  They bring you the food, and then that's it.  They don't even offer to refill your drinks.  (Even Sonic's car-hops will offer refills and check to see if you need anything else.)  \n\nIn short, don't go here for their pizza or pasta, but if you want an amazing salad, give Sauce a try."]], "date": "2011-03-30", "time": "22:28:14", "categories": "Pizza, Restaurants, Bars, Nightlife, Italian, Salad, Wine Bars", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 226, "predit_yelp_score": 1.4500000000000002, "actual_yelp_score": 2.0}, {"review_id": "RPRW79hrdPFAEMlEfCHMoA", "user_id": "SokgF7HoIlSq7hC_jo_fCg", "business_id": "6GeezpXz_jYeVnt450fOKg", "review": [["The atmosphere is very cool, and the food is unreal! \nThis place is going to do great things! \n\nYou can fill up on a burger but the fries are real delish so get them.\n\nAlso beer. Beer is great."]], "date": "2017-03-04", "time": "00:02:17", "categories": "Bars, Nightlife, Tacos, Sandwiches, Burgers, American (Traditional), Restaurants, Pubs, Mexican", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 75, "predit_yelp_score": 4.225, "actual_yelp_score": 5.0}, {"review_id": "WuZxj2w029DgygoWmIVOOQ", "user_id": "gKmsVvElYdrqaiSBITDffg", "business_id": "ltmenUcFgNv7fPOU2BiwKw", "review": [["Ok so I've been eating at this restaurant for the past 30+ years. I LOVE their food. The red chili con carne is the BEST! The waiters are friendly. However, I do have a pet peeve when I walk in waiting to be seated and the owner's daughter (the hostess) is busy looking at her Facebook on her cell phone as customers pile up. This is not very hospitable but just down right rude. It is obvious by the looks on the staffs face that they are annoyed with her. I think it's time her mother puts her in check!!!! \n\nP.S. The cheese crisp is to die for!!\n\nSincerely, \nAn Annoyed Patron"]], "date": "2015-07-02", "time": "02:49:54", "categories": "Food, Restaurants, Mexican", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 224, "predit_yelp_score": 2.4999999999999996, "actual_yelp_score": 4.0}, {"review_id": "aOazmqDElULYjuvmF6x6IQ", "user_id": "72RrYQhl1xXsZumxkCCyCQ", "business_id": "DpTjwgbbvvkl6gU8YTtliA", "review": [["Being a loyal Drive Time customer, I must say the staff was great at this location.  I purchased a new to me Lexus SUV and\nI am in love with it!"]], "date": "2019-07-30", "time": "16:26:41", "categories": "Financial Advising, Financial Services, Car Dealers, Automotive, Used Car Dealers", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 16, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "BL6k1nA42v_jwOEcyh3W8Q", "user_id": "L542kzEIIblxhCVlXXCdBw", "business_id": "4r6N_Fhiwoqo_FqQ7Mm6mQ", "review": [["Went in with my husband for lunch, it was not very busy. This is our first and last time going there. We came out of our way to go and try it. When you walk in you wait for someone to talk to you, they hand you a menu and tell you to stand at the counter and when you decide what you want let them know and  pay for your food first and then go find a seat. The table was filthy and we were told that they would clean it, the first girl brought out our drinks and places them on the dirty table and leaves. Next we order the duo guacamole and another girl brings it out and she  puts it on the dirty table, I told her the table is filthy, so I move it and she goes and gets some spray and a rag and is spraying right on me and near the food and just throws the dirty food on the floor. The guacamole was terrible, it has no taste and they give you a ton of chips and not much guacamole for the money. My husband ordered 2 tacos and I ordered 2 tacos,the girl asked if we want them on the same plate, I said no, they dont even give you plates the food comes out on boards\nThe tacos were loaded with cabbage and not much meat.  I had to ask for salt and it was like I was asking for gold.The overall service was terrible and no one acknowledges you the whole time you are there. you have to chase after them if you want something. We never got a refill on our drinks since no one comes around.\nWe spent a lot of money for chips, because there definitely was not much meat in the tacos and not much guacamole.  Very unsatisfied customer"]], "date": "2019-05-05", "time": "00:04:38", "categories": "Restaurants, Beer Bar, Nightlife, Lounges, Latin American, Bars, Mexican", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 730, "predit_yelp_score": 0.45, "actual_yelp_score": 1.0}, {"review_id": "VMoDCxQgVdL0bkZD0rzBPw", "user_id": "aQTcroh2hRELnWVXEgtk0A", "business_id": "gfLsBY-xsNE9-ktiTvTvGA", "review": [["Second time here... it's okay. Took an hour between ordering and food arrival. And that was only after inquiring with the manager. I think it had been waiting for quite some time under the heat lamps and forgotten. No explanation other than that they had a large party in the other room. I might go again, but not if I had to be somewhere afterward."]], "date": "2015-05-23", "time": "23:56:41", "categories": "Cafes, Food, Restaurants, Mexican", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 400, "predit_yelp_score": 0.1, "actual_yelp_score": 2.0}, {"review_id": "EOsIUeyozWO5eem-fnOHAw", "user_id": "DM1z99dItOz0jinjiHa68Q", "business_id": "vRle3eQO4T767azL09rFnA", "review": [["Had brunch here for Thanksgiving.  My husband had the traditional turkey meal.  I had salmon.  I was very surprised that there was not a beef entree on the menu.  \n\nStuffing, green beans and candied yams were extra side dishes.  That was a little surprising.  I thought the turkey dinner would have included them.  And, the three desserts available were a chocolate and nut with caramel, a pumpkin pie (both desserts were served in a small mason jar) and vanilla ice cream.  The chocolate dessert was wonderful.  The pumpkin pie was good but not exceptional.  \n\nMy favorite part of the meal was the candied yams.  They were excellent.  And, the stuffing with turkey gravy was worth paying for.  \n\nThe wine list was very limited. So, we ended up having ice tea.  \n\nOverall, a very enjoyable meal."]], "date": "2012-11-23", "time": "02:18:04", "categories": "Hotels & Travel, Restaurants, American (New), Event Planning & Services, Hotels", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 300, "predit_yelp_score": 3.175, "actual_yelp_score": 4.0}, {"review_id": "e8vcSU5JTF1Tj-ZauIfcvQ", "user_id": "IaqwLtG5Se-kt_MHBOalag", "business_id": "-Gvzq9_6pulzU5y0HFg7IA", "review": [["We love Tap and Bottle. This place has something for everyone. The atmosphere is so welcoming and everyone inside always looks like they are having a good time. The options for drinks change frequently so anytime you go you can always try something new.  They offer beer and wine on tap as well as having a large refrigerated selection of individual can options. The food options for Tap and Bottle come from the food trucks that pull up outside. These also vary based on the day.\n\nI've never seen the place empty and I've gone on different days and at different times. I've been to both this location and I still prefer this one. It has such a relaxed and friendly vibe. This is a great place to take out of town friends if you're looking for a local Tucson hangout."]], "date": "2019-11-21", "time": "18:25:41", "categories": "Shopping, Beer, Wine & Spirits, Food, Nightlife, Pubs, Beer Bar, Bars, Wine Bars", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 246, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "pwx7TgIocCrypNIemGQhSw", "user_id": "rRnhAhx3747yXoMTwjnORQ", "business_id": "chVG60N4vrOG9DNCdHS4Mw", "review": [["Dr. Jaw is the best in town! They're so friendly, caring and nice. I feel at home whenever I come here. The doctor always makes sure to spend some time with me and his staff remembers my name each time I visit. I love the facilities, the amenities and the overall atmosphere. This is high quality care for a great price!"]], "date": "2020-01-07", "time": "18:28:36", "categories": "Dentists, Orthodontists, Health & Medical, Sleep Specialists, Pediatric Dentists", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 42, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "QuyBXrVU5uSgLTFrJGNYXA", "user_id": "jL41h4Ez98PZfqiKzbbY1w", "business_id": "MUOCeTGhL5llXe8GAuqOMA", "review": [["To be fair I am talking about the satellite Ike\"s at the U of A. Small, kind of messy. But that would have been forgiven if my iced decaf hadn't tasted as if someone ground out their cigarette in the grounds. Bad taste and strange texture; yeah texture in coffee. Yuck."]], "date": "2018-07-12", "time": "18:52:35", "categories": "Sandwiches, Coffee & Tea, Salad, Food, Restaurants, Ice Cream & Frozen Yogurt", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 63, "predit_yelp_score": 0.125, "actual_yelp_score": 2.0}, {"review_id": "xGObUEL7bKlXQsnUl5p1Kw", "user_id": "HUVDFklT9EPnb77b7luTng", "business_id": "xSp5y_yPW0L5dHTVZTMA4Q", "review": [["Had the best experience here with Robert. He is an excellent Hair Stylist. My color was Great and I LOVE my haircut. Please follow him on Instagram @mrbobbypins. \nTHANK YOU Robert"]], "date": "2020-06-17", "time": "23:25:40", "categories": "Hair Removal, Hair Salons, Beauty & Spas, Waxing, Skin Care", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 31, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "dFVyE3QTpD8k4pOdG06uDA", "user_id": "Y_bXDyk0QX-S5hEcQGkF8g", "business_id": "bN7-A2GlVz2Job3frIPy9w", "review": [["I came back and tried the pecan and honey comb ice cream flavor and and they were seriously the best ice cream I have EVER HAD hands down. In love with the creations they concoct in there. Will be back for sure. \n\nPlus all the natural ingredients, they really take the time to make something good."]], "date": "2015-04-19", "time": "22:51:37", "categories": "Ice Cream & Frozen Yogurt, Food", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 173, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 5.0}, {"review_id": "IrrVyvTeQG1dKF1vb_GxfQ", "user_id": "YLHSuR9x_PJLZc2EkIZwyA", "business_id": "ntdgwLyMxIwGzB16QVjVzg", "review": [["Needed T-shirts' done ASAP after another company failed me. They were so professional and delivered same day"]], "date": "2019-12-02", "time": "06:34:46", "categories": "Local Services, Shopping, Customized Merchandise, Screen Printing, Arts & Crafts, Embroidery & Crochet, Screen Printing/T-Shirt Printing", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 5, "predit_yelp_score": 2.4499999999999997, "actual_yelp_score": 5.0}, {"review_id": "PR1OrbYLKty5X2pE4wTg-A", "user_id": "zbO49PVQ63WHeXubdC77qg", "business_id": "y29Da2WKi8V4xk4tOacEjQ", "review": [["I didn't let the mixed reviews on Yelp deter me, heard from locals this is a must try, so I went and I'm glad I did!\n\nYou can smell the mesquite from the parking lot and the aroma draws you inside.  The decor and ambiance of the place feels a tad cheesy- very 1970s western style, but the food is wonderful.  I had the smallest portion of prime rib and it came with a salad and side.  There was nothing small about the portion size, two adults could easily share it, the meat was so tender and buttery, melted in your mouth.  The house salad they make for you table side was a real treat- a mix between sweet and savory and the baked potato was perfect as well.  The only thing missing was how to get some of that dressing to take home!"]], "date": "2018-09-19", "time": "19:10:37", "categories": "Bars, Restaurants, Steakhouses, Nightlife", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 356, "predit_yelp_score": 3.9750000000000005, "actual_yelp_score": 4.0}, {"review_id": "3fGMZP3FXTsvoCGy5I45ZQ", "user_id": "R-WSKg7NjGyBwIjN4q47xQ", "business_id": "pUeuBWxgll2in2KqKeAR_A", "review": [["Nice place. I was there for lunch on a Saturday with a large group (20+). They sat us quickly and were very efficient. I had a really good chicken sandwich. The orders were accurate and everyone seemed to love their lunch.\n\nProbably 10% too expensive, though."]], "date": "2010-04-16", "time": "05:18:39", "categories": "Steakhouses, Seafood, Restaurants, Nightlife, American (New), Wine Bars, Bars", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 448, "predit_yelp_score": 3.875, "actual_yelp_score": 4.0}, {"review_id": "o5Z9rKDnvOjEJfNwa-GEWA", "user_id": "g_UvMS8irByyP7h3KEmmxQ", "business_id": "XeVO0J8CfodEts59ZAXLig", "review": [["This place is great for kids between 2-12.  The Museum is in a cool historic building, with lots of parking all around.  There are many different rooms with interactive exhibits.  My kids especially love Mind Your Own Body, which has lots of health related stuff and the market, where they can shop and picnic.  New in a few weeks is a vet clinic.  \n\nThey have lots of festivals and hands-on activities, too."]], "date": "2009-08-25", "time": "17:20:51", "categories": "Summer Camps, Children's Museums, Kids Activities, Museums, Active Life, Arts & Entertainment", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 119, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "8Sa4gU_xwQnMKTfbGzbHqw", "user_id": "gEaVCM6ECNxBg2zac_h35g", "business_id": "J-iale4ilYuAXjnfLyYl1Q", "review": [["In my humble opinion, Beyond Bread and Fortunatos are the best sandwich shops in Tucson (ever since Susie's on Broadway next to Nadine's closed down about 5 years ago).\n\nUsually when you walk in you'll be put off by the line all the way to the door. Don't fret though, as the line goes quite fast and you can sample some bread while waiting. The kitchen service though can be hit or miss. It's usually only when you order a hot sandwich that it slows them down a lot. \n\nI ordered the Brads Beef which is roast beef, provolone cheese, green chiles, red onion, Russian dressing on white bread. It's so bad for you yet so good. Isn't that normally the case?\n\nImportant note to those who don't know. Avoid the Ciabatta bread at all cost. It comes standard on some sandwiches (though I don't know why). Those sandwiches have a tooth next to them on the menu. Why? Because you'll break a tooth on it, its so hard. There is nothing enjoyable about that bread. How many times do they have to be sued before it sinks in and they get rid of that awful bread or at least stop making it standard on sandwiches? (Tangent over)\n\nIf you have room afterwards try some of their awesome cookies. They also do the best banana bread and chocolate babka (Fridays only)."]], "date": "2015-01-09", "time": "00:41:56", "categories": "Sandwiches, Coffee & Tea, Food, Bakeries, Restaurants", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 256, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "FwD8jQoB0Tk4BQJYg-pybA", "user_id": "HvK_Fn1p--xXDDDx6KOxsA", "business_id": "5Z_KrsEQsPE0ibKwhYn3ZQ", "review": [["We ate breakfast, lunch and dinner here several times during our stay at the JW Marriott Starr Pass Resort. All meals were phenomenal. Service was superb. They catered to our son and were very accommodating to our requests. My favorite were the alcoholic drinks, tacos and sweet potato fries with honey mustard. Breakfast was also my favorite! The buffet was soooo delicious! Pancakes, omelettes, bacon, oatmeal and more all yummmo!!"]], "date": "2019-08-30", "time": "20:52:08", "categories": "American (New), Restaurants, Southern, Breakfast & Brunch, Beer, Wine & Spirits, Food", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 105, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "GgRUn4TY0BtcuFPDM4M5AQ", "user_id": "ywOGrnczzRAi1oqR55cBpg", "business_id": "QbRp4rVek6nOueiu4yjmdw", "review": [["The hamburger was amazing and I love the garlic chips and the delivery was really quick"]], "date": "2018-12-30", "time": "00:26:05", "categories": "Nightlife, Bars, American (New), Restaurants, American (Traditional), Sports Bars", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 45, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "IqLqEyCm9F7Jetkexmcleg", "user_id": "0byue-eYNYyW7JsZJdxC9g", "business_id": "IujwicxDML3FMfHURhkojA", "review": [["We used to love coming to this place after a hike or to watch a game and told all of our friends to come here for the amazing pizza. After moving to the west side my husband, brother, and I decided to make the 45 minute drive across town to come to our favorite pizza place. Unfortunately we had probably the worst service I have probably ever had at a bar or restaurant. First off, right when we walked in we felt unwelcome. While other people, which I'm assuming are regulars, got greeted warmly and immediately, we got the once over and were immediately asked if we were 21. We all ordered some pizza, appetizers, and a couple beers. The beer I got was not good and tasted syrupy, so after I took a sip I politely asked to have the beer replaced with something else. The server/bartender immediately said that since she poured it and I took a sip that I would still have to pay for this bad beer. My husband and I were like.... thats a strange policy to have. She became pretty argumentative, stating that every bar has that policy and if they gave everyone who didn't like their beer a new beer for free people would just do it all the time. What?! So I'm gonna take one sip of a beer, ask for a new free one, and repeat this one sip process over and over? Right... So then she asked the manager if I could have a new beer for no cost, came back with my new beer and said, \"Just so you know, I was able to take that beer off your check, just this one time.\" and she continued to go on and argue with my husband about how they just lost $7 (which we all know a beer does not cost the restaurant $7 off the tap). I told my husband just to stop because we were obviously not getting anywhere with this conversation, and we ate our food feeling pretty uncomfortable for the remainder of the visit. When we were done, we paid and left without anyone saying any sort of goodbye. I have worked in the food industry my whole life and have never heard of any bar or restaurant that forces custimers to pay for drinks or food that they don't like, and also try to make them feel bad about it.\n\nNeedless to say, we will not be returning again and will also not be referring our friends anymore. We spent about $70 at this establishment and they lost our business and our referrals over a $1.50 pour of beer. Sadly, looking at some of the more recent reviews it seems like this may be the new norm here. We will be finding other local businesses to support during this time. Hopefully management will read this and learn something."]], "date": "2021-01-17", "time": "18:59:34", "categories": "Beer, Wine & Spirits, Food, Pizza, Bars, Restaurants, Pubs, Nightlife", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 125, "predit_yelp_score": 1.075, "actual_yelp_score": 1.0}, {"review_id": "U_L9DI9P5jK16qrlrMj2WA", "user_id": "4Tc0YKS8gEIB6zN9YIL5xw", "business_id": "CAdWca4gHkpiUWVaYbONjQ", "review": [["Very upset with the service! If i could leave a lower rate for a review i would. My cat was unnecessarily cut on his leg and has a huge scar that i just found on him. I took him to the vet out of concern and ended up paying $100 for somebody's carelessness. Will not be returning here ever and do not recommend at all. Not to mention a horrible manager at that!"]], "date": "2021-05-20", "time": "16:18:20", "categories": "Local Services, Veterinarians, Pest Control, Pets", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 49, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "wZks_pFzhWh2YPsrUwOLqw", "user_id": "QaBNIUwzgN4v_5wjmlJOCg", "business_id": "UNMTu-K0XQfjDJ5i1JBl3g", "review": [["Well, it's a Home Depot.  Not much to say.  If you don't know what they have, you've likely been hiding under a rock for the last decade. Typically, I can find what I want here, even if it takes me a lot longer than I would like.  Can be tough to get assistance on the floor although I will say it has gotten better over the last few visits.  \nParking lot is sort of a nightmare as it essentially serves many stores all around the area."]], "date": "2013-01-16", "time": "21:01:35", "categories": "Building Supplies, Nurseries & Gardening, Hardware Stores, Shopping, Home Services, Home & Garden, Appliances", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 36, "predit_yelp_score": 2.025, "actual_yelp_score": 3.0}, {"review_id": "8_6I8jLXoaGZEW4GkfI4Zg", "user_id": "-HG7jO4hLCcwiiq4UC1MPQ", "business_id": "CRG4zjLMwVKqqbO0SC07qQ", "review": [["This review is about a year maybe two to late. My wife and I have been fed up with our kitchen situation... we couldn't find someone to remodel it the way we wanted. So we decided that if we can't have our kitchen, let's do the bathroom. So I looked in the phone booth and I saw the re-bath and o thought you know let's give it a shot. I've never had someone come into my home and tell me what I can and can't do.. this was no exception. My sales clerk consultant person was named Ramon. I know this because my uncles name is Ramon as well. He came to our house and already had a thought for my bathroom in mind and the wife didn't seem to happy about it. We were spit balling ideas back and forth and then came the monetary amount.... basically how much do you have to spend. Which our reply was \"we want this done, but we aren't in a huge hurry.\" \"If the price is right we can move on it today.\" But the problem was that Ramon couldn't give us any type of amount that this might be. It almost seemed like even though we were still getting estimates from re-bath and others we still haven't decided what route we wanted to take. Ramon took pictures, took measurements and got all of our info...... and NEVER RETURNED. We waited for him to call back. I live by a strict motto... if I see I'm gonna call you back, I will. I should not have to go out of my way to call you so you can call me. Well either way. no new bathroom. No phone call and it left a bad taste in my mouth to now I will most likely either do it my self or call my wife's father do do the job for me. That is all."]], "date": "2020-01-11", "time": "02:05:03", "categories": "Appliances, Contractors, Home Services, Home & Garden, Shopping, Kitchen & Bath", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 19, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "oT2cuLUmB310BkjxAxhb1w", "user_id": "Js1FsZ6oP_9tO5tbJN-d2g", "business_id": "jULirodENiDyCbtOz0v9aA", "review": [["I'm gonna go with a \"it's decent\" on this one. If I was rating them on delivery speed only, they'd get 50 thumbs up. But the food is kind of mediocre. \nI've ordered delivery multiple times, not because it's delicious but because they are faster than lightening. (And when you're in a bind, they come through). The price is definitely higher than other places and I'm not convinced of the value. \nI actually ended up walking into this place yesterday because a client gave me a gift card. I had never been in before. I ordered a sandwich, chips, and a drink. After I paid the girl just looked at me. I had to ask for my drink cup. Then when my sandwich was ready, they put it on the counter with no bag, napkins, chips. I asked if I could have a bag and the girl hands me one. I then had to ask for napkins and chips (was too go) and she pointed at a spot to grab chips. \nThe bigger bummer was when I opened the sandwich (had to eat in my car) it wasn't cut. Small details like that make a big difference to me. I just got the impression they could care less about their customers."]], "date": "2018-11-29", "time": "20:36:36", "categories": "Fast Food, Sandwiches, Food, Pizza, Food Delivery Services, Restaurants, Delis", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 33, "predit_yelp_score": 1.25, "actual_yelp_score": 3.0}, {"review_id": "X6HG8jobevzKO1PhGBSvHg", "user_id": "QAfrUpSr-UJgLErBO7U8oQ", "business_id": "yR_EfNX8NF_JQTo2LURR4g", "review": [["A welcome new addition to the neighborhood. They have a convenient location and the food is delish! Pizza take out beats all the others by a long shot. They are quickly becoming our go-to last minute dinner spot."]], "date": "2014-09-07", "time": "02:43:01", "categories": "Pizza, Food, Restaurants, Italian, Bars, Nightlife, Cocktail Bars", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 440, "predit_yelp_score": 4.5249999999999995, "actual_yelp_score": 4.0}, {"review_id": "TBtgpkylsM9A0qvM1w_QNg", "user_id": "1CBylrAKwx4rHV8B3t5BXQ", "business_id": "ceZRT6zsY-_NL7nLC2afvQ", "review": [["Great service by Carlos at the checkout counter. Helped me find the right cabin air filter and gas cap for my wife's car. And while he was checking me out he even took the time to come out to her car and check on a leaking washer fluid line. He got me a chunk of line to replace the leak in less then 2 minutes. Great customer service. Will return soon."]], "date": "2018-05-08", "time": "15:39:04", "categories": "Automotive, Auto Parts & Supplies", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 7, "predit_yelp_score": 3.35, "actual_yelp_score": 5.0}, {"review_id": "XFvEc2jRsmQe_z-OSmoZxw", "user_id": "40iwRp7nmWTQsyCPrSSZ3Q", "business_id": "ngbV-gevFxBVVrOUg1JsJA", "review": [["super nice staff!! michelle especially was so so friendly and helpful when cutting our fabric and answering my questions. really good experience here :)"]], "date": "2021-08-04", "time": "20:11:06", "categories": "Fabric Stores, Arts & Crafts, Art Supplies, Home Decor, Shopping, Home & Garden", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 22, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "fFroPP9zVrQ_ddi8EQV0Ww", "user_id": "jwzo_uLsB-4njvL2q0aUMA", "business_id": "liM5S5on5kfRDeaR14Wbvg", "review": [["Their drink menu changed but still both drinks were good. \nThey had new staff but Kyle was super friendly and helpful.  He recommended the drink The Last Word.  It was tasty but smaller than their usual size.  My friend said it was the size you would give a minor.  I had one of their new cocktails.  It was good but I didn't like it as much as their other menu."]], "date": "2016-12-21", "time": "06:26:22", "categories": "Lounges, Cocktail Bars, Food, Nightlife, Bars, Distilleries", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 112, "predit_yelp_score": 3.8249999999999997, "actual_yelp_score": 5.0}, {"review_id": "f05QjLukTXPqx0gODbgdoA", "user_id": "AjaC09DfJ8h5__fgqOMvGA", "business_id": "5sqtclJu_vo5qxNjIPW33g", "review": [["Super cheap produce! You can't really rely on the staff for much help, but they keep the place in order so I can't complain too much about them. I prefer to go late mornings to beat the crowds. This store can get pretty busy the later it gets. You've been warned."]], "date": "2018-08-06", "time": "20:30:13", "categories": "Grocery, Meat Shops, Restaurants, Delis, Specialty Food, Food", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 33, "predit_yelp_score": 2.8499999999999996, "actual_yelp_score": 5.0}, {"review_id": "9dVq35tQqSYr3D7ugukfFQ", "user_id": "ZCd8JIPT6bovm9-L3ZH1aQ", "business_id": "0f7mlSVIAk25QuEKGmVbPA", "review": [["My Dad lives right behind this new location and we love going to breakfast together so we were very excited once we saw this being built. I ordered D's potato cakes which were super delicious! They came with eggs a big biscuit and bacon, everything was very yummy! The service was great and super fast, the place was clean and colorful and I can't wait for their patio to be built. My Dad has gone a few times and said he hasn't been disappointed by anything he's ordered. Great place and great location!"]], "date": "2016-07-09", "time": "06:02:10", "categories": "Food, Restaurants, Breakfast & Brunch, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 205, "predit_yelp_score": 4.4750000000000005, "actual_yelp_score": 5.0}, {"review_id": "gpX9-LJJjhXJItpRHocA3A", "user_id": "y-Vv8W1qVm37pZ9TDVWbWA", "business_id": "yp9w-WtBpw0xbS4uXeDfyw", "review": [["My telemedicine appointment with Doctor Porter was outstanding!  She explained things very clearly and thoroughly.  She answered lots of my questions on a variety of different topics.  The staff at Natural Healing Care Center were all great, and I would most certainly recommend them for any of their various treatment modalities."]], "date": "2021-01-20", "time": "00:35:04", "categories": "Health & Medical, Massage, Physical Therapy, Acupuncture, Cannabis Clinics, Food, Naturopathic/Holistic, Grocery, Massage Therapy, Medical Cannabis Referrals, Cannabis Tours, Doctors, Beauty & Spas", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 16, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "GfpZXDA_vtN_wvCjUCbVaA", "user_id": "5CtlhXA2UNe8eR6LZlctaA", "business_id": "_1OKD3jnwKVFfrq6d4k4lA", "review": [["Excellent Nail spa! They use heated rocks on my tired feet!\nThe pricing is very detailed and they were able to repair my ingrown toe nail with precision!\n\nI strongly recommend this place!!"]], "date": "2018-08-02", "time": "00:10:10", "categories": "Beauty & Spas, Nail Salons, Threading Services, Hair Removal, Waxing", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 191, "predit_yelp_score": 3.675, "actual_yelp_score": 5.0}, {"review_id": "0uDDi5XLse6FQ2a25vb8Qg", "user_id": "ojgKUn9smDDquJe_CU4LXg", "business_id": "LqhBMAyBaea9ZSRyMPeVXg", "review": [["I found Kellie after doing my do diligence in researching eyebrow  microblading. My eyebrows were very thin and sparse due to a thyroid condition I developed in my forties, leaving me looking much older than my years. I knew I needed to have them filled in but couldn't imagine having two lines drawn across my forehead! During my consultation with Kellie, she assured me that microblading was the way to go! She was so knowledgeable and professional and ever so patient throughout the entire procedure and the results are AMAZING! I never have to fill in my brows, they never rub off, swimming is enjoyable again and I wake up looking great! Its a no brainer, LASH FACTOR is the best in the business! This was the best gift I ever gave to myself, hands down!"]], "date": "2018-11-21", "time": "04:14:59", "categories": "Shopping, Medical Spas, Eyebrow Services, Sugaring, Eyelash Service, Fashion, Health & Medical, Skin Care, Permanent Makeup, Beauty & Spas, Hair Removal", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 75, "predit_yelp_score": 4.175, "actual_yelp_score": 5.0}, {"review_id": "dFDPXJTr5L9E75tYIME5nw", "user_id": "4ZX0BDZyDG1HABrfk8_HPg", "business_id": "2njTjQ35skXN171KoobeGg", "review": [["I've visited here a handful of times now. The coffee and espresso are good, but I've had better around Tucson. The baked goods are delicious but crazy overpriced ($4 for a muffin? I'll pass). My main issues with this coffee shop are that the wifi isn't turned on until 11am and that the staff have never been friendly to me. If I smile and say \"Thank-You\", a response of any kind would be nice."]], "date": "2017-11-29", "time": "14:44:16", "categories": "Food, Restaurants, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 345, "predit_yelp_score": 2.425, "actual_yelp_score": 3.0}, {"review_id": "OLysDsuFRCPyvldtkjaa1A", "user_id": "hPuQIudnLHBJaJL7swpB8A", "business_id": "9zOvOmU2O6WDmhbwrc-QmQ", "review": [["Not bad tasting but for a grilled fish taco they were pretty wet which was disconcerting. I think I lost count of what number relleno I'm on during my one lady fiesta, maybe 6 days in a row.....It was HUGEANTIC but not stuffed with much of anything. The biggest turn off was my poblano had bell peppers on it and so did the fish tacos, everything tasted like bell peppers blah"]], "date": "2017-04-27", "time": "01:11:49", "categories": "Restaurants, Seafood, Mexican", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 97, "predit_yelp_score": 0.1, "actual_yelp_score": 2.0}, {"review_id": "ACPyT1HtaH9wOO_AjjqPHQ", "user_id": "3ltLuMN13l_hdYB-iZII6w", "business_id": "wexGsdw5Wz85-hOBx9r2Tg", "review": [["The workers seemed pleasant and the place was clean. There are four tables in a little patio area with misters, they were all full so we sat at one of the tables outside of that area and opened up the umbrella. The ramen was not as good as other places in town or in comparison to what I make at home. There wasn't much flavor to the miso or tonkotsu broth, I also wish they added an egg like other spots. Rarely go out to eat so was disappointed."]], "date": "2021-05-09", "time": "15:37:29", "categories": "Restaurants, Ramen, Japanese", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 511, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 3.0}, {"review_id": "DzPE8KYawT9XzysqjQQSnA", "user_id": "n7Qfuu3_JDTurLdBwJN3cA", "business_id": "oYmPLybREKceY-8gpD3rKQ", "review": [["Our King suite pool view room actually was a dark hallway view room located next to the laundry room that was open until 11:00 PM. I had to return to the front desk to ask for a room change and was advised that they had no other pool view rooms available, so much for having a reservation. To make matters worst there was no manager on duty so unless we wanted to look for another hotel after a 7 hour drive we were stuck. \n\nSo we stayed and headed down to the \"heated pool\" well the pool was in disrepair and had no heat and was too cold to swim in. We than headed to the hot tub and found that to be over chlorinated and too hot to enter. While we were down there checking out the pool there were intoxicated guys running around the pool area taking advantage of the hotels 2 free drink policy at happy hour, maybe they should have thought about having security on duty.\n\nSo we returned to our room to settle in for the night, although the bed was comfortable the noise of people running down the hallway and the pool area  made sleep difficult until after 11:00 PM.\n\nThe only thing remaining was to take advantage of their breakfast included in room costt offer. The breakfast is served buffet style and all we could say is the breakfast at IHOP was good. Thats where we headed after finding 80% of the food trays empty and the ones that weren't were cold. In fact, we watched a hotel guest empty a garbage can and replace the bag as he stated he\"felt sorry for the lone employee they had running the breakfast\".\n\nBy the way, there was not a manger on duty the next morning when we checked out and we are still waiting for a phone call. i guess I should have left a quarter for the phone call."]], "date": "2015-04-11", "time": "01:03:00", "categories": "Event Planning & Services, Hotels & Travel, Hotels", "city": "Tucson", "state": "AZ", "stars": 3.5, "business_review_count": 53, "predit_yelp_score": 1.05, "actual_yelp_score": 1.0}, {"review_id": "sQIhmsNAiH-IhEmHcFmjyQ", "user_id": "C1Id2JdEupigKpIxfDetdA", "business_id": "_jhBtG_3EGSpSE48K7iO5Q", "review": [["Food is AWESOME.  Staff is attentive and the bacon wrapped shrimp are TO DIE FOR. We go here A LOT"]], "date": "2014-09-14", "time": "23:18:14", "categories": "Restaurants, Mexican", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 120, "predit_yelp_score": 4.925000000000001, "actual_yelp_score": 5.0}, {"review_id": "2s2mbTzfprELRy8slNyiHw", "user_id": "NEHKtGLPZpakIU-gyjHZrA", "business_id": "Wcf04Kz9HGlOKazulJ2Jcg", "review": [["Ask for Michael Galvez.  He give free hugs with the purchase of a meal."]], "date": "2011-02-06", "time": "16:43:05", "categories": "American (Traditional), Breakfast & Brunch, American (New), Restaurants, Burgers", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 84, "predit_yelp_score": 2.75, "actual_yelp_score": 4.0}, {"review_id": "JhYPVurFeou9dQjUbFpRcQ", "user_id": "8IbZqfEpIXKatvOM8m-_DQ", "business_id": "dwuaUb0E5YplUp0rbMR7NA", "review": [["What a dump.Waited for my appt and after 15 minutes was informed by the only stylist there that she was running 45 minutes late. And had the nerve to ask me if I'd like to reschedule. In another life. Probably did me a favor."]], "date": "2017-06-08", "time": "22:31:45", "categories": "Waxing, Beauty & Spas, Men's Hair Salons, Hair Stylists, Hair Extensions, Hair Removal, Hair Salons", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 20, "predit_yelp_score": 1.4000000000000001, "actual_yelp_score": 1.0}, {"review_id": "I-g6b0u3_JeIgKkmesMEGQ", "user_id": "a0HTfUYBSqPlUWHCr8OIRw", "business_id": "Q22UzlwqkRkISP7LG4WXzA", "review": [["We ended up eating here twice during a recent Tucson trip and were pleased each time.  Portions are large so we shared but still couldn't finish everything.\n\nWe would happily recommend any of the dishes we tried.  Rigatoni Bolognese was rich and ample and good.  We liked the chopped salad, the bruschetta, and the pizza....all so good.\n\nHint, we could not finish the SMALL salad that we shared.  Like I said, rhe portions are large!"]], "date": "2016-10-31", "time": "05:19:38", "categories": "Desserts, Food, Restaurants, Pizza, Italian", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 281, "predit_yelp_score": 4.225, "actual_yelp_score": 4.0}, {"review_id": "cb6pSn34IkRE7lBJ0og4jg", "user_id": "khvn7hhX08g33N5niO676w", "business_id": "rNY5xg0FZSBopfmi-QZ_NA", "review": [["Rolled chicken tacos and a side of beans....a very very yum lunch. The red salsa in the squeeze bottle on the table is delicious.  I could drink it as a beverage, it's so good.\n\nIf you like carne seca, Lerua's has a very good rendition of this Sonoran specialty dish."]], "date": "2012-04-17", "time": "04:02:52", "categories": "Restaurants, Mexican", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 157, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 4.0}, {"review_id": "79uTfKmkKL2ASZ2lCGYt8w", "user_id": "UMmfQC_B7WD8NGySZHCvsQ", "business_id": "iXAHb5jmm8tmsGlh-DZNzw", "review": [["Never again. I got there ten minutes early for a 10am appointment. The stylist, Gina was 15 minutes late. I bought a Groupon for a basic Mani/Pedi but scheduled, in error, a shellac Mani/pedi (which I didn't realize at the time). Gina began by verifying what I was in for. I said a basic Mani/pedi (because that is what was on my Groupon voucher), but she insisted that I was wrong and that her schedule showed that I was in for a shellac Mani/Pedi (which is $40 more). I attempted to show her the Groupon voucher on my phone, but she waved me off with her hand and told me that I had made the mistake and, under her breath said, \"this is what makes me upset\". I wanted to walk out right then, but I had already bought the voucher. Gina never attempted to clear up the misunderstanding. Needless to say I was not happy. Getting a pedicure while you are mad at the person giving it, is an unusual experience. Neither of us spoke for the next 15 minutes. I didn't want to \"upset\" her any further for fear that it may change the way I was treated. After a little massage from the chair I was sitting in, I started to calm down and was able to engage in conversation. To be fair, Gina was very gentle and upgraded me to a shellac pedicure for no extra charge because she was out of regular nail polish for a French pedi. She seems like a sweet lady and she is good at what she does, but if there is a misunderstanding with a client (especially a first time client like myself), you want to make sure that you are not at fault...... and if you are, you apologize. She did neither. In either case, she should not worry who's at fault, but gladly except your customers patronage without showing a hint of frustration. This was supposed to be an anniversary gift from my husband and, unfortunately, it was not a pleasant experience. Will not be going back."]], "date": "2020-02-14", "time": "22:45:51", "categories": "Hair Salons, Beauty & Spas, Waxing, Hair Stylists, Hair Removal, Nail Salons", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 48, "predit_yelp_score": 1.0250000000000001, "actual_yelp_score": 1.0}, {"review_id": "DR7UBAAyF6C2Vzk-Pd3xSg", "user_id": "7xGw0Ie42dAAp3PMvVKOzw", "business_id": "WZUIlyefoUhuH_VkVCEyAw", "review": [["Based on the cheery staff and beautiful facility, the food came as dissappointment.  My son, a profsnl chef at a hi-end Calif restaurant, and I were guests of my family that lives in Tucson. They were well-received by all staff, as closer to friends than customers. So, it was surprising that the food delivery had some annoying mixups and delays. Scallops seemed frozen rather than fresh and were not cooked right. They were covered with a vague and watery sauce. Pasta with it also had watery sauce. I had a salad that was large and tasty. Another person had pasta that really wasn't up to the standards of a genuine Italian restaurant. They need to do some serious work on their pasta. Wine list and prices were very sharp. Wait staff should improve their performance instead of schmoozing skills."]], "date": "2011-12-02", "time": "01:24:40", "categories": "Italian, Restaurants, Venues & Event Spaces, American (New), Nightlife, Cocktail Bars, Bars, Pizza, Event Planning & Services", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 862, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 2.0}, {"review_id": "vkv_apiC_n-Wcg6MaLxqSA", "user_id": "UunTAINMW6Z03BL3n3R1_Q", "business_id": "vPSRs9RRGbv4Y4nNWyw5Vw", "review": [["This used to be one of my favorite places in Tucson for a healthy fresh meal, but I've noticed lately their quality has really declined.  My favorite for breakfast is the Cacao Warrior bowl, which when made right and when the fruit is ripe, is still very good.  But in this item, inconsistency seems to be a major problem.  Sometimes the bowl has been huge and other times extremely small and the proportions of ingredients blended into the bottom part always seems to be different.  One time this summer another customer got a bowl literally twice as big as mine at the same time as me.  I brought it up that my bowl was smaller than usual and instead of remaking it, they just added some more fruit on top.  A very nice gesture, but not the same as more acai blended in with coconut milk for the base.  I just let that slide.  Then the barkback app is never working either, except for the first time it was advertised as a frequent flyer benefit.  Today they told me to download the app on my phone and they would credit me for the visits I had missed.  When that didn't work (the app said they didn't have a loyalty card yet), the manager said he needed to talk to the upper management, but didn't offer anything in return.  \n\nThe icing on the cake was the Aztec steak bowl I ordered today.  It was a far cry from the original bowl I used to love, was not as advertised on the menu AND had a hair in it that was not mine!  YUCK! Instead of avocado was guacamole that was heavy on the cilantro, not a flavor that I like if it predominates.  Instead of cabbage was coleslaw - hello?! - not everyone enjoys mayonnaise on their fresh, healthy bowl.  Instead of bright quick pickled red onions as in the past, a ton of heavy wine (?not sure, but I'm not supposed to have alcohol) braised or poorly caramelized onions were substituted instead.  Finally, the beef did not taste like grass-fed as advertised and the quality was not as I remember it either.  All in all it just didn't go well together and felt very heavy.  Then after I found the hair, there was no turning back.  \n\nI called Goodness and spoke with Marley about this, who was really, really nice and refunded my money for the Aztec bowl immediately, so I'm adding one extra star for that.  Also, one star for the cacao warrior bowl when its good.  But with a name like goodness, I expect that to be all the time.  Really too bad because I love to concept - fresh, health and they support other local businesses, which is why in the past I'd tolerate their somewhat pricey menu, but after this experience I really don't think I'll be back.  I wonder if the management or ownership has changed hands or if after the expansion to skyline, they just can't keep up with the quality and consistency the way they used to."]], "date": "2016-12-05", "time": "22:23:38", "categories": "Juice Bars & Smoothies, Specialty Food, Food, Health Markets, Fast Food, Vegetarian, Restaurants, Salad", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 326, "predit_yelp_score": 2.3999999999999995, "actual_yelp_score": 2.0}, {"review_id": "rO4TLcpTpr1nGGInmbHSJw", "user_id": "mJy-5ShuwwYRayxRtl6xxA", "business_id": "vr1I1RkSL-m6c-LCAd3O7A", "review": [["Ok, so the honest truth is that there's something about Hifalutin that makes me not want to like it.  I can't really figure it out.  Maybe it's the decor, it's just not my thing.  However, I find myself reasonably enjoying my meals every time we go.\n\nOn our most recent visit this weekend, we arrived pretty early, just about 5pm.  The place was dead.  By the time we left, there were a few tables, but it never really got very busy.  \n\nLet's start with the decor and atmosphere.  It's very dark inside the restaurant.  This could be ok -- romantic even -- but in a cowboy-themed restaurant, it's a little bit weird.  The cowboy theme is also weird in and of itself in Hifalutin.  It just seems a little bit forced.  The wait staff has to wear cowboy hats?  Meh.  The theme is certainly not winning me over, but whatever.\n\nThe menu isn't very large, but I think there's probably something for everyone who in general is ok with southwest-inspired food.  Think peppers and enchilada sauce.  There are some regular items, like sweet potato fries and potato skins, but mainly everything else has some sort of southwestern twist to it.\n\nI ordered the chicken tortellini pasta and my husband had the pot roast sandwich.  Before the meal even arrived, complimentary blue corn muffins were brought to the table.  I honestly think they're delicious.  They aren't overly sweet, but they're sweet.  They're always warm and fresh, which makes them super soft on the inside.  The outside remains crunchy.  The balance is great.  They come with some butter, but I don't personally think they need any.  \n\nMy chicken tortellini pasta was good, but not great.  It was a good sized portion of tortellini.  They were also on the larger side themselves.  They were cheese filled, but I didn't really taste much of that.  The chicken was shredded and kinda hard to see in the plate because it blended in with the cream sauce that was mixed into it all.  It tasted good and was tender, though.  The cream sauce was also good.  The dish was also topped with some of their red sauce, which was basically a thick enchilada sauce.  It was ok.  I think they should have mixed it with the cream sauce instead of putting it on top, though.  It was definitely better with the cream than on its own.  Overall, I would get this dish again.\n\nMy husband always orders the pot roast sandwich here.  He just really loves it.  I tasted some of it, and it is rather good.  The meat was very tender and very flavorful.  The bun it comes on had cheese baked into it, which was a nice addition.  It came with \"cowboy\" fries, which were seasoned steak fries.  Nothing special.\n\nOur server was very attentive.  We weren't without a drink at all during the meal.  She was happy to bring us more corn muffins and whatever other extras we asked for.  She was also friendly and personable.\n\nThe prices here seem ok to me.  The portions are large and the food is of decent quality, so I don't mind paying a little bit more.  We will definitely return to Hifalutin."]], "date": "2013-07-21", "time": "22:13:08", "categories": "Nightlife, Mexican, Barbeque, American (New), Comfort Food, American (Traditional), Sports Bars, Southern, Bars, Restaurants, Steakhouses, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 239, "predit_yelp_score": 3.3249999999999997, "actual_yelp_score": 3.0}, {"review_id": "lWYkMtzKLEgi6Ps8UrGmdA", "user_id": "S9X5mp9NVJTVAa6B3D_xXw", "business_id": "Uo-2rFQso6YVwTJkEsqtQg", "review": [["I found this barber for my boyfriend who had been bouncing around to various different places. As a girlfriend, walking into II Sons makes you feel at ease that your loved one is not going to come out with a butchered hair cut. The people are friendly, the service is great and they REALLY do a great job. I would recommend this place to anyone and everyone! My boyfriend always goes to Rich who does an amazing job but I know everyone in there would do great!"]], "date": "2013-04-23", "time": "18:18:23", "categories": "Barbers, Hair Salons, Men's Hair Salons, Beauty & Spas", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 66, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "xDCGmaJHZxRcBQUsvjpkAQ", "user_id": "q0dJI7tOUW8By2vwX2gFyw", "business_id": "UCMSWPqzXjd7QHq7v8PJjQ", "review": [["Never can get piping hot coffee there don't know why! Had breakfast that was cold n ordered eggs medium well n they were runny like over easywon't be going back although it used to b ok few months ago but alas coffee never hot enough!"]], "date": "2017-09-05", "time": "04:23:18", "categories": "Restaurants, Cocktail Bars, Bars, Comfort Food, American (New), Sandwiches, Nightlife, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 4.5, "business_review_count": 2126, "predit_yelp_score": 0.1, "actual_yelp_score": 3.0}, {"review_id": "ZkvG45_-TOzQsTs3oFBNpg", "user_id": "yAZixpFz-eZKminzF2BXJw", "business_id": "x0eoomyyX1z7yeRcPglgSQ", "review": [["I use to love this place.  I've been a faithful customer for years and miss seeing \"Pancho\" the owner flinging hot wet towels to the customers with pinpoint accuracy from behind the sushi bar, well most of the time.  Now with Pancho moving on, the Oracle location is not nearly as good (in many ways) as it use to be.  Long waits for orders to be filled, wrong sushi presented because of careless chefs not reading the orders carefully, lack of  conversation skills of the chefs, excessive waits for beverages to be filled, etc.\n\nNow that I slammed the Oracle location, there's still light at the end of the tunnel.  The north location on the Catalina Hwy is a great second.  When there ask for \"Noel\", sushi chef extraordinaire.  I really mean it.  He's funny, friendly and loves taking care of his customers.  I think he learned his customer service skills from Pancho who he still sees from time to time.  Noel will even come up with some \"custom\" sushi if you ask him nicely.  This guy really makes the place come alive.  My wife and I love Noel's quality sushi and his personality makes it perfect to boot.   One last word about Noel, if he serves you as well as he does us, I recommend you leave him a gracious tip as a token of your appreciation.\n\nWe live in Goodyear, AZ and every time we drive through Tucson, we make a mandatory stop at Sushi Hama north for our \"sushi fix\".   Sadly we stopped at the Oracle location a few days ago thinking it was closer to I-10 and hence quicker to get back on the freeway.  We were wrong in several areas.  First with all the downtown exits being closed by ADOT for road widening, one has to take the \"scenic route\" from either south Tucson or Marana to get there.  No time saved at all.  Secondly, the extra time it takes to get to the north location is more than worth it in the area of quality and ambiance.  We won't make this mistake ever again.\n\nThe \"all you can eat price\" has gone up from $19.99 to $22.99, but its still a good deal for those who love sushi."]], "date": "2009-01-04", "time": "19:51:50", "categories": "Sushi Bars, Restaurants", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 82, "predit_yelp_score": 3.0250000000000004, "actual_yelp_score": 5.0}, {"review_id": "aZsjbWA4ySluD565yj0Stw", "user_id": "u6nttZdZzshEsEvBA0o6EA", "business_id": "OxBZqeYH5xuusEPp9ml7-g", "review": [["I drive from Yucaipa CA, just have lunch here, then i wait a few hours and have dinner here too. need I say more.\nthe Sanora Dogs are a burst of mexico's street dog flavor, the asada tacos like no other.."]], "date": "2012-05-16", "time": "02:17:15", "categories": "Mexican, Hot Dogs, Restaurants", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 636, "predit_yelp_score": 2.6, "actual_yelp_score": 5.0}]