[{"review_id": "vyK2pLJgE9azZ5cVbwcKTA", "user_id": "qVaW87Z2X1N43BJhGpExoQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["It takes for ever to get in...lines are long.\nMany other great restaurants...not woth waiting in line."]], "date": "2015-08-15", "time": "04:30:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 3.0}, {"review_id": "2H6NVefyvwaTnxSOeF0N3Q", "user_id": "9hBeu_8e5xvvWmIQ4r6DPA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The only thing I ever get is oysters, raw and char-grilled. Anytime I get other new orleans cuisine it really doesnt stand up to high expectations. I wouldn't ever introduce their gumbo, jambalaya, red beans or po boys to  newbies or visitors as new orleans cuisine. Im sad it just isnt good :( BUT AMAZING OYSTERS!"]], "date": "2014-04-03", "time": "15:49:42", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.325, "actual_yelp_score": 4.0}, {"review_id": "XHLez3fz9MSaGJ27kS3P8Q", "user_id": "429FhMH3KnMJYl5nkH2Jmg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["During my 5-day stay in NOLA, I was lucky enough to stay in the quarter and I went to Acme almost everyday.\n\nFor its price, Acme worths every penny. $10 for a dozen of freshly shucked oyster is pretty decent. But don't pay extra for the baked ones, they are not as good.\n\nI never walked out of Acme paying more than $20\n\nAvoid the long lines, remember to get there early, before 5pm, get some oysters, local \"amber\" beer (i forgot the name), then walk around Bourbon St and go somewhere for your real dinner.\n\nIf you are expecting a nice and fancy oyster bar where you can order oysters by their names, Acme is not for you.\n\nP.S. I think Acme is way better than Felix."]], "date": "2010-01-21", "time": "01:03:12", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.05, "actual_yelp_score": 4.0}, {"review_id": "uHc7WE6zx763Bb7CZn0oaA", "user_id": "L_4zBUJh_tJumXort3XmeA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The wait was down the street for a table but we sat at the bar and got right in. Came in specifically to try the soft shell crab and got to watch oysters being shucked the whole time we waited. Very cool experience."]], "date": "2021-10-18", "time": "14:55:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.55, "actual_yelp_score": 5.0}, {"review_id": "I8rPPU8Vz23Ry1qff5Ss2w", "user_id": "-k5yFUChotBMGQgHdFZvLQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["This was exactly what I was looking for out of a New Orleans feast.\n\nGreat food, reasonable prices, incredibly fast service.\n\nI'd return and bring my friends."]], "date": "2011-09-20", "time": "04:12:25", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "dbhZ0qgZ7V08iDtD1P3bTA", "user_id": "n0b57MLhxMSs6wgx2fbv_g", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The food is fantastic but the service is very crappy, the server was rude, short and not friendly at all \nOtherwise, the restaurant would have gotten five stars from me and my family"]], "date": "2019-01-29", "time": "19:34:53", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.0, "actual_yelp_score": 3.0}, {"review_id": "_geJfIMRbUpwyftZHVDJHQ", "user_id": "Iyhsv0C4CUYtwaROhX_Glw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["So I visited New Orleans with my sisters and one of them heard great things about Acme. I personally don't eat seafood, but didn't wanna deprive them of the experience so I tagged along anyways. I had the New Orleans Medley and it was amazing. Granted I might have been drunk, the food was still soooooooooo good. One of the cooks, Hollywood l, also encouraged me to try their smoked Oysters. And S/O to Hollywood, because that man changed my life forever with those Oysters with the smoked sauce. I've been craving them ever since I left! Definitely a must try when in New Orleans. But be prepared to wait in line, it was about 25-35 minute wait but its honestly worth an hour wait. Again, its a must try!"]], "date": "2021-06-18", "time": "03:18:12", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.625, "actual_yelp_score": 5.0}, {"review_id": "TkySlVzmSFKhvQyWj3oxPg", "user_id": "lUExIFKucf-GvMUoXA3SgA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The Place had a great vibrant atmosphere. The chargrilled oysters were fantastic (if you get the raw oysters I recommend eating them with some saltines and Tabasco) and they had fried soft-shell crab that were amazing. I would definitely go back."]], "date": "2014-08-22", "time": "16:34:39", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "92-hVS1kjyCIDl9vNLCGfw", "user_id": "gPHhrtm3ujK6vO2PTuP8wg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Char grilled oysters are delicious. Smothered in butter and Parmesan. The raw oysters are Pristine as well. Then we had the peacemaker po boy their signature dish. Fried shrimp and fried oysters with a spicy roumalade sauce. Also had the sampler with andouille seafood étouffée red beans and rice and jambalaya. Étouffée was eh red beans eh. The rest was bomb. Def a NOLA must go"]], "date": "2014-05-25", "time": "22:24:05", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.85, "actual_yelp_score": 4.0}, {"review_id": "dJ7NEqnFFVWjIz2VDY99xg", "user_id": "BZ9s2qX077wWs7HIOer5xg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["This was our first food stop in NOLA. I was hesitant to go because I'd heard that its booming with tourists and that the wait is ridiculous..but well...we WERE tourists...and gotta try the place we've heard most about right?! We were ready to brave the line!\n\nAnd yes, the line was indeed long, but went suprisingly fast. We had a group of 10+ people, and got seated within 20-30 minutes. (with the excitement of being in NOLA and taking pictures and chit chatting, time flew by!) \n\nThe goods:\n-Bustling, vibrant environment in the heart of French Quarter, a block from Bourbon st. A great way to start off our first night and get us pumped up!\n-Their Hurricanes, though pricey, were delicious!\n-New Orleans Medley: jambalaya, sausage, gumbo, red beans and rice. A perfect tour and preview of the foods to come!! (I especially enjoyed their jambalaya..so full of flavor!!)\n-Their Chargrilled oysters were delicious!! chockfull of flavor!! and so juicy! (as were their raw oysters) \n\nThe bad:\n-Oysters were really small in comparison to other places i visited that weekend. (Luke's *cough* happy hour!!) \n\nI'm glad we decided to go. It was a great way to start off our NOLA week, and a delicious preview of the foods to come. Warning is that it is a bit pricey. (once again...Luke's happy hour!! *cough*)"]], "date": "2011-12-22", "time": "22:41:41", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.2, "actual_yelp_score": 4.0}, {"review_id": "8JpTE_e6ZL0gbhRVyIeDZQ", "user_id": "cY_Yf-uMGW5meHtIyl5neA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Everything was delicious!! Charbroiled oysters were so good; order at least one dozen. Gumbo is awesome. The Acme special, soft shell crab, and crawfish po boys were all amazing. \n\nBread pudding was good too, but expensive for the portion you get.\n\nMinus one star for the peace maker po boy. Half of the po boy had shells, making it inedible."]], "date": "2015-03-26", "time": "13:25:01", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.5999999999999999, "actual_yelp_score": 4.0}, {"review_id": "eHt9Ws_Wog0CWC5yEsiyTw", "user_id": "w5o0q2Z0F_R8Wv5ffNAk0Q", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["First timer! This place is always recommended but the lines were always sooooo long. Thankfully, we came on a Sunday afternoon and we waited less than 10 minutes. Rhonda was our server, and let me\ntell you, she went the extra mile! My throat was sore and voice was gone from partying the night before. I asked for a cup of tea and she said they didn't have any, just ice tea. BUT SHE MADE A WAY. Shortly after she came with a piping hot cup of tea with lemon. I am forever grateful. Besides that, the service was great. We indulged in the chargrilled oysters, raw oysters, and a bunch of different entrees for our party of 4! Definitely check it out if you can!"]], "date": "2019-11-18", "time": "00:49:15", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.025, "actual_yelp_score": 4.0}, {"review_id": "mSyMdUysAKimbtXQHSF2LQ", "user_id": "L1qhUkRW5b1sYpRuLPe3uA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["WOW!!!  This place was amazing. We did t have to wait long because we went around 5. Everything we had was 5 stars. The Oysters, crawfish, jambalaya, hush puppies. We will definitely be back."]], "date": "2020-02-21", "time": "01:56:48", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.125, "actual_yelp_score": 5.0}, {"review_id": "W4jewYs7We5_8EVotySvDw", "user_id": "OJdXNtM-PoMowhn26njYRg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Everything was phenomenal (except for the gumbo.. It didn't really taste good at all)! The jambalaya was the absoluteeeeee BEST I've tasted in Nola. The red beans and rice were delicious. We also ordered the chargrilled oysters which were great and the seafood gumbo with crawfish which was also good. I would highly recommend this place. We went on a Friday night. The line was long but we got in in less than a half hour. It's definitely worth it!! A must try spot!"]], "date": "2015-06-21", "time": "06:12:21", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.275, "actual_yelp_score": 5.0}, {"review_id": "cSKkr_NL5kwVKWY7iSdEpQ", "user_id": "9LhX_-3ZFhNSgButpSWS5w", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Delicious. It's a tiny joint, and they sure know how to pack it to the breaking point, but the food is 100% worth it. The chargrilled oysters, soft shell crabs, and French fries smothered in roast beef debris is what makes life worth living for these days. This place is a New Orleans institution, and no vacation is complete without it."]], "date": "2021-10-26", "time": "00:47:11", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.4000000000000001, "actual_yelp_score": 5.0}, {"review_id": "X8dBu_Ps3E5HSlRXs0VgMw", "user_id": "PtD-ku_bORwUgFaYa7u7Qg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The food and drinks were very tasty. That said, everything else was awful. The hostess was like a burly, peed-off bouncer, had the attitude of \"you don't like it, go somewhere else\". Everybody else inside had the same attitude. Clearly, the long line outside gives them the feeling that the food speaks for itself, there's no need for customer service, the idiots will keep coming anyway. Well, I WILL NOT!"]], "date": "2013-04-01", "time": "21:00:06", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.825, "actual_yelp_score": 2.0}, {"review_id": "U922mMx7mW_PbH1hsZk6mA", "user_id": "yoznWDhnmkKrQLk__LhnBQ", "business_id": "4dW3dmdYRsfen8a2AtfZvg", "review": [["Nice alternative to the Sonic and Popeyes (and I looove popeyes) fare that they offer before security.  \n\nHad the jambalya and gumbo and both were really good (picture attached)."]], "date": "2011-07-07", "time": "14:38:13", "categories": "Restaurants, Seafood", "city": "Kenner", "state": "LA", "stars": 3.5, "business_review_count": 29, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "_ecvHRqSPCk_gscUtMDhOg", "user_id": "fYK7u7P9gJ67X9RXZzuuEg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["3rd visit to Acme out of three trips to The Big Easy and of those, this one was a disappointment. We got the usual house dozen raw oysters and they were tasty but small. We opted for a couple of oyster shooters and, well, they were tasteless, harsh and tiny, not worth the $2.50 each, that's for sure. \n\nWe were craving crawfish that unfortunately are out of season in October, but we're on the menu in a Po'boy so we thought from Acme, it had to be good, big and tasty with a couple of beers. Turns up they were meh, dry and over-breaded. Over-breading seems to have been the operative word this trip as that's about all we got as the side order of fried oysters we talked them into we also REALLY tiny and tasted like deep-fried.... Breading rather than plump, tender juicy, fried oysters- quite a disappointment from a past quite quality establishment. On a positive though, the cocktail sauce was outstanding, just not enough for a good rating this time.  Hope they rebound cause it's all about the \"food\" y'all...."]], "date": "2015-10-18", "time": "02:07:56", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.3, "actual_yelp_score": 2.0}, {"review_id": "jaVp7LBo0mJt6k-q22XOMw", "user_id": "bbTuA1FFfJb-fGfdxOa47w", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I will be the 100th person to say this on Yelp, but the char grilled oysters are amazing.  I went with a group here and was a little apprehensive due to lines of tourists and neon sign, but the place was fabulous.  Well priced food for the area and again- the char grilled oysters were delicious.  I had some the next day at different restaurant and they were not nearly soo good as at ACME."]], "date": "2010-02-25", "time": "21:28:53", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.9000000000000001, "actual_yelp_score": 4.0}, {"review_id": "qmDIHXu4l4hm08wWVo_F1A", "user_id": "1WE0E1ewe2ZZU0l3V5vNWQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["After seeing Acme on Man vs. Food, I thought it would be a good addition to my food your of New Orleans. Everytime we passed by, there was always a line, so we chose another restaurant instead. However, on our last day in NOLA, we knew we would have to tough it out and wait. For lunch around noon, it only took 20 minutes. We were seated at the oyster bar and promptly served our food. We ordered the piece po-boy which was topped with tabasco mayo and filled with oysters and shrimp. So delicious and on the most perfect po-boy bread imaginable. We also ordered the sampler plate that had seafood gumbo, andouille sausage and red beans and rice. Everything was flavorful and delicious. I am so glad we finally got the chance to eat here-it was worth the wait!"]], "date": "2012-01-03", "time": "18:59:42", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.3, "actual_yelp_score": 4.0}, {"review_id": "3IeuCR1TEJWfw1XnZUJSyA", "user_id": "gYulsPdv-abzuSJKZl_rJg", "business_id": "Ppy-UN5RptIog4AvNnAM-g", "review": [["I'll keep this short and sweet and to the point.\n\nFood: Delicious!! We had the crab claws and chargrilled oysters for apps, and the Fish Pontchartrain, Grilled Shrimp and 1/2 Fish 1/2 Shrimp entrees. The crab claws were meaty and the buttery seasoned sauce was very good. I still prefer Copeland's version, but these were good. The chargrilled oysters were good, but they were on the small side, like baby oysters. Again, I prefer Neyow's or Drago's version. What really shined were the entrees. The fried fish was very tender, delicately fried and well-seasoned. The shrimp, fried and grilled, were on point. The hush puppies were fluffy, plentiful and tasty. I don't know how my daughter's fries tasted, but my son enjoyed his sweet potato fries. \n\nService: Our server Jade was very friendly, but not as attentive as we would've liked. For example, a table that were sat after us received their chargrilled oysters earlier than we did. In fact, our oysters came after our entrees. When I asked what happened, she blamed it on the guys in the kitchen saying they were backed up. We would've preferred the honest answer that she just forgot about our order. Besides that snafu, however, she was very sweet. \n\nAmbiance: What can I say, it's Acme. Don't wear your Sunday best. It's straight up casual, almost bar, hole-in-the-wall casual. I dare say New Orleans Food and Spirits is more upscale in comparison."]], "date": "2018-07-02", "time": "01:16:48", "categories": "Seafood, Sandwiches, Cajun/Creole, Restaurants", "city": "Metairie", "state": "LA", "stars": 4.0, "business_review_count": 775, "predit_yelp_score": 2.025, "actual_yelp_score": 4.0}, {"review_id": "w9aLamTJ8d_mXsimbhZL4Q", "user_id": "RCRLvr0S4wnjmnYSVdTFQg", "business_id": "Ppy-UN5RptIog4AvNnAM-g", "review": [["Visiting from dallas. Went here for lunch with a date (party of 2) came back for dinner with a party of 12. We spent a better part of the hour wait in the bar,  where Amanda did an amazing job taking care of us.  The hostess (unfortunately,  I don't know her name) was great,  remembered us from lunch and came to tell us the status of our wait. The waiter, Scott, was patient (read: we were in the bar for an hour and Amanda took care of us), informative, funny and very good.  Did a great job handling a large party.  \n\nThe food, of course, for lunch and dinner was amazing.  Between the two meals we had: raw oysters, charbroiled oysters, crawfish poyboy, the specialty sub that I can't think of the name, the gumbo and the ettouffe.  My nephew had the soft shell crab ams loved it. \n\nA.maz.ing. All around. Seriously"]], "date": "2014-10-05", "time": "03:29:48", "categories": "Seafood, Sandwiches, Cajun/Creole, Restaurants", "city": "Metairie", "state": "LA", "stars": 4.0, "business_review_count": 775, "predit_yelp_score": 2.425, "actual_yelp_score": 5.0}, {"review_id": "758VvfN3IfKTRarPIuCziw", "user_id": "ex1TOPPWijTLIOTTmZmDTg", "business_id": "Ppy-UN5RptIog4AvNnAM-g", "review": [["Food and service was really good. The broiler oysters and  oyster shot was very good."]], "date": "2019-08-11", "time": "20:31:31", "categories": "Seafood, Sandwiches, Cajun/Creole, Restaurants", "city": "Metairie", "state": "LA", "stars": 4.0, "business_review_count": 775, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "zaEinAw8LnoFYYwG-81obw", "user_id": "lKtXiX-jMZWXpIh4ac1GOQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["My friend and I arrived here for lunch on Sunday around 1:30pm. The wait was like 20 mins. \n\nI ordered half a dozen of raw oysters, half a dozen chargrilled oysters, cole slaw, and coke. My friend ordered fried shrimp po'boy, fries, and a pineapple margarita. We loved everything! Very flavorful and filling. \n\nThis place was almost rated 5 stars until it took the waiter too long to bring my banana foster cheesecake order, bill, and change. Everything arrived separate times at least 5-10 mins apart. \n\nI gotta say though the banana foster cheesecake is delicious! \n\nTip: Remember they charge extra $9.50 for alcohol in your margarita. You end up paying $19 total for a margarita."]], "date": "2018-02-18", "time": "23:11:36", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.025, "actual_yelp_score": 4.0}, {"review_id": "iP8hxQIfISHhPTjArCAkfg", "user_id": "bT4_4t1O_4bT8jbINzwkdw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Was really disappointed. There was a line outside and our Uber driver recommended it so we were pretty excited to go. The oysters were not good at all and were really muddy. The soup was okay. We could hardly ever find our waitress to ask any questions or just get the bill."]], "date": "2019-08-21", "time": "02:32:51", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.5, "actual_yelp_score": 1.0}, {"review_id": "1GtTUB0zEQB5U3qXric64Q", "user_id": "riWDgbauId8TK7YFVgMNJw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Acme. \n\nLong lines, long lines. \n\nNaturally, oysters on the half shell are my favorite, but you can have all thing fried in terms of seafood. They offer a decent Bloody Mary. The service is quick and efficient.  However, sitting at a cramped bar trying to enjoy these items are next to impossible. I'll saunter elsewhere where it's not a chain."]], "date": "2013-05-02", "time": "20:41:23", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.75, "actual_yelp_score": 3.0}, {"review_id": "mDijmrjSJ_yE3u91H-o2bw", "user_id": "XH1EyLzxfdR16CBb7CZruw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Acme Oyster House food is good I had the shrimp platter and shrimp and crab jambalaya... the shrimp were seasoned to perfection... I will definitely re-visit"]], "date": "2018-08-20", "time": "15:09:14", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.625, "actual_yelp_score": 4.0}, {"review_id": "bHN_Fwl4fZtusBH9RJDNlg", "user_id": "h2jyhXfoFFD-MHtjwaf7iQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I read the reviews & had high hopes for Acme.  \n\nWe started off with gumbo - I had a cup, hubby had a bowl.  We also ordered oysters & a fish/shrimp platter.  I was a little leery about ordering the fish as I hadn't heard of \"swai\" fish, but our served kept raving about it.  The gumbo was ok, wasn't really seasoned that well.  The shrimp was just ok as well.  I wasn't a fan of the fish at all.  **Side note:  I read up on swai fish after we left & found out that it's a type of catfish [white fish] and are raised in unhealthy fish ponds in Vietnam.  Gross!!  \n\nAnyway, the oysters were really good - so 4/4.5 stars goes to the oysters.  Ummmm, I'm not sure what it was; but shortly after we left, I had a horrible upset tummy ache.  Let's just say, something I ate there didn't agree with my tummy."]], "date": "2019-12-10", "time": "15:03:46", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.875, "actual_yelp_score": 1.0}, {"review_id": "SuEx-DcLpgo7uBfayIt1tA", "user_id": "HOAmZPJ7FCoOAM60iIA_1g", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Charbroiled oysters and Fried crawfish were delicious little pricey. Nice service. Food came to the table cook. Veggie burger was pretty good. Only one vegetarian option. Soft shell crab was good. The Resturant was clean."]], "date": "2017-11-08", "time": "23:54:18", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "Tk0TTxJNaFt3tE3IK0AmSQ", "user_id": "iw6dZqYYIGGPz8i0QllINA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I had to try oysters on our visit to New Orleans. There are so many oyster restaurants. It was hard to choose one. Hands down this restaurant takes the cake. The raw oysters were the best. They were delicious and so smooth. The charbroiled oysters weren't for me. They were really too rich because of the butter. The soft crabs were large and lightly battered with crispy fires and coleslaw. We finished off with a cheesecake which looked market bought but it tasted really good. Our server was great. The only bad thing I can say is the wait was 20 minutes outside in the cold."]], "date": "2020-02-29", "time": "07:17:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.75, "actual_yelp_score": 5.0}, {"review_id": "m6OBWUeAz12m-tg2x_r7cA", "user_id": "F8_jeICkvrkLNPdfRYO_5g", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["AMAZING fresh oysters. Both raw and grilled were delicious, and only $15.99 for a dozen. I also had the soft shell crab poboy, which was good as well. If I had to do it again i'd just have three dozen oysters for lunch."]], "date": "2008-03-14", "time": "04:48:11", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "viJxUzrSwzb7BBXVhAkKEA", "user_id": "TwPzJ4l6GiR6TyVK4HCQ8A", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["We were lucky to walk in and go to the bar but within 5 minutes after we walked in the line was around the corner. Will it be worth the wait. Yes indeed. This was our first time eating oysters and they were amazing. We had their famous charbroiled oysters. The drinks are great also. Definitely will be visiting again the next time we're in the area."]], "date": "2019-11-16", "time": "14:07:17", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.8249999999999997, "actual_yelp_score": 5.0}, {"review_id": "4K9TYGhkLYz7zJKNEm4rgg", "user_id": "Y2iLLq02CUVfKHsowQ4wXw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["We ate here last night at a friend's recommendation. It was my first Louisiana-oyster eating experience so I wasn't sure what to expect - but they were quite delish! However, I'd have to agree with Christine B.'s, review...the chargrilled oysters were outstanding. I mean, you can pretty much throw spicy butter and a handful of cheese on just about anything and I'll love it, but these truly were fantastic. The red beans and rice were so-so, but I'm no connoisseur of Louisiana cooking so I won't go too far...all in all, good food but not sure I'd run back."]], "date": "2007-04-17", "time": "20:00:06", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "x8uRhc1EGtOwB5ujZhljpg", "user_id": "dWlYlaRFVjiRN5b3a_3ABg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["OYSTER SHOOTERS ARE WHAT DREAMS ARE MADE OF. I will forever daydream of this restaurant and NO you can't have these just anywhere. This place made AMAZING CHARED Oysters and other fried goodies... but the stuff I'll forever remember NOLA for are the oyster shooters and OYSTERS... just trust me they are worth the line!!!"]], "date": "2017-02-06", "time": "03:28:50", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.825, "actual_yelp_score": 5.0}, {"review_id": "APDx1wIZ9gPMfzBJgefnfQ", "user_id": "Qn49RX3JRzvsSeM6svOKqw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I had Oysters and Crawfish Etoufee here. Service was fast and nice and i found it to be inexpensive. The line was some what long but I think thats for show- as we were seated in about 2 minutes."]], "date": "2008-11-06", "time": "16:30:01", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 4.0}, {"review_id": "_G2AVlqPOm9rQudpJrltog", "user_id": "Mu8lqKqs7WzCg3LI5KLQNg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Went here to re-live the glory days from when we went here 15 years ago. Chargilled oysters, fried shrimp. Staff is nice, but service is slow, forgetful. Kind of overpriced considering the options."]], "date": "2016-06-27", "time": "00:59:23", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.1, "actual_yelp_score": 3.0}, {"review_id": "QFdOUs2_MLAIO_cJ8PFD9g", "user_id": "wpUNBAumEH9-2AKrFHb7zw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Came here on a Saturday at 2pm, and there was still a line of about 20 people outside the door. Luckily I only had one other person with me and there was an open spot at the oyster bar so we didn't have to wait.\nThe oyster bar area was a bit narrow for a lot of food, but the food comes out one at a time so you can finish each dish as they come out before the next dish comes. Also your server is the same person shucking oysters and its amazing to see them shuck oysters at lightning speed while still remembering your order.\nRaw oysters - Just about the same as any other oyster joint in New Orleans. Pricing was about average also.\nChargrilled oysters - Super delicious. They give you bread on side too so that you can suck up all the yummy juice in the end and eat it.\n1/2 Fish 1/2 Oyster platter - Deep fried perfectly. By this time, we were both really full and couldn't eat any more, but we still managed to finish half the platter.\n\nOverall a great experience and food. The food here was a bit cheaper than Royal House too."]], "date": "2015-09-02", "time": "05:33:24", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.55, "actual_yelp_score": 4.0}, {"review_id": "j-mzPoNl43MnLkeku3aUsg", "user_id": "fQcfRZkcOO-MXFYD5umf2w", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["So I didn't have the oysters, so perhaps that was my mistake.  Instead I followed David N.'s advice and tried the shrimp etouffee with crawfish tails.  Pretty good, but the shrimp were the tiny ones which was a little disappointing.  The wait can be crazy, I went at like 515 and had to sit at the bar.  When I walked out of the place there was a line about 20 people long!"]], "date": "2016-10-06", "time": "18:37:28", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 0.0, "actual_yelp_score": 3.0}, {"review_id": "5-oAr21Gp5wEziKgqJ1x0g", "user_id": "86CBMvSzbttMNC7n1lP-uQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Came at 3 pm and had a short line. I tell you what worth the wait. The grilled oysters are to die for. And we got the combo oysters and shrimp po boy.  One of the best I've had.  Another gastronomic must do in NOLA."]], "date": "2016-09-17", "time": "21:00:20", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.6249999999999998, "actual_yelp_score": 5.0}, {"review_id": "5Pdtwjs4BLDzpUNjkBTA6Q", "user_id": "DtzNDXjITs8_C_wbPfbEGQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["It's a decent spot and the chargrilled oysters are pretty good, but I like the butter basting at drago's better"]], "date": "2016-12-11", "time": "00:24:35", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "ampQslrWZx3ldDA33Sotrw", "user_id": "BsfSglO7RkFTQ0j2mEQynQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["BEST OYSTERS.....EVER! Chargrilled or raw, they are HUGE and the BEST!  Bloody Mary's and red beans and rice are awesome, too.  Sit at the bar and watch the oysters get shucked fresh to your table!"]], "date": "2013-04-23", "time": "22:12:14", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "0ARayZQDFog4kfx7hKmYjw", "user_id": "7bZMOSknOEDb7ima3ja52A", "business_id": "Ppy-UN5RptIog4AvNnAM-g", "review": [["Oh so good!!!  We were just not up to fighting traffic and lines at the French Quarter and decided on the location in Metairie. It did not disappoint .  The chargrilled oysters were as good or better than I remembered. We Alabama tried the candies fried oysters. Everything was amazing. Worth the long drive from Texas!!!"]], "date": "2020-01-04", "time": "01:55:42", "categories": "Seafood, Sandwiches, Cajun/Creole, Restaurants", "city": "Metairie", "state": "LA", "stars": 4.0, "business_review_count": 775, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 4.0}, {"review_id": "K-o8EtcdZbJwLTFsz9mq2A", "user_id": "qHiZ1YrY5JFco0AOI0MIcg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Yea. Eat here. You will not regret it. Sat at the bar with Miss Pam. Jumbalya, chargrilled oysters, hush puppies... still dreaming about it. EAT HERE! We got there at 6 for a party of 2, we were seated within 15 min of waiting."]], "date": "2019-03-31", "time": "17:16:12", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.7249999999999996, "actual_yelp_score": 5.0}, {"review_id": "kvGWSu20RAydn88sKdF_Hw", "user_id": "jGzqqGRmABQuvN8dw_sk8Q", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Oysters are very fresh, large and juicy. The chargrilled oysters are AMAZING! With garlic sauce! The shot with oyster is strong:) \nCrawfish is good but a little expensive. 3090 bar has more inexpensive and juicy crawfishes."]], "date": "2016-04-03", "time": "22:19:18", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.3750000000000002, "actual_yelp_score": 5.0}, {"review_id": "mpcsatp8cxDnTkVdOSOS2Q", "user_id": "Da1YsoioiD45kCX0smOcXw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Definitely think the charbroiled oysters here are better than Drago's. The overall food isn't though.  I think they lack a bit in the po' boy area.  A lil stingy on the shrimp, etc. compared to any of your generous neighborhood po' boy spots. Visitors probably will never know that lil' tidbit. \n\nThey do create a nice atmosphere to take watch sporting events, and I must say, hush puppies...mmmm. They do a perfect job in that area,\n\nChar broiled oysters, a big blue moon in a frosted stein, and hush puppies...can't go wrong here.\n\nLastly, one thing that saddened me is, they don't allow you to order charbroiled oysters to go.  I was devastated to find that out, but they still deliver on taste and quality."]], "date": "2012-10-09", "time": "14:55:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.8, "actual_yelp_score": 4.0}, {"review_id": "jY1ypPst2pX1COPQYk4kkA", "user_id": "o9Sci4VyAh9hgkXiiQ9B1A", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Very good food!!! Service could be better. Oysters fresh and char grilled are the best."]], "date": "2019-01-20", "time": "19:17:08", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.4499999999999997, "actual_yelp_score": 4.0}, {"review_id": "BygFn5yiPm-U92ZMm9ATsw", "user_id": "egtD3QDv__ldvbYgZf-kMg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Historical restaurant that everyone should at least check out.  So times it's a 3 star sometimes it a 5 star. It all dependent on how busy the place is. \n\nWe sat at the oyster bar area and we were greeted by a man who worked triple duty on us. \n\nHe was shucking, waiting, and bar tending for us the whole night. \n\nAfter 2 dozen raw and 1 dozen grilled oysters we were happy hogs.\n\nLove this spot!"]], "date": "2015-11-16", "time": "19:19:59", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.4499999999999997, "actual_yelp_score": 5.0}, {"review_id": "XiklS72VvHnTlFnNlxVQ7g", "user_id": "BJ3WjIkH_n1XogifvZ2Q2w", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["This was our last stop in New Orleans and was seated right away. We ordered some po-boy sandwiches which were delicious,good service,good vibes and good food. Check this place out, it is awesome."]], "date": "2016-05-27", "time": "23:15:37", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "tavzEzKBz58NZqArXlZiSQ", "user_id": "5VB6mr6ZthlDHEJdgLsQDA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Just chomped on 2 dozen oysters, fresh and chargrilled!!  Yikes so much better than Cali. The Cajun medley was great. Just the right portion sizes. Great fresh seafood!!!"]], "date": "2013-11-26", "time": "23:44:57", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.7249999999999996, "actual_yelp_score": 4.0}, {"review_id": "YTcwbbBivoGzRAdmRpzQGQ", "user_id": "sG2a_3oTZUKKxKZiCc4RtA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The line was a little long but so worth it. Our party enjoyed everything that was ordered except the Seafood Gumbo (a lil salty) but overall everything was de-ish. Must order: Jambalaya, Fried Seafood Platter, Seafood Etoufee and Boom Boom Shirmp.. Just thinking about it, soooo missing NOLA right now."]], "date": "2018-05-25", "time": "22:16:50", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.3, "actual_yelp_score": 5.0}, {"review_id": "WPuzH8w_h7DugSSddh_kXg", "user_id": "LWjrmXefv5m9I_kCKyqBdQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The food was decent for 2am. The limited number of servers caused the cashier to frequently leave the counter to deliver food orders. They weren't prepared for the rush of a international convention."]], "date": "2018-07-22", "time": "17:50:04", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.0750000000000002, "actual_yelp_score": 3.0}, {"review_id": "v2bP9ZurbH4l7OiI0iKfGg", "user_id": "dFWSMO-ZLM0g7m1KKGE9GQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Came here on a Tuesday night at 6pm, there was already a line waiting outside. The wait was not bad at all, we sat down fairly quick at the bar.\n\nService was nice, oysters were super fresh.  We ordered raw and grilled, and their gumbo combo, all were excellent!  Overall, nice experience!"]], "date": "2017-07-12", "time": "20:48:31", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "liv2DGso_PJYQqZR1s3KDA", "user_id": "NBNIUJj60tVBKvWHhy3egg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["The raw oysters here could not get any fresher! I could have eaten dozens more but I had to keep in mind that I ordered an entree as well. You can't go wrong ordering any of their menu items. I tried the seafood étouffée which had pure delicious seafood flavor and included crawfish which luckily, is currently in season. I also tried the fried catfish/shrimp, fries and hush puppies.  Catfish and shrimp were super succulent and battered perfectly. Fries were thin cut and tasty. I'm a big fan of hush puppies and these were made perfectly, not too heavy and were served with butter.  \n\nDefinitely get one of their beers on tap to round out your meal! Service here is friendly and the waitresses make the effort to explain what's offered and they give suggestions too."]], "date": "2011-04-07", "time": "22:53:03", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.25, "actual_yelp_score": 5.0}, {"review_id": "Vl5On3S66_YciO7E9nnY5w", "user_id": "mj9nhSaYqbeKzL8eYowdWA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Must try the chargrilled oysters! They are wonderful. Gumbo needs some work but the acme medley was an excellent sampler of the tastes of new orleans. So close to bourbon street, you can't go wrong."]], "date": "2011-09-19", "time": "15:25:38", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "ySHwxVtML_gxrGGYT1Ramg", "user_id": "8oMBsKkbGFSPhzK4PBWdSg", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Always a must go in New Orleans. Always a wait but it takes only a few minutes to get in. Raw oysters always good, but you have to have the Grilled oysters. The best. If there is one place you have to go Go here."]], "date": "2015-04-30", "time": "22:32:45", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.775, "actual_yelp_score": 4.0}, {"review_id": "IqnTj-o9wXhUx3W_lKgIRA", "user_id": "dy-mOtQaj54ZzuVmmoheEw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Been here a couple times and have loved it every time! Gumbo and fired oysters are my favorites. Food is great and service is fast. Usually has a bit if a wait but line moves fast so don't sweat it. You'll be glad you waited. Highly recommended!"]], "date": "2021-07-18", "time": "18:46:09", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.675, "actual_yelp_score": 5.0}, {"review_id": "AoRq2gwhAZCK_H8FJkJB3Q", "user_id": "k_Kkj7XE87tYAWhiQRebTA", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I will have to say that this place is in fact the BEST oyster and seafood place I have been to in a VERY long time.\n\nThe Chargrilled Oysters are off the hook and will keep you begging for more. It's worse than a bad gambling addiction. By the time you are done for the night, you would have eating at least 4 dozen raw and chargrilled oysters.\n\nHands Down!"]], "date": "2010-06-14", "time": "22:21:59", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.25, "actual_yelp_score": 4.0}, {"review_id": "sWLDFmQGj8l_mArLZC9LhA", "user_id": "Qj2EAblmcdMWanb2uUqOhw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["Grilled Oysters! Enough said!  The long wait in line in the cold breeze, shivering cold, gasping at any heat from body temperature to the warmth of the door opening up, was well worth it.  The moment that yummy oyster hits your palette, you soon forget what it took to get into this place.  Absolutely mouth watering.  This is a must when you are here in Bourbon Street!"]], "date": "2014-12-28", "time": "19:50:25", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.4499999999999997, "actual_yelp_score": 5.0}, {"review_id": "dIIFxAUoNIfG5G99NbAiQA", "user_id": "iOkjkhOvRSDKt0bTcbfSQw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["We arrived at 5:30pm tonight and there were a good amount of people in line ahead of us. While we were in line, they checked our vaccination and ID cards. Because we were only a party of 2 and a spot became available at the bar, we were actually let in earlier than the larger groups ahead of us, so we luckily only waited about 10 minutes outside.\n\nWe ordered the Hurricane cocktail based on a friend's recommendation, and they are generous with the alcohol content. For our meal, we ordered half dozen raw oysters, half dozen chargrilled oysters, and the 1/2 and 1/2 fried shrimp and fish platter. Overall, the food was super fresh and tasty. But like other reviewers have mentioned, the chargrilled oysters were OUT OF THIS WORLD! My boyfriend and I agree that their chargrilled oysters is an absolute must try.\n\nACME definitely lives up to its hype and I think it's a nice opener for all that NOLA has to offer :)"]], "date": "2021-12-21", "time": "03:11:14", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 3.175, "actual_yelp_score": 5.0}, {"review_id": "1R6megnEDDHDeCWIZrmmaw", "user_id": "IfZ1vqGIX31AmDFa0swSRw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I swung by on my walk from the Market in the FQ to my hotel in CBD. Was told a must stop. So I grabbed a Peace...something (po boy with fried oysters and shrimp) and a side of Jambalaya. The Po Boy bread was soft and perfect and the sandwich was great with the 3 little Tabasco packets, maybe I could have done with a couple more! Sandwhich was filling so I couldn't eat all the Jambalaya, one bite and it was yum! It's on the drier side, not soupier like John Besh's Luke restaurant last night. It was warm with sausage and chicken, I so wish I wasn't full. This was a part of my 30 hour stop to taste New Orleans and I recc. Everyone stop by or get it to go!"]], "date": "2011-08-30", "time": "21:05:42", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.475, "actual_yelp_score": 4.0}, {"review_id": "7TPMZO9MA9PsaAsOtnhSbA", "user_id": "umDWhuZ0_mIq_VcFD5cq9Q", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I'm not sure what else I can say about this place after over 10k reviews but I will try! \n\nWe stood in line for about 30 mins or so which wasn't bad at all. We got seated at the oyster bar where they were shucking our oysters right in front of us, which was pretty cool. Andre was our oyster shucker/waiter for the night. Super cute and friendly guy. \n\nWe ordered two sazaracs (whiskey/cognac with absinthe and a sugar cube.) They were made very well and super smooth. Got us a little buzz on after our dinner.\n\nWe got a dozen raw oysters and a half dozen of the charbroiled oysters which's were all delish. So much in fact we ordered another half dozen raw after the meal. For the main dish we ordered the fried peace maker po'boy which had fried oysters and fried shrimp. The sauce that came on it was pretty good. Could have used a little more lettuce/tomato's/pickles but still yummy overall! \n\nThey offer a 25% military discount which was super gracious. Made the meal that much more affordable!"]], "date": "2018-02-04", "time": "18:28:38", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.6499999999999995, "actual_yelp_score": 5.0}, {"review_id": "Fm5frH8SWxKS6wo4B8S92A", "user_id": "-0V5DVnId4nZn5pkiaILzw", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["I know a place that tastes better that didn't have an long wait. This place is crowded for a Sunday night.\n\nFried shrimp and alligator was good. \n \nGumbo was very mediocre."]], "date": "2021-12-28", "time": "04:32:01", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 1.725, "actual_yelp_score": 4.0}, {"review_id": "peePW5J-RdBxu1am2QkxQA", "user_id": "qfYQhqKGrrSXudxkXW7law", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["We really enjoyed this place and ended up here twice during our stay.  If anything else, stop have a drink and order some Chargrilled Oysters.  Simply amazing."]], "date": "2014-05-23", "time": "19:29:35", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "2XA8wemCupgO3FKSQg49nA", "user_id": "322qLye1zPXnD3eeDzXCSQ", "business_id": "_ab50qdWOk0DdB6XOrBitw", "review": [["My very first restaurant stop here in NOLA, and it was AWESOME! We were there on a Thursday afternoon, and were seated right away with no wait. We passed this place a day later and the line was down the block! Had the chargrilled oysters, shrimp & oyster po-boy and seafood étoufée. Everything was delicious and priced fairly for portion size. Service was quick without feeling rushed. Our server, Mike, was super friendly! Overall,an excellent experience!"]], "date": "2019-01-21", "time": "06:59:33", "categories": "Live/Raw Food, Seafood, Restaurants, Cajun/Creole", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 7568, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}]