[{"review_id": "y7OlW_kN46M5_sv2XFyUhg", "user_id": "5lndjB2Aq2I5bsK4GCM-XA", "business_id": "UCCc31J4N8Y57RuzmInjyw", "review": [["This is my favorite place to eat but sadly today was the worst experience I've had at a chipotle. For one, they were about of a lot of ingredients so they skimped on a lot of things for my burrito bowl (peppers, cheese), the fryer was broken so there were no chips, the avocado wasn't mashed (huge pieces of hard avocado) the staff seemed very confused as well, like they were new or didn't have proper training. Love chipotle but this one left me super unsatisfied."]], "date": "2019-04-14", "time": "16:51:06", "categories": "Restaurants, Mexican, Fast Food", "city": "Plainfield", "state": "IN", "stars": 3.0, "business_review_count": 35, "predit_yelp_score": 1.3, "actual_yelp_score": 1.0}, {"review_id": "Ka99-_qniisbEb87ZHhxFg", "user_id": "XBtOeQnz72zwWYlyHPMGug", "business_id": "BvomXXWqtKSkEfS037gcfw", "review": [["Ordered online arrived a little early to ensure my food wasn't being held under a heat lamp. When I arrived and checked in, I was told that my order was not ready and then helped all the customers that came after me. I waited an additional 5 minutes before I asked if it would be quicker if I got in line. I was told that getting in line would not be necessary and they would complete my order when the line was taken care of. Nice customer service! Once my order was ready I left to have a quick dinner with my wife. My burrito bowl had 2 small pieces of fat and no meat.  DO NOT ORDER ONLINE UNLESS YOU WATCH THEM MAKE YOUR FOOD WHICH DEFEATS THE WHOLE PURPOSE!"]], "date": "2018-07-26", "time": "22:34:04", "categories": "Restaurants, Fast Food, Mexican", "city": "Willow Grove", "state": "PA", "stars": 3.0, "business_review_count": 93, "predit_yelp_score": 3.7, "actual_yelp_score": 1.0}, {"review_id": "G_9mW2MsABrmyrnrIQspXQ", "user_id": "9u07Jqa96mjhmcOj0a0sLA", "business_id": "04WpqoyyuqX5IrgI-gAAeA", "review": [["This location made me give up on Chipotle for almost a year - every experience here gets worse and worse. From constantly stale chips, to near raw chicken, the list goes on and on. Then, I had chipotle again at a new location and fell back in love with the place so forgetting my trauma came back to this location since it's close to my home. Again, stale chips, chewy pink chicken, dirty counters, unfriendly service."]], "date": "2018-12-15", "time": "20:04:48", "categories": "Mexican, Fast Food, Restaurants", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 138, "predit_yelp_score": 0.9249999999999999, "actual_yelp_score": 1.0}, {"review_id": "qu4J-ClI2sTCu4XZfPKtzQ", "user_id": "THQGGyCCoZcQ9l7Wl9BCLw", "business_id": "tnq7b6ROl4RIyfQoxIrXhw", "review": [["Chipotle is a fabulous chain.  Have never had a bad experience till I went to the Ardmore location.  I found the employees to be extremely rude.  I visited twice 6 months apart thinking that it was just one employee - but sadly no - it seems to be an issue with the location in general."]], "date": "2011-11-14", "time": "19:01:50", "categories": "Mexican, Restaurants, Fast Food", "city": "Ardmore", "state": "PA", "stars": 2.0, "business_review_count": 117, "predit_yelp_score": 2.3000000000000003, "actual_yelp_score": 1.0}, {"review_id": "Z7l3YDSUsHoDfk2ZydwVlA", "user_id": "eY2ZgvK7gmUS_kUQWZYk9Q", "business_id": "tNOLXgYTykXmLaAZnvo1vg", "review": [["Ok I've actually been a chipotle fan for a long time until today.  Up until now I've always had a good meal.  Nothing fancy but everything was pretty fresh and tasted great.  This is owing to the fact that they have a lot of turn over so nothing that can degrade with being out sits for too long, and the fact they have a simple assemble to order system and there's very little skill required to build a burrito or a bowl.  However this type of fast food relies on each individual component to function as intended or it ruins the whole meal.  Today the part that failed was the rice both white and brown.  The white rice was about 80% uncooked while the brown rice was about 40% uncooked.  This is absolutely unforgivable.  Rice is one of the easiest things to make on an commercial/restaurant scale.! I know, my family has done Chinese and a sushi commercially in the past.  And for a place like chipotle you have to imagine they have a recipe for everything including the rice.  I was barely able to choke my food down but I was too hungry to send it back.  This is an epic fail for such a menu!  No wonder chipotle stock is down from 700 to 300.  Additionally the chips were so salty that they were also almost inedible.  Quality control guys!  Come on.  Get your head in the game.  I've been to this location through out the last few years and the quality has steadily decreased.  Right now I'd say I'd rather go to the Taco Bell up the street then give Chipotle Exton my money."]], "date": "2018-01-03", "time": "00:20:48", "categories": "Restaurants, Mexican, Food, Fast Food", "city": "Exton", "state": "PA", "stars": 2.0, "business_review_count": 115, "predit_yelp_score": 1.725, "actual_yelp_score": 1.0}, {"review_id": "cCfM3bShGb4q4V-6dBokVQ", "user_id": "AQ8uA2Jy8tnimGZqBgi6Hw", "business_id": "IEDW_nZUl1OEq9qucwViRQ", "review": [["Food doesn't taste like chipotle usually does. They ran out of guac and didn't have any made. Been disappointed every time I've come (4) since it opened. Can't come back.\nMesa Grill should be here still"]], "date": "2017-09-19", "time": "22:20:14", "categories": "Fast Food, Mexican, Restaurants", "city": "Wayne", "state": "PA", "stars": 1.5, "business_review_count": 51, "predit_yelp_score": 0.125, "actual_yelp_score": 1.0}, {"review_id": "eIXrlRThGsooYARjQzaDeQ", "user_id": "LoWUO_85wUKRL58i4HSWow", "business_id": "NxyWNRXB3O-aBQQLx1ckrA", "review": [["Cold food nasty place never seen a chipotle this nasty and dirty also they had a dog coming out the back door smh I'm done ..."]], "date": "2019-06-22", "time": "18:15:35", "categories": "Mexican, Fast Food, Restaurants", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 161, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "RuYcdRxo9Eh3iyv4mPnWkg", "user_id": "LKrhFWxxRgjhM25dc7wK7g", "business_id": "NNlhukzmh9S2HUh0F0Aysg", "review": [["Took over an hour after the scheduled pick up time using chipotlane to get my order and it was wrong."]], "date": "2021-08-20", "time": "01:09:10", "categories": "Restaurants, Mexican, Fast Food", "city": "St. Louis", "state": "MO", "stars": 1.5, "business_review_count": 27, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "nagrhjjIGQj-XVOy62aSkg", "user_id": "GRRcxBO42cKO6Y8gJxqnrA", "business_id": "J8NFYLevEA7xgC_zBvivNw", "review": [["Great new location for this fast food restaurant chain. It is placed in an awkward position in a strip plaza off of US 19. However when you walk in through the doors it is the quintessential chipotle clean and with a slight edge tailored to the younger crowd. I usually go when it's later at night after 9 PM so there usually is not a wait or if there is one it's very small.\n\nIt seems to be the same staff every night I go and they are always friendly and helpful. They also keep very good tabs on the cleanliness and efficiency of the restaurant.\n\nMy favorite item to get is a chicken salad bowl. I always try to keep it as healthy as possible so I only go for extra lettuce, mild salsa, peppers, and mild salsa. There honey chipotle vinaigrette dressing is the bomb! I'm so addicted to the stuff I always get an extra salad dressing to go to use on my own homemade salad. Always fast, fresh, friendly and open late which I love!"]], "date": "2014-12-15", "time": "01:40:34", "categories": "Mexican, Fast Food, Restaurants", "city": "Palm Harbor", "state": "FL", "stars": 2.5, "business_review_count": 61, "predit_yelp_score": 4.15, "actual_yelp_score": 5.0}, {"review_id": "URP4L8ideP9aBozsGKTCig", "user_id": "l-iJ5CJBdS_J7sNp7cTnSg", "business_id": "C3Nc7EUqo64jRPWPn6vY9w", "review": [["Literally the worst the Chipotle. I order on the website for easy pickup. The last 3xs I've had issues. Corporate gives you a coupon so you're forced to waste your money by coming again and paying the difference it's really frustrating. On today's edition of how did they mess up. They left off guacamole and the kids juice and kids fruit was missing. Last time they forgot the guacamole and the quesadilla was only half filled with cheese/meat. The time before that a whole meal was missing. They also never honor the request for light/normal/extra, ask for extra salsa...don't get it. Ask for light beans, get extra beans...I get with Covid people are terrible and no one wants to deal with the public so that's why I order ahead, but everything is wrong so I guess I'm forced to come in and annoy people in person."]], "date": "2021-10-20", "time": "17:02:24", "categories": "Restaurants, Fast Food, Mexican", "city": "Cherry Hill", "state": "NJ", "stars": 2.5, "business_review_count": 73, "predit_yelp_score": 0.5750000000000001, "actual_yelp_score": 1.0}, {"review_id": "5aVk4oelDb9gEzQJwi4PpA", "user_id": "ecUq88mXLMZKyUcHTA4pXg", "business_id": "Cg7xgjzaV7d7dbwWy4ZO3A", "review": [["Ate lunch at Chipotle Mexican Grill. The food is great and the service is fast and friendly. I will be back again. You pick your own toppings and make your own Tacos and Burritos. The portions are big and you can also have a burrito bowl instead of a regular burrito wrap"]], "date": "2010-11-06", "time": "14:42:06", "categories": "Mexican, Restaurants, Fast Food", "city": "Franklin", "state": "TN", "stars": 2.5, "business_review_count": 108, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 4.0}, {"review_id": "FGSqBpfuo-E-UpXVB-5lVA", "user_id": "ZfTuxtDI7XgXM6XhSOa8Iw", "business_id": "c4IkL2K64JeFC7kcnbupsw", "review": [["I've got a coworker that eats at Chipotle every single day.  He''s gone there everyday for lunch for the last year and that's always intrigued me.  It must be good if someone eats it everyday right?  Well, yes and no...\n\nChipotle is not unlike any of the other burrito counter service joints.  You walk up to the counter, tell them what type of dish you'd like (tacos, burrito, salad, bowl, etc) and then you proceed down the line to tell them the ingredients.  It's a pretty successful business model and one that's used in at least 3 other burrito places that I know of.\n\nIn other words, Chipotle is not special and really isn't doing anything any better than others with the same model.  The food is decent and the service is exactly what you'd expect form a fast food joint like this.  Where they fail is on price and meal deals.\n\nSome of the other similar burrito places offer a free salsa bar and chips are included with your meal.  This is a standard at most Mexican restaurants.  For some reason, Chipotle thinks they are special and charges extra for chips and even more for salsa.  Yet, the price for just your main entree item is the same as what other places charge for the entree, chips, and salsa.\n\nLike I said, the food is decent, but the prices stink.  For that reason, I choose to take my business elsewhere.  The dining area is nice with contemporary styling and it was very clean, so that's a plus.  With so many other options that offer lower prices, equal food quality, and free salsa; I just can't justify another visit."]], "date": "2013-03-29", "time": "16:07:50", "categories": "Mexican, Restaurants, Fast Food", "city": "Brentwood", "state": "TN", "stars": 2.5, "business_review_count": 77, "predit_yelp_score": 2.7, "actual_yelp_score": 2.0}, {"review_id": "ThsnTTB9joOb0w_aifVFsQ", "user_id": "w3jC5fB5Va5ghk0_Y8McKA", "business_id": "QsSA6MC9-CoElSrXPDrIKA", "review": [["Horrible service. I keep going back to give them the benefit of doubt but man it keeps getting worse. I ordered a kids meal & I didn't get the full order. It was half ways served. Then I ordered for me and my family and it's like they served me a child's menu. I will not be going back to this location. I will take my services somewhere else. It's not worth the drive and wait outside in my car for a plate of food for a bird."]], "date": "2021-03-05", "time": "02:35:32", "categories": "Fast Food, Restaurants, Mexican", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 39, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "k_MI5Xb2Dn2dyr-BBPI_Jg", "user_id": "8e2Cdz6eaagABqoGOvIiwg", "business_id": "9AQNVr7SSppVod6eyvl_kA", "review": [["I ordered  from DoorDash and I send a msg to the delivery person. His name was Carmelo to let him know to make sure to put extra dressing and check the order . When he arrived I told him I have a missing burrito  he said that they are going to send somebody else at no charge . I waited and waited and then decide to call the restaurant and one of the lady's hung up on me like three times unacceptable . I ask to speak to a manager the last time and finally a manager Edgard we explain what happens and he just said go to our page and u can get the refund . Honestly he was very rude both parts cause I don't want a refund just my missing burrito and I'm very pissed. The way both employees and manager deal with this situation . Never again order from this Chipotle horrible service not even my dressing was on the side for my salad . I want my money back no coupons no credit nothing just my money ."]], "date": "2020-06-28", "time": "02:19:11", "categories": "Fast Food, Restaurants, Mexican", "city": "Clearwater", "state": "FL", "stars": 2.5, "business_review_count": 60, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "eDAw1wL39eSa-LEgAWTnQw", "user_id": "9LgljChFQnfpn35EcKhMYg", "business_id": "7tIXaWRqW7vYWMnoXQhDTw", "review": [["Try the carne asada before it's too late 10/10 would recommend pinto beans are the best on it and the brown rice especially order the guacamole on it"]], "date": "2019-10-05", "time": "00:14:51", "categories": "Mexican, Fast Food, Restaurants", "city": "Marana", "state": "AZ", "stars": 2.5, "business_review_count": 55, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "dZtQeHT9CH58JIdMR8zucw", "user_id": "iabELDyxpU6K7l0lRaOzIQ", "business_id": "c4IkL2K64JeFC7kcnbupsw", "review": [["I love Chipotle and have been to multiple locations across the country. My experience here was the worst! We had an order for 6 people and the 2 employees who waited on us could not have been LESS interested in helping us. Seriously zero personality and they seemed annoyed when I kept adding another order with nobody behind us! And they failed to offer or give us the drinks that came with the 2 kids meals we ordered. I'll drive to Franklin next time!"]], "date": "2019-02-02", "time": "23:26:21", "categories": "Mexican, Restaurants, Fast Food", "city": "Brentwood", "state": "TN", "stars": 2.5, "business_review_count": 77, "predit_yelp_score": 1.1500000000000001, "actual_yelp_score": 2.0}, {"review_id": "z4-TY3Md8MqdpY04nP4HJA", "user_id": "QPyNXcdC1eEdyJbCD6IBpw", "business_id": "qmsdbXMG6DCNXEEZJz4d5g", "review": [["The food here is fine, it's your standard chipotle. The issue is with the online orders. I've ordered twice through the app and both times I've had to wait thirty minutes to an hour past the supposed pickup time outside of the store to get my food. Also this is chipotle, all the food is cooked, it just needs to be assembled. The system is bonkers, they make you wait for an employee to come out who you then have to flag down so they can take your name and then eventually start your order. The first time they were only accepting online orders because they were short staffed and COVID precautions, both of which are understandable, however it seems so strange to not just start the orders as they come in. The second time I came they were allowing people in and they served them immediately, pushing aside all online orders, even if you had put in a name. They also won't let you pick it up in store, despite the directions on the chipotle app. You instead have to wait for whenever an employee collects enough orders to bring them out, so they sit and get cold before it even gets to you. When you're letting people in to order, why can't people come in to pick up their food, you have the shelf for it already? Again, the food is fine but given how many people order takeout they should improve the pickup system. If you can't be ready for a pickup until and hour after I've ordered, make that clear ahead of time and don't give me the option to pick up fifteen minutes after ordering if you can't fulfill that."]], "date": "2020-08-28", "time": "01:19:52", "categories": "Fast Food, Mexican, Restaurants, Salad", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 56, "predit_yelp_score": 1.675, "actual_yelp_score": 2.0}, {"review_id": "t7dGV74snNLiy7Ho0j9TxA", "user_id": "4BUDG3wEofTByb125aFcXQ", "business_id": "G3qHuySzimTTf1_6uBxF2g", "review": [["I love Chipotle and the staff here is always very nice to me. Now that they have quesadilla's they'll be seeing my face even more now. The food is always hot and fresh."]], "date": "2019-04-07", "time": "23:11:54", "categories": "Tex-Mex, Fast Food, Restaurants, Mexican", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 60, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "H9yZkKTv1wegdFQFohStqA", "user_id": "VGNnJmI48J-LwmxgbVWSTw", "business_id": "gEn52Xe8B-sOjPeG8a5QtA", "review": [["This is my closest Chipotle to my location, 15 minutes away or so without traffic, and despite a similar concept being located in my neighborhood, I keep coming in. Gotta have my Chipotle! The food is always pretty fresh. I will say that the actual dining area is regularly pretty dirty when I come in, and restrooms are a little messy as well so this could be addressed. Other than that, I'm always pretty happy with this place!"]], "date": "2016-12-13", "time": "02:18:53", "categories": "Mexican, Fast Food, Specialty Food, Food, Ethnic Food, Restaurants", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 82, "predit_yelp_score": 3.225, "actual_yelp_score": 3.0}, {"review_id": "s6qjajsWkM0NVAcR2pPVbw", "user_id": "Kf6iOle9NrsbnYwnvBVVNQ", "business_id": "8WBe-jXE19b21yevU1bh4A", "review": [["I ordered beans,chicken,white rice,and lettuce with beef,corn,white rice,lettuce,and cheese. I asked for extra because they didn't give me a lot AT ALL! They had an attitude when I asked for extra. When was eating my beans they were uncooked and they only gave me little bits of beef. My food was still cold! It was the worst! No wonder they only have 2 1/2 stars"]], "date": "2018-10-12", "time": "00:37:37", "categories": "Restaurants, Fast Food, Mexican", "city": "Trevose", "state": "PA", "stars": 2.5, "business_review_count": 131, "predit_yelp_score": 0.3, "actual_yelp_score": 1.0}, {"review_id": "C5i3vYyYsrJgB0UGR3yRHg", "user_id": "9thnhBWAetVR_264AVqImA", "business_id": "TKOaoUkbZ1kw4DVa02gCTQ", "review": [["Unfortunately i always drive to this location because it's literally 5 mins away from my house. However, almost EVERY TIME i come here they literally run out of something after a certain hour(towards closing time) as if they quit working the last hour of operation. SO ANNOYING TO WASTE MY TIME COMING HERE! First off, the staff= horrible. Most of them always look irritated and it feels unwelcoming slowly approaching them. Secondly, for such a big cooperate chain running restaurant it's irritating for them to constantly run out of shit and not being able to refill it. They already give out small portions Highly dislike the people that work here and this location. Hope management does something about this!"]], "date": "2019-08-02", "time": "01:19:53", "categories": "Mexican, Restaurants, Fast Food", "city": "Springfield", "state": "PA", "stars": 2.0, "business_review_count": 50, "predit_yelp_score": 0.75, "actual_yelp_score": 1.0}, {"review_id": "aTYFnunPNjLPc-C1EJ1dMg", "user_id": "itI6CqeR92ikei1n86N5sg", "business_id": "69k7MF2-nXq-tNNHrJYONw", "review": [["An annoying trend I've noticed:\n\nWhen they get to the \"wrapping the burrito\" part of the human conveyer belt, they will tear the tortilla. Considering that these burritos have the breadth and stature of a premature newborn, this is understandable and almost expected.\n\nWhat annoys me though is that the employees at this location will carelessly tear apart the burrito, then check to see if you didn't notice so that they can just wrap it up and let you deal with the mayhem after you get home. After creating a tear that a car could drive through (hyperbole) one employee asked me, \"you think you can still eat it or do I have to grab another tortilla?\" No, let me just grab a fork because of the inconvenience I've caused you. It's not like I'm paying for it or anything...\n\nSo basically, keep an eye on them when they're making your food. They are after all college students who could give a rat's *ss if you end up with a burrito that you can (or can't) contain with your two hands. Promptly call them out when they try to hide their mistakes and then your dining experience can only be ruined by your own incompetence as opposed to theirs."]], "date": "2011-03-05", "time": "03:58:28", "categories": "Fast Food, Food, Restaurants, Mexican", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 146, "predit_yelp_score": 0.025, "actual_yelp_score": 3.0}, {"review_id": "tYev4uH-ojufGQdZA_flag", "user_id": "PR7XS6OA-6ylu8sLGObUsQ", "business_id": "dgGuvdysSuWOv2dKqZTbVA", "review": [["Food: 3.5\nDecor: 3.5\nAmbiance: 3.5\nService: 2.5\nValue: 3\n\nI've done Chipotle a couple of times, and felt sick after each. I have yet to buy into the hype. There are definitely better options out there."]], "date": "2013-06-20", "time": "19:24:35", "categories": "Mexican, Restaurants, Fast Food", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 186, "predit_yelp_score": 2.0500000000000003, "actual_yelp_score": 3.0}, {"review_id": "aSrWaQGkTO4MnTEZIqbZ_Q", "user_id": "Bno3o6i37E_LzXNeOmUpjA", "business_id": "0v4dpBY8GN88d0xO4_fuSQ", "review": [["Can you say, \"Yum\"?  I'm saying YUM to  Chipotle! This place rocks! The service is friendly, it's clean and the food is fresh and tasty. I usually get the vegetarian burrito with everything, and it's a monster! The salsa's have a kick and aren't so hot that they make your tastebuds unable to taste, and the avocado guacamole is fresh and seasoned nicely. Good clean fast food."]], "date": "2015-06-26", "time": "03:21:13", "categories": "Fast Food, Mexican, Restaurants", "city": "Indianapolis", "state": "IN", "stars": 2.5, "business_review_count": 73, "predit_yelp_score": 4.025, "actual_yelp_score": 5.0}, {"review_id": "qnWDdwOYh3sMqeGriWNXOA", "user_id": "p0MhNWkwOPBfRo8qUb7faw", "business_id": "bKgyXSQUGA8IHGt8ne5NuA", "review": [["I had actually tried Chipotle once before in California, but it was not important enough for me to remember. \n\nI went in the first week they opened and the line was out the door so I left. After waiting for the fanatics to calm down, I tried it again here in Reno and the food was good. That's it. It was good. \n\nCertainly the quality of the ingredients is great and the flavors are good, but it is hard separating the hype from the reality and this is one of those restaurants that has such a cult following and was built up to this monumental restaurant that would change my life, but instead it just filled me up. As far as food goes, I would eat here again but I certainly haven't become a Chipotle enthusiast. \n\nThe design of the restaurant is so odd that it makes me not want to eat there. Who designed that? Nothing about the setup makes me comfortable enough to dine in. The Sparks location is even worse."]], "date": "2014-11-26", "time": "19:29:20", "categories": "Restaurants, Mexican, Fast Food", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 160, "predit_yelp_score": 2.9999999999999996, "actual_yelp_score": 3.0}, {"review_id": "ORYKUblGVfN8i53eNYEq9Q", "user_id": "HRlmvwYRgW5ZWrdAawLiog", "business_id": "tnq7b6ROl4RIyfQoxIrXhw", "review": [["Dependably slow, unfriendly and the dirtiest chain restaurant in which I've ever had the misfortune to venture. If you like to see overflowing garbage cans, dirty tables and lounging employees, then this is your place!"]], "date": "2017-04-14", "time": "00:11:28", "categories": "Mexican, Restaurants, Fast Food", "city": "Ardmore", "state": "PA", "stars": 2.0, "business_review_count": 117, "predit_yelp_score": 0.4, "actual_yelp_score": 1.0}, {"review_id": "S805epzeKY9BcA9AdzT4cQ", "user_id": "RwLCUabG54ttGGzL-t1bZQ", "business_id": "Su61gAnRDG3DuMEf5RmvTw", "review": [["I have gone to place a few times. But today was the worst. First, don't go on Friday!!!! I went around 1pm. they were only taking online orders. Because of the distance I drove and only having an hour break I ended up not getting anything to eat for lunch. I didn't have time to wait for an order. I went back for dinner. This time I had my mobile order ready. The line was out the door literally. I thought i was doing something with my mobile order. I slid up to the mobile shelf thinking to myself thank God for my mobile order. The joke was on me because everyone who i would have been in line with left before my order was ready. I felt unsafe as I stood amongst the other people who meals were not ready in time attempting to stay out of people's way. It was total chaos I'll never go back on. Friday! Then to boot my food was also wrong. Not a good day for Chipotle. They let me down. On the bright side, my guacamole was good."]], "date": "2021-03-13", "time": "01:45:42", "categories": "Restaurants, Fast Food, Mexican", "city": "Deptford", "state": "NJ", "stars": 2.0, "business_review_count": 100, "predit_yelp_score": 1.4000000000000001, "actual_yelp_score": 2.0}, {"review_id": "UdOqV4tRqeRz0SHY9zPmEg", "user_id": "MGvqU4bMISW9rQZ82Tb0MQ", "business_id": "69k7MF2-nXq-tNNHrJYONw", "review": [["The online orders are never ready on time. You can walk in and find an empty store but you can bet they won't have your order ready on time. Besides that its a Chipotle, you know what you are getting at this point."]], "date": "2018-05-22", "time": "00:51:34", "categories": "Fast Food, Food, Restaurants, Mexican", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 146, "predit_yelp_score": 0.6, "actual_yelp_score": 2.0}, {"review_id": "XF6lhLD8Z7xRqy-mkQ1ahg", "user_id": "uMyUIZgkiFnm51wi2qwbtA", "business_id": "U7esGceQIZ_1IG6Ib0c1lQ", "review": [["This place is a complete disaster. The staff is slow and not very courteous. The rice was crunchy in my bowl, and I'm not sure if that's how it's supposed to taste? The chips were stale and way over salted. They had run out of napkins and when I asked for some from the manager, he seemed bothered. In fact, I would venture to say he hates his job. I can't believe I wasted my time and money on this train wreck. \n\nNever again..."]], "date": "2018-11-06", "time": "19:48:56", "categories": "Fast Food, Mexican, Tex-Mex, Restaurants", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 131, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "-GikAebMjiCv7yrjnZvarQ", "user_id": "LFSYLQhYr7mH7EoNtjszDw", "business_id": "vjO7cPDREXPjfozY0u2L_A", "review": [["Used to come here all the time but the whole staff changed and now it is absolutely disgusting in here. The blonde girl at the cashier was extremely rude and didn't even acknowledge me when I approached her to QUIETLY and MODESTLY tell her about the hair I found in my food! Thankfully another nice employee finally approached me and offered me a refund. The whole store was mess, garbages overflowing, food on the ground, and the quality of food has definitely been compromised :("]], "date": "2020-02-17", "time": "20:30:27", "categories": "Restaurants, Fast Food, Mexican", "city": "West Chester", "state": "PA", "stars": 2.0, "business_review_count": 72, "predit_yelp_score": 1.6500000000000001, "actual_yelp_score": 1.0}, {"review_id": "nU63Cmd_AJvxrLGtMECrPw", "user_id": "fbqb-z8c6e7d6SiyM2tHPg", "business_id": "bliETqSXwJ9_I0yR4R5prw", "review": [["It was okay for a stand in line and choose your components type of place.  I ordered a salad with extra chicken.  Seemed like the chicken was mixed white and dark meat which was a little surprise to me as I assumed it would be all white meat.  Seasoning was a bit mild, and I would have preferred it tasted more \"Mexican.\"\n \nWorkers on the food order and assembly line were all business.  Really not my kind of place so I don't have much to compare it to."]], "date": "2018-06-04", "time": "18:52:00", "categories": "Mexican, Restaurants, Fast Food", "city": "Brandon", "state": "FL", "stars": 2.0, "business_review_count": 147, "predit_yelp_score": 2.325, "actual_yelp_score": 3.0}, {"review_id": "6MpUc_Ny5WVgVx1Tvw9fiw", "user_id": "sKnZQ_XX-q0nYDV6on17Mw", "business_id": "tnq7b6ROl4RIyfQoxIrXhw", "review": [["I love my healthy satisfying meals here.  Bare bones interior but works for me."]], "date": "2012-10-28", "time": "11:24:43", "categories": "Mexican, Restaurants, Fast Food", "city": "Ardmore", "state": "PA", "stars": 2.0, "business_review_count": 117, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "mPlkgYG-gDo-pghTy3IHWA", "user_id": "xn1rNVizsiPDXydoX9BFNw", "business_id": "bKgyXSQUGA8IHGt8ne5NuA", "review": [["Burritos are always good here tried a taco this time was surprised to see as i was eating that they charge the same price as the burrito. And the taco us really not that great. And there was a sliver of plastic packaging in the lettuce. Not stoked"]], "date": "2017-12-27", "time": "23:16:04", "categories": "Restaurants, Mexican, Fast Food", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 160, "predit_yelp_score": 1.8249999999999997, "actual_yelp_score": 1.0}, {"review_id": "81eV2vU3hd2qbK8161webw", "user_id": "0aYtninT30AYHjPvw_gU2g", "business_id": "U7esGceQIZ_1IG6Ib0c1lQ", "review": [["This chipotle is pretty solid. I frequently stop by after work to grab two burrito bowls to go. The staff is always nice and accommodating. Always a solid choice."]], "date": "2018-12-07", "time": "02:32:15", "categories": "Fast Food, Mexican, Tex-Mex, Restaurants", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 131, "predit_yelp_score": 4.7, "actual_yelp_score": 4.0}, {"review_id": "F4W3wXIoZQSc_2T0UEf-7g", "user_id": "VPSH_yollwWYr_fcUqeoPA", "business_id": "4rhH2r1lL7ujqnvTwZo--w", "review": [["Went around 4:30 so no big line. definitely in the top 3 most generous bowls I've ever had"]], "date": "2016-07-12", "time": "20:39:13", "categories": "Restaurants, Mexican, Fast Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 24, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "KCPR-moWyVfrXdUWtHy54Q", "user_id": "gbL42P8Z5xpe1sofOc2BSw", "business_id": "LnN7LbbqFK1OvFjbkhUjaQ", "review": [["The only halfway decent Chipotle in the Nashville area. The food tastes so much better, the line goes fast, and to go is prepared on time. The only inconvenience I've ever experienced is them forgetting the drink on a to-go order a few times, which compared to the horror stories I have with other locations is minuscule."]], "date": "2021-03-31", "time": "20:31:34", "categories": "Restaurants, Mexican, Fast Food", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 73, "predit_yelp_score": 3.175, "actual_yelp_score": 4.0}, {"review_id": "goodfjbjTdg1ydl8deznMw", "user_id": "Ppq7Ic_IbC_46y_bfsBurA", "business_id": "ztFGiRmX7HPoKMKbgkP17w", "review": [["Friendly staff and clean atmosphere.  Can't get enough of their new chorizo burrito!!!  Haha!\n\nI suggest signing up for their promo emails/texts if you love this place.  They keep sending out buy one get one free games!"]], "date": "2016-10-25", "time": "18:13:20", "categories": "Fast Food, Mexican, Restaurants", "city": "Indianapolis", "state": "IN", "stars": 4.0, "business_review_count": 43, "predit_yelp_score": 4.55, "actual_yelp_score": 5.0}, {"review_id": "dnsdr-zriNFfedXPDqF_RQ", "user_id": "BA-SIhp2NlNSr8ktG9OX1Q", "business_id": "vjO7cPDREXPjfozY0u2L_A", "review": [["a bunch of communists my total was 4.66 but they can't take a $5 bill because they need exact change. what a joke."]], "date": "2021-12-09", "time": "22:41:49", "categories": "Restaurants, Fast Food, Mexican", "city": "West Chester", "state": "PA", "stars": 2.0, "business_review_count": 72, "predit_yelp_score": 0.825, "actual_yelp_score": 1.0}, {"review_id": "PM-9NamackYLeshol1gKQQ", "user_id": "Cm74i_a82cjUgrgVS5hroA", "business_id": "7jVmd4JBBIKjWdMyyre4kA", "review": [["I love chipotle but this specific one tends to take their time preparing the good and they tend to give you less meat than other chipotle vendors usually do."]], "date": "2014-06-26", "time": "20:44:21", "categories": "Food, Mexican, Restaurants, Fast Food", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 159, "predit_yelp_score": 5.0, "actual_yelp_score": 3.0}, {"review_id": "o0IXQDUCefV2EIYMZQZ0nQ", "user_id": "4Ut44iu5sXbKlcy8pAsmcA", "business_id": "fjLJhvR3aGd812OsMcziCQ", "review": [["There were 5 people waiting in line when I walked in. This really loud woman was ordering and she was talking to all the employees, holding them up, ordering 5 or 6 things. As I kept waiting, I found out she worked there. As a worker, you should know not to hold up the line and talk about your personal life. Apart from that, the line station was messy and it took me 15 minutes to get through the line. \n\nThe employees were nice, but that's all I have to say."]], "date": "2020-02-26", "time": "00:57:25", "categories": "Restaurants, Mexican, Fast Food", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 72, "predit_yelp_score": 1.7000000000000002, "actual_yelp_score": 3.0}, {"review_id": "9fxmWWt7rynlCrDvNXf87w", "user_id": "poCvAV9ujBDRRoez-KOQnA", "business_id": "jxouzim2QaotZa3DYZLweg", "review": [["Ordered a salad for dine in. Was presented with a bowl of wilted lettuce that looked very aged (was turning brown). Had to ask the worker for fresh lettuce (and had to point out that it did not look good at all).\n\nThis location was very skimpy on their meats and guacamole (not sure if that was standard amount given or if the worker was miffed because I wanted fresh ingredients). Have eaten at other Chipotles in Tucson and feel that they give a more heartier portion than this one.\n\nThe working crew was nowhere near being friendly, which is a shame as I have had good service from Chipotles in the past. I will go to other Chipotles when I want dinner. I will skip this location!"]], "date": "2019-11-08", "time": "03:26:58", "categories": "Restaurants, Fast Food, Mexican", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 50, "predit_yelp_score": 0.22500000000000003, "actual_yelp_score": 1.0}, {"review_id": "KiK66WFHm4nNrpfHcIO9_w", "user_id": "kA7sIBVKgWXVwWbpXsUHQg", "business_id": "7jVmd4JBBIKjWdMyyre4kA", "review": [["I won't bore you with the review of Chipotle's food since I'm pretty sure most have visited a Chipotle by now or know what they're all about. \n\nWhat you do need to know about this location:\n\nA few seats available outside\n\nSkinny parking spots (when it says compact, it truly means that) \n\nShares a parking lot with Pinkberry so finish off your burrito with a froyo!\n\nNot the most easily accessible parking lot"]], "date": "2013-01-08", "time": "00:55:54", "categories": "Food, Mexican, Restaurants, Fast Food", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 159, "predit_yelp_score": 0.35, "actual_yelp_score": 4.0}, {"review_id": "4BYkAX4rads0qZl9ix26tg", "user_id": "SIhQZSBWpRF4FRnVxFOLqQ", "business_id": "AmnnsJq4Pz1jJUFzHwtsOA", "review": [["Right by my office so i eat here a lot,  but this is consistently one of the worst chipotles I've ever been to. Service is slow, they don't seem to be particularly interested/concerned with customers' time, and they always seem to be low/out of peppers, which is one of my favorite things. Also, they are EXTREMELY skimpy on the ingredient amounts, especially when i order online"]], "date": "2016-08-18", "time": "20:04:41", "categories": "Fast Food, Restaurants, Mexican", "city": "Indianapolis", "state": "IN", "stars": 3.0, "business_review_count": 65, "predit_yelp_score": 1.5750000000000002, "actual_yelp_score": 2.0}, {"review_id": "bFdB_3910jzoVzHMVI7wwQ", "user_id": "BiEffeT7FBctlzdSi46xTA", "business_id": "qLzN8JgKvFWhetyyDhdTzg", "review": [["This visit was disappointing at best and horrid if I am honest. We had 6 meals we ordered online and zero were edible. The rice and beans were not cooked in any of the food. That was the least of it. I didnt order guacamole on my food, but got it anyway in lieu of the lettuce. The guacamole I scooped to give to my husband, but I got an unpleasant surprise. There was half an avocado, which wouldn't have been bad BUT there were pits included. Avocado pits are toxic and since my meal was covered in guacamole, with pits included, it was completely inedible. My kids meals were full of  fatty meats. My hubs meal had such hard and crunchy bits of something that he spent half an hour picking crap out. The veggies, onion in particular, had the outer peel cooked as well. I give 1 star for the prompt refund we got after I called to let them know there were toxic substances in the guac."]], "date": "2020-10-07", "time": "19:28:11", "categories": "Fast Food, Restaurants, Mexican", "city": "Green Valley", "state": "AZ", "stars": 2.5, "business_review_count": 14, "predit_yelp_score": 0.275, "actual_yelp_score": 1.0}, {"review_id": "XQnFl0AgPtc9V5yIGCVOzg", "user_id": "7Mv3sWen0Z746s1ath_tSA", "business_id": "PIDDKHCx_cF-13w9Wi9-2g", "review": [["Was really enjoying my sofritas salad until I just pulled long hair out of it. It is now in the trashcan and I haven't eaten lunch not cool @chipotle not cool..."]], "date": "2018-02-02", "time": "19:00:43", "categories": "Fast Food, Restaurants, Mexican", "city": "Warrington", "state": "PA", "stars": 3.0, "business_review_count": 60, "predit_yelp_score": 2.5, "actual_yelp_score": 1.0}, {"review_id": "oF_jWZ8Ge_E0Y89o1wH8wg", "user_id": "c4Rpt1sgzGxS1e4n__oIqw", "business_id": "FFaR1oEJbzjn7CohqIt6TQ", "review": [["This is the absolute worst Chipotle I have ever been too. The service is horrible. I've been there in person and the food doesn't even taste that good. I placed a delivery order through Postmark and of course they forgot one of my items. Thank God the delivery guy was nice enough to go back and pick it up for me. When I called the girl that answered was telling me I needed to come and pick it up because they were busy! And it was the smallest burrito I have ever gotten from any Chipotle! They just opened and it already sucks. It can only get worst from here. I don't think I'll be going back even though it's conveniently close to my house. Very disappointed."]], "date": "2018-08-24", "time": "01:01:56", "categories": "Restaurants, Mexican, Fast Food", "city": "Wyncote", "state": "PA", "stars": 1.5, "business_review_count": 48, "predit_yelp_score": 0.725, "actual_yelp_score": 1.0}, {"review_id": "8IlWHDtAC8uSOI2z-b4ekQ", "user_id": "jvq9_mBtR1gYAeLsQ3gI7Q", "business_id": "dgGuvdysSuWOv2dKqZTbVA", "review": [["My wife asked for no cheese, which the manager understood as a fistful. Then she got visibly annoyed when asked to remake it. \n\nBe careful when asking for sour cream here - there was easily as much sour cream as there was of everything else combined!\n\nBut at least the chicken was ice cold!\n\nThen, we were charged for a chicken burrito we didn't order or receive. When we asked for the refund, there was quite a bit of rudeness and eye-rolling.\n\nOverall - poor food, poor service, and (literally) over-charged. Avoid this place"]], "date": "2019-07-29", "time": "00:10:12", "categories": "Mexican, Restaurants, Fast Food", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 186, "predit_yelp_score": 0.6749999999999999, "actual_yelp_score": 1.0}, {"review_id": "da-d1CTRWvI44hGUPjq4QA", "user_id": "gPJrl0UlPHMtjSN2VfoG5w", "business_id": "9X_Sh8wiS1oiXq1klrJmxw", "review": [["This is the Chipotle I've been coming to since highschool. This is the first location I ever went to and it holds a dear place in my heart as the Chipotle opened right around my senior year. This was the SPOT to hang out. I've had friends work there over the years. I've never had a bad order there. Friendly staff even throughout all the years. I lost my wallet in their parking lot and the employees did their best to keep it safe until I could pick it back up. One of the employees even tried to find me on Instagram. I hope this place stays open forever. Thank you guys for the best chipotle experience."]], "date": "2020-09-16", "time": "22:08:37", "categories": "Restaurants, Mexican, Fast Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 87, "predit_yelp_score": 3.5000000000000004, "actual_yelp_score": 5.0}, {"review_id": "vE1upGax4GYU4I34uBO9TA", "user_id": "KWLxxZKAcdUOBqBLMPW22w", "business_id": "8lfRMOaf-DKRCHWsP6Y8PA", "review": [["We wanted a quick Whole30 compliant meal and found it here!! We had a carnitas salad with salsa and guacamole. Delicious! Service was friendly and the restaurant is well maintained. I will be back."]], "date": "2017-01-29", "time": "19:22:20", "categories": "Restaurants, Fast Food, Mexican, Tex-Mex", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 72, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "7mL-tM4DSZJkjwqtvpBhwQ", "user_id": "G3Cmp98lfYyKVbO1NNgkuQ", "business_id": "aLL1V6Vr02dLFtSJsp5Ksw", "review": [["Wow. The worse Chipotle, even more worse then the Ghetto one off Olive. They don't put no meat in your tacos, and then they have the nerve to charge you 1.95 for some dark guacamole, and $8 for this small Burrito. I only gave two stars because the customer service was ok. Even then the other employees came telling the kid that was making my food to go wash his hands."]], "date": "2014-10-15", "time": "00:26:55", "categories": "Mexican, Fast Food, Restaurants", "city": "Bridgeton", "state": "MO", "stars": 3.0, "business_review_count": 50, "predit_yelp_score": 0.525, "actual_yelp_score": 2.0}, {"review_id": "cKa0wx4hXaLhMiXZakprfQ", "user_id": "FXTHbzRReHD0RzWOT99lGA", "business_id": "vvPGNsRbslG1-ovtMrLmsQ", "review": [["First off...I loveeee chipotle. This location is horrendous. 3 people in line were stuck for 4-5 minutes waiting for an employee trying to use a gift card on her break at the only register. It was ridiculous. Then the food was not up to chipotle standards. The chicken was bland and saugy, the guac was brown, the rice was greasy, and even the chips weren't right. This was at 2pm on a Saturday. I have never been to a bad chipotle until now. Just go to Kop."]], "date": "2015-11-15", "time": "14:59:58", "categories": "Mexican, Fast Food, Restaurants", "city": "Plymouth Meeting", "state": "PA", "stars": 3.0, "business_review_count": 79, "predit_yelp_score": 0.7250000000000001, "actual_yelp_score": 1.0}, {"review_id": "x3vawYPUGiJvTGQcTQAhlQ", "user_id": "AEowRtLGb_AdqFAZ8e6C9A", "business_id": "uupdI7jlavQBKXme3NS6cA", "review": [["Sadly the streak of 1 stars here continues. Completely stale chips, inaccurate app order, messy lobby and the drink machine was out off all lemonade and 2 sodas. Staff here did not seem interested in service or being at work."]], "date": "2020-11-20", "time": "00:08:09", "categories": "Mexican, Restaurants, Fast Food", "city": "Nashville", "state": "TN", "stars": 1.5, "business_review_count": 65, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "nGvxSNN2df-a-c7k85rppQ", "user_id": "GD_-QH1XgKT6ZYgx258pgA", "business_id": "qmsdbXMG6DCNXEEZJz4d5g", "review": [["HORRIBLE! This location deserves 0 stars. The restaurant wasn't crowded, so I'm not sure why the young girl behind the counter was moving like it was rush hour....I watched her slap rice and beans like she was training for the Chipotle Olympics (let me know if there is such a thing!)\n\nBack to the Burrito Nazi: she stares at you, asks you if you want steak, rice...then proceeds to slap it on your burrito sloppily. The kicker: all the mess from the rice, beans, lettuce, etc ends up on the dirty counter and she wipes it with her hands to the trash and proceeds to use those same dirty hands to roll numerous burritos! \n\nMaybe she was pissed off because 4 of her co-workers were chillin in the restaurant eating burritos and tacos...I dunno, but damn....\nWill NEVER come back again....I'll take the drive to University City and grab Qdoba instead."]], "date": "2019-07-03", "time": "18:24:33", "categories": "Fast Food, Mexican, Restaurants, Salad", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 56, "predit_yelp_score": 0.27499999999999997, "actual_yelp_score": 1.0}, {"review_id": "Zx0TlPX4LhDcyQkiXIRT4g", "user_id": "FF2IGaAIUaCECCyxDDyj6A", "business_id": "-ajaASaDA_77I6pK3D4YgQ", "review": [["The previous reviews on how this location wasn't so hot were absolutely true. But between those reviews & now, I am pretty sure employees from more well-managed Chipotle stores in the area began working at this location (I definitely met some familiar faces from the Chipotle near my house who didn't used to work here before). I suspect that the previous complaints about service will change as this location gets whipped up into shape.\n\nIn the meanwhile, on my visits for lunch to this location recently, this Chipotle is everything i would expect a Chipotle to be. Great food served with integrity (no antibiotics and organic/local whenever possible), with super customizability, and at a fair price. If you're looking for great Mexican Food that will fill you up for sure, I highly suggest Chipotle."]], "date": "2014-10-11", "time": "17:02:42", "categories": "Mexican, Restaurants, Fast Food", "city": "Mount Laurel", "state": "NJ", "stars": 2.0, "business_review_count": 101, "predit_yelp_score": 2.55, "actual_yelp_score": 5.0}, {"review_id": "UaBDSGtrDLRvsDxZMY5lfg", "user_id": "TsurX2CrXCVebYR7cG5_lQ", "business_id": "iegiacdW0vbAuKjb7FYFfg", "review": [["I had been so excited that a Chipotle was opening up closer to me, and this Chipotle did not let me down. The line was pretty long as it was opening day, but the skillful burristas moved the crowd through quickly. My chicken and fajita veggie burrito bowl was delicious as usual, and now it's 4 blocks closer! Beware -- they may have a heavy hand on the sour cream so request only a little if that's your preference."]], "date": "2012-02-22", "time": "03:35:21", "categories": "Fast Food, Restaurants, Mexican", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 127, "predit_yelp_score": 3.7249999999999996, "actual_yelp_score": 5.0}]