[{"review_id": "6R9iTyKRGRQxOc03ow4lsw", "user_id": "n_ljSzvfEIPg1yCRocrc3g", "business_id": "Mu-ZNo2q_48Z0JAvzgkgfA", "review": [["How is this a donut shop and yet never has any donuts? This is the third time we have gone though the drive though this year and there are no donuts! I asked for three different types of donuts, not weird donuts or anything Boston cream or any cream or jelly filled donuts. They have nothing and their people seem stupidly stoned or slow. I cannot believe how slow the service was when you don't even have any donuts! My daughter loves their vanilla iced coffee so we go there occasionally as a treat for her."]], "date": "2019-03-30", "time": "23:13:54", "categories": "Donuts, Coffee & Tea, Food", "city": "Lansdale", "state": "PA", "stars": 2.5, "business_review_count": 31, "predit_yelp_score": 1.05, "actual_yelp_score": 1.0}, {"review_id": "SzpKjQJIoJocgfZx1DA8AQ", "user_id": "4HcByvqjoKyUX5mE8jGjjA", "business_id": "Ok0y3WvijsjmUpGAwlAZOQ", "review": [["Don't ever go through the drive thru. You think the line is short an it never is. Then once your in line your stuck there and can't get out. This place will make you late to anywhere you need to be. I have been sitting for 10 mins finally ordered and still have to wait to get to the window. People go through the drive thru to be quick and instead it takes longer. At this point I am beyond irritated and just want out of the line."]], "date": "2019-10-19", "time": "13:58:25", "categories": "Coffee & Tea, Donuts, Food", "city": "Wesley Chapel", "state": "FL", "stars": 2.0, "business_review_count": 38, "predit_yelp_score": 0.6, "actual_yelp_score": 1.0}, {"review_id": "wM7IwIgWLLbvb7QEGM_s1w", "user_id": "EIR-9eoCN-gIP7JNMPyP3Q", "business_id": "D88Cbal0C-mtgy8f6WdUig", "review": [["Sad to say I have made my last visit to this location.  I was a frequent customer, and have never gotten a correct order.  My last visit yesterday was the absolute worst!  I was very specific about what donuts I wanted and 5/12 were correct.  All but 3 donuts were slightly cold as if the were left from the night before and refrigerated.  It was 6:05 AM so I was anticipating fresh donuts, not day old donuts.  I'm not sure what the problem is, but it needs fixed!  I'll never know if it does as I won't be back! This place should be called Duncan Day Old Donuts! Peace out!"]], "date": "2021-04-02", "time": "10:51:44", "categories": "Coffee & Tea, Food, Donuts", "city": "Tampa", "state": "FL", "stars": 1.5, "business_review_count": 15, "predit_yelp_score": 1.2000000000000002, "actual_yelp_score": 1.0}, {"review_id": "lFHNDYoFL-sO8jce8dZWtg", "user_id": "_AANLqD7HI8zQzMDkOfcqQ", "business_id": "cVFjnwuSmDKfIudiPHmkPw", "review": [["This has been my \"neighborhood Dunkin\" for many years. They rarely ever get my order right, yet I continue to give them chances. I stop going for a few months and then decide okay I am going to stop, maybe they're under new management or something now. And it's the same issues, the order is incorrect and 8 times out of 10 the cashier at the drive thru is rude. Today was one of those days I thought I would give them another chance on my way in to work. I asked for a large black coffee... I reiterated no cream, no sugar. Very specific as I have a medical condition and cannot consume these products. Cashier was rude... not surprised based on the history, but whatever I have my coffee and need to get to work so off I go thinking I am good. Well, I guess my fault for not checking my order based on their history before leaving the drive thru window. I got to work and took off the lid and it was creamy and not like a splash of cream, it was very pale in color... very creamy! I attempted to call the number to the location and speak with the manager to let them know what happened, the phone rang and rang and rang until it went busy. I just wasted $3 on a coffee I cannot drink. Thanks for the reminder why I never go to this location and that I need to stop giving them chances to redeem themselves!"]], "date": "2018-09-21", "time": "12:20:41", "categories": "Coffee & Tea, Food, Donuts", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 75, "predit_yelp_score": 1.3, "actual_yelp_score": 1.0}, {"review_id": "-gqaynkUeGzAZSxt3BqzkQ", "user_id": "BcLEkxjjYX-L3jKdUKtWnw", "business_id": "rxuRBvc9vSkSEf35VsL4qQ", "review": [["The service here was very poor. The woman at the register was rude, and the order was incorrect.  I visited 2 different times, and had the same bad service. The two guys that prepared the food were great though.  Would go elsewhere next time."]], "date": "2015-02-23", "time": "21:03:27", "categories": "Food, Donuts, Coffee & Tea", "city": "Clearwater", "state": "FL", "stars": 2.5, "business_review_count": 27, "predit_yelp_score": 1.1, "actual_yelp_score": 2.0}, {"review_id": "0zHbYvC5HM17m9B_znh8PQ", "user_id": "rJvwE7QNroEzQaDaMm-AQQ", "business_id": "fFj8iQ8eVZui5kcPzPVIJw", "review": [["First time I've ever tried Dunkin Donuts - they are pretty tasty, but the staff needs some serious help with training! We arrived at Dunkin around 11 am on a Sunday morning, and waited in line for an hour. Since the place just opened, we were expecting a long wait. An elderly lady stood outside manning the door, so that an even number of people entered and exited.  She had an awesome spunky personality that made the long wait less painful. Once inside, we started thinking about what donuts to select and decided on these: chocolate French cruller, raspberry filled, pink frosted, oreo, and traditional chocolate bar. \n\nAt the counter, an overly friendly and rather spastic tiny blond girl (who probably already drank 10 cups of coffee) asked for our order. I started reading off our selections, as she began typing them into the register. Apparently the young teen boy behind her was supposed to be packaging the donuts as she rang them up. Well...he couldn't even figure out how to get the paper bag open. She turned around and saw him struggling - provided an example of how to open the bag - and I had to repeat my entire order. He just stood there staring at the donuts before finally putting one in the bag. I slowly began repeating for the 3rd time, and she turned around again to point out the appropriate doughnuts to this poor bewildered boy. Adding to  the confusion, the girl said \"you've already got 5, why not just make it a dozen?\" I politely declined, as that was way too many for 2 people. She began arguing that we should just buy a dozen because then one was free. No thanks. That would've taken an additional half hour anyways! Next I ordered the Chicken Salad Croissant, but they were out of croissants & I had to cancel. Also, I got a Mocha Chill, which was delicious, not overly sweet, and very refreshing. \n\nThey almost had an over abundance of employees behind the counter - so many people running around that didn't have a clue what they were doing. It was a pretty chaotic situation, but I guess the flaws will be ironed out as training continues. The pink frosted donut was insanely sweet and had a funky fake strawberry taste, so we won't order that again. My favorite was the chocolate cruller, which had perfectly moist dough and fantastic frosting. I love that Dunkin doesn't fry the donuts, but bakes them instead. Oh and one more strike for Donut Boy... when we got home, we found that he put the pink frosted donut upside down on the chocolate bar, so it had become a choco-pinky gooey mess. I'll definitely go back again, but next time I'll use the drive through."]], "date": "2015-07-27", "time": "20:10:12", "categories": "Food, Donuts, Coffee & Tea", "city": "Sparks", "state": "NV", "stars": 2.0, "business_review_count": 259, "predit_yelp_score": 0.925, "actual_yelp_score": 3.0}, {"review_id": "lxL_rUn1AmY7FrKWWh-wuQ", "user_id": "fHxEFQw3wsdBuomapexTtg", "business_id": "kjnXnl9767bVQEQUmuuMCQ", "review": [["Coffee was not strong, bland. It's a Girl Scout coffee. Got the cosmic candy donut, the candies were so stale and nasty!! Worst donut ever!"]], "date": "2018-05-05", "time": "00:11:33", "categories": "Donuts, Food, Coffee & Tea", "city": "Carmel", "state": "IN", "stars": 2.0, "business_review_count": 45, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "7MUnoxNA7-nv4sj8sAuFtQ", "user_id": "d9uL54c-p26hA9AXpi5ZzQ", "business_id": "kWxZoWO-Nw9V_xBgUYrRgQ", "review": [["I'm a grown adult and I just went to Dunkin Donuts for the first time in my life! I used the drive thru and got a cake donut and glazed donut. The black guy at the window was near impossible to understand and I kept asking him to repeat. He was nice though and didn't charge me for my tea!"]], "date": "2014-04-23", "time": "19:55:00", "categories": "Food, Donuts, Coffee & Tea", "city": "Kirkwood", "state": "MO", "stars": 2.5, "business_review_count": 67, "predit_yelp_score": 1.2750000000000001, "actual_yelp_score": 3.0}, {"review_id": "lKfQ-mPAu1E8gXnx-vUL2g", "user_id": "rpANYwP30Q1LaBdWb6T42g", "business_id": "sGnSlJffPkhXb6C61y2ywQ", "review": [["Great friendly staff.  They work hard to make their customers happy.  The floors and restrooms are always spotless!!!  If you are a regular, like me, Andy or Rashmi will memorize your order and get it going as soon as you walk in the door.  They also somehow seem to remember everybody's name.  As far as \"fast food\" goes, this place got it right!!!"]], "date": "2011-11-18", "time": "17:42:35", "categories": "Food, Donuts, Coffee & Tea", "city": "Wilmington", "state": "DE", "stars": 4.0, "business_review_count": 11, "predit_yelp_score": 2.525, "actual_yelp_score": 5.0}, {"review_id": "cS_knKTzJoPjvACTWvb64A", "user_id": "pJ1wgY7Ads5lXcKNAN5bAQ", "business_id": "DX3_ZHbtsl705f0CnHd82g", "review": [["Make sure that you check your order before pulling away. They've messed up my order twice in less than a handful of times I've been there. This last time, I drove back and there was no apology for the mistake or anything done to make up for the inconvenience. Normally, I'd let it go, but don't mess up the kids' order because you'll never hear the end of it."]], "date": "2021-03-20", "time": "13:19:43", "categories": "Food, Coffee & Tea, Donuts", "city": "Jamison", "state": "PA", "stars": 2.0, "business_review_count": 18, "predit_yelp_score": 0.1, "actual_yelp_score": 1.0}, {"review_id": "Jxqo1MePhSSOdWpRSn7wGA", "user_id": "EOhXW4hVxacJe9fk7FCcrw", "business_id": "41UZPKPojnFz70F8aP5VEg", "review": [["Absolutely horrible customer service. The employees were extremely rude when ordering through the drive-thru. As a matter of fact, they were so rude that we decided to cancel our order and just leave. As we were driving out of the drive-thru, the employee thought it was appropriate to flip us the bird... I absolutely love dunkin donuts, and will continue to be a customer, just never at this location again. Horrific experience."]], "date": "2018-06-09", "time": "17:53:22", "categories": "Donuts, Food, Coffee & Tea", "city": "Saint Petersburg", "state": "FL", "stars": 1.5, "business_review_count": 14, "predit_yelp_score": 0.625, "actual_yelp_score": 1.0}, {"review_id": "UVcKptb2mF77GBDasCGVyA", "user_id": "FxhAK-kd61S8WOhztrQdnA", "business_id": "UrWsPqcJFlf5sGVRZzsuYw", "review": [["The absolute worst service I have ever had in my life. Rude ignorant mean horrible people do not go to this place. Two issues back to back. First time get their order in the drive-through pull up to the window they tell me I did not order and they do not have my order. The person actually told me that I can leave if I don't like something. Figured you know what F them I will not even bother leaving a negative feedback.  About four months later which is today I pull up and remember the situation but wanted my coffee. So instead of ordering a drive-through I pull up to the drive-through window and tell them hey can I get a coffee she looks at me and says you have to order a drive through the same person that serviced me the first time. I said remember me obviously she didn't last time you told me I didn't order so there's no point for me to stand and order at a drive-through here's my order she tells me to go F myself right to my face. I hope whoever reads this ignores this location."]], "date": "2016-12-01", "time": "16:25:06", "categories": "Donuts, Coffee & Tea, Restaurants, Food", "city": "Philadelphia", "state": "PA", "stars": 1.5, "business_review_count": 12, "predit_yelp_score": 0.35, "actual_yelp_score": 1.0}, {"review_id": "ue4hjAYkebnizmRrCmI9tw", "user_id": "nZE77LxMEj9y7WlZT1cEAA", "business_id": "lbtx0YX6Hj1F1WEv-QQjbg", "review": [["I was so excited to go to Dunkin' Donuts specifically for my sons first donut trip! I was a little disappointed by the lack of selection. My favorite donut is the chocolate crepe filled and they did not have that or the chocolate with chocolate icing! Yeah disappointed but also my coffe came regular instead of the new chocolate cherry flavor so unfortunately I don't know what it taste like yet!"]], "date": "2019-04-23", "time": "17:17:26", "categories": "Restaurants, Food, Coffee & Tea, Donuts", "city": "Oldsmar", "state": "FL", "stars": 1.5, "business_review_count": 40, "predit_yelp_score": 1.2750000000000001, "actual_yelp_score": 3.0}, {"review_id": "gPjY01QwCul_5Of0lVNqmw", "user_id": "BHW7u6sXDSvKVvSMwc5obg", "business_id": "kWxZoWO-Nw9V_xBgUYrRgQ", "review": [["Rude, unprofessional staff. Waited 1.5 hours like a fool to get my order...and it was wrong. Staff did not prepare anything in advance but waited for you to get to the window to ask what you ordered. Worst experience ever."]], "date": "2021-10-31", "time": "16:41:02", "categories": "Food, Donuts, Coffee & Tea", "city": "Kirkwood", "state": "MO", "stars": 2.5, "business_review_count": 67, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "tuyFFdynn-AxYgdnoTxi7A", "user_id": "hWDybu_KvYLSdEFzGrniTw", "business_id": "D215IzO-XoSxNFhKDEv2RQ", "review": [["Larger sized DD with a few tables inside, otherwise it's the same DD menu and coffee. Getting in to the parking lot here very easy, but getting out and back onto the highway involves two speed bumps and a trip through the small plaza."]], "date": "2015-01-13", "time": "14:26:52", "categories": "Donuts, Coffee & Tea, Food", "city": "Newark", "state": "DE", "stars": 2.5, "business_review_count": 9, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "RnQ91Ljy6YT44ifRSkFZMQ", "user_id": "6FuEMEUrrgvHSQjMAykh1A", "business_id": "DaVWa71vav0Mv1cg2H-gfw", "review": [["Would give this Dunkin' no stars if I could. I love Dunkin' donuts but the service at this one is awful. Watched this guy ask for another frappe to be made for him cuz his wasn't blended enough, and the girl employee at the register started yelling at the man. Very unprofessional. Worst Dunkin' you'll ever go to"]], "date": "2015-04-25", "time": "17:52:41", "categories": "Coffee & Tea, Food, Donuts", "city": "Seffner", "state": "FL", "stars": 1.5, "business_review_count": 40, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "jigfoE8jlGaUeDtShjOINA", "user_id": "qf1ZsQFW9ZMi_KG3AUtpng", "business_id": "J96Q1F6TamXl5FCp4wDeoA", "review": [["The times I have been there the service has been great. There isn't much of a line. When it comes to cappuccino blast drinks the taste vary, by that I mean sometime they are too sweet and other times just right. I haven't seen any of the old employees so ,I'm guessing that's why there are some mistakes being done. I think they got the hang of it now."]], "date": "2014-05-31", "time": "17:01:16", "categories": "Coffee & Tea, Donuts, Food", "city": "Metairie", "state": "LA", "stars": 3.0, "business_review_count": 56, "predit_yelp_score": 1.75, "actual_yelp_score": 5.0}, {"review_id": "RnUpZjGTtCjo9Qd2FtwTXg", "user_id": "TySmiEJ4Pl77MzBTWUySTg", "business_id": "7UCEKJGWBqeJ-L-DHw8Y8w", "review": [["Best iced coffee! So glad they opened close to my work, right on my commute. We came with the family to pick out a dozen donuts. The donut cases were still full and had a lot of variety. I like how clean everything was, granted it just opened a few days ago. We were immediately greeted and waited on - so yay for customer service! I got a banana split iced coffee and it is so good. Recommend Dunkin for your coffee and sweet fix."]], "date": "2019-05-26", "time": "00:13:58", "categories": "Coffee & Tea, Food, Donuts", "city": "Fishers", "state": "IN", "stars": 2.5, "business_review_count": 20, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "CFsoDIZC31igaqTyw4BAQA", "user_id": "oK6BTmNydLPxpaHBnKex1g", "business_id": "HIkgNCI38ga0NWcbmDqzWw", "review": [["12 min in line and understaffed on a Saturday morning?  Come on.  No donuts?  No milk?  Bad."]], "date": "2017-07-08", "time": "17:05:25", "categories": "Food, Coffee Roasteries, Coffee & Tea, Bakeries, Donuts", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 52, "predit_yelp_score": 0.05, "actual_yelp_score": 2.0}, {"review_id": "BJObjGlwHGVyMoRDLyJFWA", "user_id": "HH3IyvD1MpxZ-FlazroBuQ", "business_id": "ATp5s0MCyKxjWQJy4HNPHg", "review": [["Went there today and had a bad experience.  I went in the store to order and there are several people ahead of me.  Couple of them said they have waited for 15-20 minutes with no one taking the orders.  They said they tried to ask the employees and no one even bothered to answer.  Finally, another customer and I called an employee over and she started to take orders.  I ordered bacon topped avocado toast along with some other items, and there is no bacon on it.  They charged me for it but give me the plain avocado toast instead.  I was already out of store and didn't have time to go back and wait again.  Anyway, seems like they are either very understaffed or just don't care."]], "date": "2021-04-29", "time": "14:10:12", "categories": "Food, Coffee & Tea, Donuts", "city": "Oaks", "state": "PA", "stars": 2.5, "business_review_count": 25, "predit_yelp_score": 0.275, "actual_yelp_score": 1.0}, {"review_id": "S2wC9vgIKJq8NcyAaTQjQw", "user_id": "UsNU0VPBMLBFy1E2ceUF2g", "business_id": "qSfTZcLbm50K1i_vgqBhqg", "review": [["Long wait times in drive thru when it's not busy. It's like they take and complete one order at a time. They seem to always be out of donuts, even at 10 am, on multiple occasions. It's a chain, how is that possible?"]], "date": "2018-08-27", "time": "10:51:11", "categories": "Food, Bagels, Donuts, Coffee & Tea", "city": "Brentwood", "state": "TN", "stars": 2.0, "business_review_count": 49, "predit_yelp_score": 0.8, "actual_yelp_score": 1.0}, {"review_id": "y8_Gl3auPXkHHIirO35JHA", "user_id": "qJFKlbq9qrpeO2DUR-kBDA", "business_id": "0vU_OcoHU_hcEfNTpDyOvA", "review": [["Butter surcharges, jelly surcharges, the pad locking of the soda cooler on an exceptionally hot day are among the many things that annoy me about this location. The only one young lady who speak the English language in the store is treated like a workhorse and winds up having to correct other people's mistakes. You shouldn't have to go into this type of place and have to repeat something three or four times and have the employees who cannot understand the Kings English get it wrong"]], "date": "2016-07-21", "time": "16:45:23", "categories": "Donuts, Food, Coffee & Tea", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 11, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "2gu9SxNSDuDbrObhsLgE9A", "user_id": "zqh0Gm8TLOQmU1ayg-DPDg", "business_id": "d5WQMTNea__i3nUjz2qYdA", "review": [["Today was my first time going to this particular DD.  It was only on my way to work today becuase I had to run an errand before work, which brought me to Route 38. \n\nI find the location, inside a liquor store, kind of odd, but hey, it was convenient on my commute so I won't judge.  And if it were later in the day, perhaps I could have picked up a bottle of Bailey's to go with my coffee. \n\nAnyway, as far as your typical DD goes, this one was perhaps a litle above average.  There appeared to be a couple of people ahead of me, but I guess they were already taken care of because the gentleman behind the counter was already asking for my order as I was still walking up.  Another gentleman made my coffee while I was still paying - I like the team work.  My egg and cheese sandwich was done in probably less than a minute after I was done paying, so I was in and out, without any real loss of time on my commute to work."]], "date": "2012-11-17", "time": "01:16:32", "categories": "Donuts, Food, Coffee & Tea", "city": "Mount Laurel", "state": "NJ", "stars": 3.5, "business_review_count": 10, "predit_yelp_score": 2.1, "actual_yelp_score": 4.0}, {"review_id": "mSZBnUXZUU_D9a5jPq7kVQ", "user_id": "Yc-OlhVEe2ercH5s5yGaBQ", "business_id": "oqZrIL_hCfWKrbETRVmvlQ", "review": [["If you like poor service and stale, not-made-fresh (they don't make dough in store anymore) donuts, this is the place.  Honestly this location has the worst service.  Waited in drive thru this morning, 3 mins sitting at speaker before being acknowledged, then literally 5 mins at window while I watched the person at the drive through take out the cash drawer and count money with a calculator.  Never acknowledged me, nor did anyone hand me my difficult order of a black coffee and a donut which could have been rung up at another station.  I drove off, and will not be returning."]], "date": "2017-04-05", "time": "14:40:52", "categories": "Donuts, Food, Coffee & Tea", "city": "Ballwin", "state": "MO", "stars": 2.0, "business_review_count": 49, "predit_yelp_score": 0.0, "actual_yelp_score": 2.0}, {"review_id": "udmXQqny_LSDp2XGax1ylQ", "user_id": "K8WGykDWYa2NsmewCxWgaw", "business_id": "nTq_BaEGkIjTHhKvnuc4Ng", "review": [["This place was gross. Looks like it hasn't been cleaned in months. Window sills covered in dust. No table was clean huge rips on some of the seats. Then my son had to go to the restroom where the soap is actually turning green and the floor was cleaner than the sink. This is what the front looks like I can't imagine the back."]], "date": "2017-03-07", "time": "17:14:23", "categories": "Coffee & Tea, Donuts, Food", "city": "Palm Harbor", "state": "FL", "stars": 2.0, "business_review_count": 49, "predit_yelp_score": 0.7250000000000001, "actual_yelp_score": 2.0}, {"review_id": "M1J2j5VEJGaCpwUEY9_bWA", "user_id": "UDJSvSpSC8LjkdawabN_Vw", "business_id": "T6HVr4su70-JEo0XDDV9dQ", "review": [["Terrible service. Girl did not know how to work register or take proper order. Everyone waiting in line walked out angry and with wrong items including our family. Outdoor dining area was dirty and they were out of most items because they still had a ton of boxes to unpack."]], "date": "2021-07-09", "time": "15:39:37", "categories": "Food, Donuts, Coffee & Tea", "city": "Nashville", "state": "TN", "stars": 2.5, "business_review_count": 35, "predit_yelp_score": 0.22499999999999998, "actual_yelp_score": 1.0}, {"review_id": "TkTI6Rv7nSYZYjYqygsi0g", "user_id": "-G7Zkl1wIWBBmD0KRy_sCw", "business_id": "x74ddt2X1j6SLbuCo0vV8w", "review": [["This fairly new freestanding Dunkin' Donuts in the wilds of Eastampton, NJ, was empty when I arrived for a post court late breakfast and java. In my recent experience, the proliferation of DDs has diluted the quality and consistency of the signature products, so that the coffee is often harsh and undrinkable in some shops, and still quite good in others.  Same thing for donuts. Some have good ones. Some don't.  As everyone is trained the same way, it comes down to water quality and cultural familiarity with sweet rounders.\n\nThis joint was pretty good.  There was a small communications problem, but what I ultimately received (breakfast sandwich and joltin' joe) were both hot and tasty.  \n\nNo complaints.  And, a nice facility with a large lounge area for those who want to get some work done, or take a comfortable nap - perhaps, both."]], "date": "2016-08-02", "time": "14:56:26", "categories": "Food, Donuts, Coffee & Tea", "city": "Eastampton", "state": "NJ", "stars": 3.0, "business_review_count": 14, "predit_yelp_score": 2.075, "actual_yelp_score": 4.0}, {"review_id": "q-0WVjGkVxcDNPbOXACrOw", "user_id": "fGgPv-KlQhOObiCQz-mXXA", "business_id": "g2tZiRNl9Yyo1KWPkvrx7w", "review": [["Honestly the rudest employees. Walked in waited at least 8 minutes for them to come over when they weren't busy at all I was the only person in the place. So I finally order and I get a medium iced coffee and then ask if I get a free donut (National donut day today which they have been advertising), she responds super annoyed \"yeah\" and turns around to grab a random donut when I asked for a plain glazed. She says, \"you don't get to pick your donut..\" and starts talking in another language to me and then to the other employee. I tell her I couldn't understand her and she ignores me, snatches the bag and grabs the random donut she put in there, puts it back and gets my glazed donut. Acts all annoyed and tells me again that \"I can't pick my own donut but she'll do it.\" Interesting, because the advertisements say otherwise. Overall terrible experience."]], "date": "2018-06-01", "time": "21:58:40", "categories": "Coffee & Tea, Donuts, Food, Restaurants, Bagels, Breakfast & Brunch", "city": "Saint Charles", "state": "MO", "stars": 1.5, "business_review_count": 54, "predit_yelp_score": 0.525, "actual_yelp_score": 2.0}, {"review_id": "wsCDGUTAwQ2_KhBh3_IYOg", "user_id": "UGJFW8uVFVxOfLEn2Pr_vg", "business_id": "6HsLzUyVMSj9NTjziJipog", "review": [["I can see why they have such a low rating.  Customer service is an unknown action at this location.  It's such an easy stop for me on my way to work but I will go to a different location even if it's out of the way.  No one is making you work at Dunkin, if you hate your life so much change it, don't take it out on your customers!"]], "date": "2021-09-10", "time": "13:07:00", "categories": "Coffee & Tea, Donuts, Food, Food Delivery Services", "city": "Saint Louis", "state": "MO", "stars": 1.5, "business_review_count": 55, "predit_yelp_score": 1.625, "actual_yelp_score": 1.0}, {"review_id": "RTRUxmiGiRiGOvI-zRAaAA", "user_id": "QGvkG23m5bfWlzVb2mqtXA", "business_id": "hSGNnn68K4W4Dbzp6GJ2UQ", "review": [["OMG!!! The RAW SEWAGE SMELL AT THE DRIVE THRU SPEAKER!!!!.. It is the WORST SMELL EVER!!!!.. We got sick to our stomachs. Kid working the night shift would not take our order unless we did it at the cesspool. Claimed it was the grease trap at McDonald's....BS!!!. Grease does not smell like RAW SEWAGE!!! Tried to call the number at this location the next day and it goes to a fax. Corporate really needs to address this place. It was the worst offensive odor in the planet's history!"]], "date": "2019-06-07", "time": "23:57:54", "categories": "Donuts, Coffee & Tea, Food", "city": "Temple Terrace", "state": "FL", "stars": 2.0, "business_review_count": 17, "predit_yelp_score": 0.625, "actual_yelp_score": 1.0}, {"review_id": "YLhO6-e_tb2VYhDDUO5wfw", "user_id": "FYuSYO1PvJU-I4Hlgio6mA", "business_id": "eO5MbK-ujRQMwLWqbAMqrQ", "review": [["It's a Dunkin Donuts at PHL, does this really need a review?\nLines move quick... no fuss coffee... the donuts and coffee is up to DD standards.  This is my arrival, pre-rental car tradition to grab my coffee and donut here :P"]], "date": "2011-11-12", "time": "13:35:06", "categories": "Donuts, Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 44, "predit_yelp_score": 3.225, "actual_yelp_score": 3.0}, {"review_id": "9GAyQguRcWD2PxgXsL3kpA", "user_id": "U1wQ-R7kJOp1erXZZGortg", "business_id": "2WP7yrPIdXaaZA_T50jcgA", "review": [["This Dunkin' Donuts consistently has the best doughnuts/doughnut holes I've ever had.  This is compared with other dunkin' donuts, alternate chains, and non-chains.  I'm not sure what they do different, but it's something, and that something is good.  Maybe they make each batch with love ... I don't know.\n\nThis Dunkin' Donuts is also one of the worst managed establishments I've ever been to.  It doesn't mater what time of the day you go, if you pick the drive-thru or the counter, which staff member is running the register, the service takes FOREVER.  Even if it's a Saturday or Sunday and you have nothing to do, the time it takes to place and get your order requires a great deal of patience.  This problem has existed since the inception of the store, and almost a year later (at the time of this review) it has yet to be improved upon.\n\nThe staff is generally nice, the place is clean, and they recycle, all pluses in my book.\n\nIf you have time, the goodness of a glazed doughnut from this place out weighs the sluggish service.  My recommend order is sharing a 25 pack of glazed munchkins with some friends."]], "date": "2009-06-18", "time": "03:58:30", "categories": "Food, Donuts, Coffee & Tea", "city": "Saint Petersburg", "state": "FL", "stars": 2.5, "business_review_count": 64, "predit_yelp_score": 1.75, "actual_yelp_score": 4.0}, {"review_id": "9QBMwr2_ZmQD6Rl3XlXylg", "user_id": "xSL9u3DfZAO1utxoiN6hvg", "business_id": "vQ_rxK8TV37QOS-uJvGGQA", "review": [["I had no issues, two people ahead of me which is expected at any coffee shop. Great service, friendly staff, LOVE the new fudge croissants"]], "date": "2016-01-07", "time": "14:44:12", "categories": "Donuts, Food, Ice Cream & Frozen Yogurt, Coffee & Tea", "city": "Saint Pete Beach", "state": "FL", "stars": 3.0, "business_review_count": 45, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "7E8SKPpnZwDTKLWjV8bcCw", "user_id": "Nh3xnaqSmFTZ8RBGf-MIWQ", "business_id": "T1a5ODI7B19pLQVdBIs8Gg", "review": [["I have never had a bad experience at this DD location. The owners and employees are all extremely friendly and offer great customer service. Great coffee and fresh bakery items! My favorite DD by far in my vicinity."]], "date": "2017-11-02", "time": "12:28:07", "categories": "Restaurants, American (New), Coffee & Tea, Food, Donuts", "city": "Mount Laurel", "state": "NJ", "stars": 2.5, "business_review_count": 19, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "k0viUcFfGZgZbPvL3u0f_g", "user_id": "ga9KoB2YNQN-AHxar6t46w", "business_id": "nj2Dah8x5kVwOEBZ46FX1g", "review": [["I got sick both times I went to this location, avoid it like it's the plague, literally!!!!!"]], "date": "2019-06-19", "time": "09:48:35", "categories": "Food, Restaurants, Donuts, Coffee & Tea", "city": "Conshohocken", "state": "PA", "stars": 1.5, "business_review_count": 45, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "uhXpEgM8XBgVpzUBj8hQ9w", "user_id": "DaJjOzyzsSablTcvyUx3mw", "business_id": "TkEjccBOzVcc7uRjA8nmmQ", "review": [["This DD is located on the busy Gulf to Bay but don't let that deter you from fast friendly service and decent reasonably priced food and caffeinated beverages. This DD was clean and had ample parking. As I've said in the past, I don't normally drink coffee but I would become a regular for Dunkin Donuts iced coffee. \n\nMy go-to drink is the French Vanilla ice coffee with cream and sugar, plus a little more sugar. Add the croissant sausage egg and cheese sandwich, a French Culler and hash browns and I've got the makings of the best food coma breakfast. Sadly an order of the hash browns only comes with roughly 8 large coin nuggets but at $1 and some change I'm always up for ordering more. \n\nA medium iced coffee, breakfast sandwich, a donut and two orders of the hash browns totaled at $8.41. If they had DD in MN I would be there everyday."]], "date": "2014-03-16", "time": "22:44:22", "categories": "Donuts, Coffee & Tea, Food", "city": "Clearwater", "state": "FL", "stars": 2.5, "business_review_count": 54, "predit_yelp_score": 1.9749999999999999, "actual_yelp_score": 5.0}, {"review_id": "vmz-0_eYAJNf8UlbOOjVBw", "user_id": "eAWnP9ZeVo8kp808y-0LXA", "business_id": "qVVz1sRZVNH2xt865M64Dg", "review": [["Indeed....I am the Dutchess of said Dunkin Donuts, so I should have something to say about it, right?  Umm....it's a chain store that sells donuts and I like donuts?  Okay, kidding aside for the next sentence or three, I'm never going to slam a Dunkin Donuts in TN.  I'm a northeastern er and having DD move into our neck of the wood was a BFD.  Krispy Kremes are lovely, but for the cake donut afficianato, they just don't cut it.  The location is small, has a drive thru and is clean and well kept up.  They don't have butternut donuts (Esquire magazine's professed \"ULTIMATE DONUT\" - I agree with that - but they have a good selection on weekends.  If you go past 5 pm, its pretty sketchy in terms of selection.   It's a win for Bellevue if not a great step forward for mankind."]], "date": "2013-02-25", "time": "01:09:46", "categories": "Food, Bagels, Donuts, Coffee & Tea", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 43, "predit_yelp_score": 2.15, "actual_yelp_score": 4.0}, {"review_id": "OF1k8hFm80sv-uJdjod4Yg", "user_id": "a0g6ZZa4Gkk_yawAWWPLkw", "business_id": "JaBxw6oXYaizlh5Y_DoKkg", "review": [["As usual, the service sucked.  They spent a lot of money remodeling-  too bad they can't get enough, or alert people behind the counter.  It's ALWAYS slow, and today the like was even longer since instead of saying can I help the next customer she just picked whoever the next person that was in her line of site.  \n\nUnfortunately Dairy Queen isn't much better-  I do find the drive through goes faster.  Maybe I'll try that ar dunkin-wait-in-line."]], "date": "2016-09-14", "time": "21:59:43", "categories": "Coffee & Tea, Donuts, Food", "city": "Holiday", "state": "FL", "stars": 2.0, "business_review_count": 18, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "edDKJun0ri1ytSB3B7eweg", "user_id": "ir19Z8x_86mKH5YsQ3uNtQ", "business_id": "kPy6jsVWuMREMRWRGTvEyw", "review": [["This place doesn't ever have any good donuts left. Bake more popular ones, less of the others. This idea should be simple, but this location can't figure it out. Delivery ordering is clunky, and ultimately pointless, as they need to call you to actually pick out your donuts anyway.\n\nThey don't have your favorite, so don't ask. Just swallow the weird flavors you are forced to compromise on. As the fake blueberry hits your taste buds, you begin to question if this is worth the price. Bakeries need to be run with precision, these donuts are not even consistent.\n\nDunkin needs to examine how to do business in the digital age, while still delivering a worthwhile product. This location leaves me completely underwhelmed, both in person and delivery are both disappointing."]], "date": "2020-09-13", "time": "01:22:08", "categories": "Food, Donuts, Coffee & Tea", "city": "Brandon", "state": "FL", "stars": 3.0, "business_review_count": 37, "predit_yelp_score": 0.525, "actual_yelp_score": 1.0}, {"review_id": "Dfyz5dfho0SM9QfsOJf53w", "user_id": "4HtF25G0_yGPsq7DQXfBDw", "business_id": "4E3iIAuCGDz7h3D4nJzuHQ", "review": [["Do not waste your time. I was there just 20 minutes ago. I stood at the counter for 5 minutes or more. The man at the end did not even say hello let alone wait on me. I called back and said hello and he turned his head. I went to Wawa and they greeted me when I walked in the door. They evidentally dont need the business and will not get it from me"]], "date": "2019-10-11", "time": "19:02:29", "categories": "Donuts, Food, Coffee & Tea, Restaurants", "city": "Norwood", "state": "PA", "stars": 4.0, "business_review_count": 10, "predit_yelp_score": 1.275, "actual_yelp_score": 1.0}, {"review_id": "BZIyUPBjKiJ7E1eY_T_W8A", "user_id": "Wj3Aq_k1sKLY-1uJ4rjsZg", "business_id": "x5zkOBa82aH9dsB8-ZUNNg", "review": [["I stopped by the Dunkin' Donut store at 4599 66th St N. Kenneth City, FL  33709 and had a horrible experience through the drive thru.\nI ordered an iced vanilla latte, with an extra shot of espresso and half of a pump of vanilla so that it wouldn't be too sweet, as well as an everything bagel. And to start, the responses I received while ordering were very short and dry. \nThe only reason that I'm writing today though, is what I received on my cup of coffee. Written on the cup is \"F U LAME\". I am angry and shocked, and would like to have this type of service noticed and taken care of, as I have been a loyal customer for years. The location in Kenneth city is by far one of the worst Dunkin' stores I have been to. The service is always hit or miss. But as of today, I will never return."]], "date": "2018-07-30", "time": "15:07:06", "categories": "Food, Coffee & Tea, Donuts", "city": "Kenneth City", "state": "FL", "stars": 2.5, "business_review_count": 27, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "UIR7bWBM4S2b9eML55xceA", "user_id": "W3TxDoLIZgDPV9sAcKbH-A", "business_id": "RV4PKQxkJjF7VrUfuZgwLA", "review": [["I stop at this Dunkin almost every morning before work! The staff members are kind and have never messed up my order even though I switch it up sometimes. Something I love about this specific location is the freshness of the Donuts. Not sure if its the time of day I come in or something else but the pastries here seem much more fresh than at other Dunkin Donuts. I love how fast they get my order out as well."]], "date": "2018-06-18", "time": "19:47:42", "categories": "Food, Bagels, Coffee & Tea, Caterers, Event Planning & Services, Donuts", "city": "Wayne", "state": "PA", "stars": 3.5, "business_review_count": 14, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "Bw9BAcEiaxEn2wxKskhhSw", "user_id": "WPY5QnDi_zy5K2EtCs7tbQ", "business_id": "agnZcb-VR74GN01_8pHb7w", "review": [["So we stopped in this Dunkin last night and no one answered through the drive-thru to see if they could could help us. So we drove around to the window and thought we'd order there and some young guy was counting change. He ignored us didn't even open the window and to ask us what we wanted. We thought he just didn't see us so we Beep the horn and still ignored us so we drove off. It's a shame this store is a run like this with young people that just don't care. If you are the store franchise owner of this business you might want to think about closing it.\n\nYoung people seem not to care.\nWhy go back they ignore customers trying to give them their money."]], "date": "2020-09-17", "time": "20:18:34", "categories": "Food, Coffee & Tea, Donuts", "city": "Saint Louis", "state": "MO", "stars": 1.5, "business_review_count": 40, "predit_yelp_score": 0.25, "actual_yelp_score": 1.0}, {"review_id": "ne-HxT3B4L9jVV5ouX3Dhw", "user_id": "HKou_5tA8baQqMgUu4UflA", "business_id": "VpqcLFGASg6mB1PK5KqcpQ", "review": [["Quick stop in the morning to get my extra large black coffee to last me through the day. It's very easily accessible off US421 with a drive-thru and is connected to a gas station and convenient store."]], "date": "2020-02-22", "time": "15:46:43", "categories": "Donuts, Food, Coffee & Tea", "city": "Carmel", "state": "IN", "stars": 2.5, "business_review_count": 12, "predit_yelp_score": 2.5999999999999996, "actual_yelp_score": 5.0}, {"review_id": "zp3lZtHkp_o72-ccqIBrHA", "user_id": "zUk_Ww2q1At1QSyRbUjIGQ", "business_id": "hjHWlYtCRLg7CjAIvtUGGg", "review": [["I almost always do drive thru and for the wake \nup wraps. Cheap and relatively healthy. \n\nSometimes Ill grab munchkins for parties. \n\nThe service is friendly & pretty fast. \n\nWhen my guys were younger, employees would give them free donuts :)"]], "date": "2017-05-22", "time": "02:48:18", "categories": "Food, Coffee & Tea, Donuts", "city": "Blackwood", "state": "NJ", "stars": 2.0, "business_review_count": 12, "predit_yelp_score": 2.4749999999999996, "actual_yelp_score": 3.0}, {"review_id": "lGhD52RmWCUGFiscraafsA", "user_id": "8iWpUjaE7KRpLVWo84F1IQ", "business_id": "oGQb9Cx9Sk0Lvuns1Wf3tg", "review": [["I gave this one star because there's no such thing as 1/10 of a star. And that's because of the rudest dude to ever grace the walls of a Dunkin' Donuts in the history of mankind. See photos"]], "date": "2018-08-15", "time": "16:43:20", "categories": "Donuts, Coffee & Tea, Food", "city": "Tampa", "state": "FL", "stars": 1.5, "business_review_count": 28, "predit_yelp_score": 1.225, "actual_yelp_score": 1.0}, {"review_id": "zY3nMAkPz2mY4F7i5pXpeA", "user_id": "lSHooxEyrtkOl1u6isWtKg", "business_id": "0BZdcQAJjI-Kw97mQW_TPg", "review": [["My donut was hard and the seats were dirty.  Nothing really remarkable about it besides the building being cute."]], "date": "2015-03-21", "time": "01:10:36", "categories": "Coffee & Tea, Food, Donuts", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 59, "predit_yelp_score": 1.225, "actual_yelp_score": 2.0}, {"review_id": "Ctf46VWAn0vyNbB87Hx-aA", "user_id": "u1ULMq9J6OqNahAvsjYCNg", "business_id": "GLoP6o5UjGa3g-IP1L32JA", "review": [["Where do I start with this location! They never get your order correct. All I order from there is a large sweet tea with NO ice. Those idiots always give me a bitter tasting tea with NO sugar and a cup full of ice. Don't get me started on that horrible layout of a drive thru."]], "date": "2017-05-07", "time": "18:54:01", "categories": "Food, Donuts, Coffee & Tea", "city": "Riverview", "state": "FL", "stars": 2.5, "business_review_count": 47, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "53WIgXXFZhmty3zVyoOn_Q", "user_id": "_Snvv_nGfpctBG4OOWwGLg", "business_id": "UCmTG_e7I2a5dY_3qI6Jbg", "review": [["This is definitely the best Dunkin I've been to. The place itself is not your usual no-seating in and out DD. They have free Wifi, nice couches, etc. Just like a real coffee shop, but with DD's low prices. Yay! Like seriously, DD loves giving out deals. They're clean, efficient, and friendly. \n\nI've had problems at some DD's with milk that tastes off but I've come here several times with consistent service. Even in the mornings, no line! Woot."]], "date": "2014-11-10", "time": "17:04:29", "categories": "Restaurants, Bagels, Food, Donuts, Coffee & Tea, Breakfast & Brunch", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 25, "predit_yelp_score": 2.2, "actual_yelp_score": 5.0}, {"review_id": "FG9G5t3ZJzmpYuphVmO35w", "user_id": "4QUISzZIZ46arbfJJpoGIA", "business_id": "R2ZVVKXpZVQPj96cyDXZwQ", "review": [["Clean and welcoming environment. Everyone's always nice and able to get me in and out with my order made right. Bathrooms are always clean and smelling fresh. Also, I didn't know they had an espresso machine--ask for the Red Eye, it's delicious!"]], "date": "2019-10-21", "time": "15:35:27", "categories": "Coffee & Tea, Food, Donuts", "city": "Richmond Heights", "state": "MO", "stars": 2.5, "business_review_count": 43, "predit_yelp_score": 2.525, "actual_yelp_score": 4.0}, {"review_id": "1ueutKtIYlc6FDxb1IbqdQ", "user_id": "qu-r6QIV46StPjPYKt51Og", "business_id": "2AqEWqRbKhcY-30b9geCRQ", "review": [["It was so nice being reunited with DD on my recent trip to Philly. I am obsessed with their caramel latte. Don't change it to the skim milk it will taste completely different. When it's made with artifical sweeteners it also taste weird so just get it as is. Trust me you won't regret it! I am not a huge donut person but I enjoy their munchkins. The red velvet and pumpkin flavors are especially tasty."]], "date": "2013-04-09", "time": "21:24:39", "categories": "Donuts, Food, Coffee & Tea, Restaurants, Breakfast & Brunch, Sandwiches", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 19, "predit_yelp_score": 2.15, "actual_yelp_score": 4.0}, {"review_id": "UW_Dr8mP6LkhcndulVs4rA", "user_id": "2FlxKKgEndZlFAFiNefBkQ", "business_id": "O2apTti9QMFHWkRPeo_JNg", "review": [["If I could give no stars I would. I have repeatedly returned to this location over the past year, hoping for a better outcome, but every single time the service is just HORRIBLE. Their communication while taking orders is awful... many errors, very slow, like they aren't listening, unclear about options. The product you actually get at the window may or may not be correct, but if it is the correct item, it will be made wrong. For example, today I ordered an iced coffee. The employee asked if I would like it hot or iced. I asked what kind of donuts they have with chocolate sprinkles (my son is sensitive to artificial colors and can't have them). They gave me a chocolate frosted donut with rainbow sprinkles. When I asked for something else, they seem so confused and annoyed. In the past, I've ordered macchiatos and lattes and they come out with the cup 2/3 full. When Ive inquired about it, they say \"this is how we make them.\" Every other DD fills the cup up though. I'm officially gone with this location."]], "date": "2020-08-10", "time": "21:39:57", "categories": "Food, Ice Cream & Frozen Yogurt, Donuts, Coffee & Tea", "city": "Pennsburg", "state": "PA", "stars": 1.5, "business_review_count": 22, "predit_yelp_score": 0.05, "actual_yelp_score": 1.0}, {"review_id": "bEX4-iGB2Z68fpj_phSXhw", "user_id": "XDaRp9gaW1KR1tR8f0L26Q", "business_id": "ws-gbVjt56zCQC-CR5pjTQ", "review": [["It's a shame.  Convenient location, but too many stupid errors or lack of training.\nLast week, at the drive-thru, I ordered a croissant with no egg, just ham and cheese.  Driving away, getting on hiway, opened sandwich wrap to find an untoasted english muffin with a micro-thin slice of ham and a light yellow something on the bread (cheese??).  The food had absolutely no taste...just awful.\nYesterday, wanted to use the coupon they give you for a free classic donut with a large drink order...not much of a deal, but that's all they give, soooo...Went thru drive-thru again.  Ordered a large coffee and asked if they would give me an apple fritter instead of classic donut if I paid the extra 39 cents?  Answer was, \"no we can't do that\".  Come on people.  I'm trying to pay you more money, not looking for anything free.  What kind of outfit turns down more profit?"]], "date": "2017-09-23", "time": "22:28:55", "categories": "Coffee & Tea, Bagels, Ice Cream & Frozen Yogurt, Food, Donuts", "city": "Ruskin", "state": "FL", "stars": 2.5, "business_review_count": 29, "predit_yelp_score": 0.9750000000000001, "actual_yelp_score": 2.0}, {"review_id": "j1IkO9uupz_QKuJyY7NkQg", "user_id": "x53b3NGaRFasrcU4Inx0RA", "business_id": "kPy6jsVWuMREMRWRGTvEyw", "review": [["I've been to this location several times and I can't find one thing to complain about. I've never been inside, drive-thru only. Good coffee. Good prices. They even make grilled ham and cheese which I not on the menu but they will make it if you ask. I live closer to this location so I will definitely keep coming back."]], "date": "2016-07-28", "time": "15:05:44", "categories": "Food, Donuts, Coffee & Tea", "city": "Brandon", "state": "FL", "stars": 3.0, "business_review_count": 37, "predit_yelp_score": 1.925, "actual_yelp_score": 5.0}, {"review_id": "HpA4FMmAlMsUDH4RjK35ow", "user_id": "HACzJ9iUiogsPxdal5cTaQ", "business_id": "-R2w_cB1_nA9ZrgvP2PkUw", "review": [["No whip cream for hot coco. No everything bagels. And rude. No more thank you. Service subpar"]], "date": "2014-11-30", "time": "15:19:44", "categories": "Donuts, Coffee & Tea, Bakeries, Food", "city": "Marlton", "state": "NJ", "stars": 3.0, "business_review_count": 13, "predit_yelp_score": 0.9, "actual_yelp_score": 1.0}, {"review_id": "bnEn0YfCyWpi5qEr5ML0zQ", "user_id": "-O6jxFVxZvfNpSnMEC4h3g", "business_id": "NqE7vN3VT_AphP0cIAatYA", "review": [["First rule of customer service, never roll your eyes at a customer. It's dunkin doughnuts, we know what you provide. At least you could feign decent politeness, especially from the manager."]], "date": "2019-05-22", "time": "11:18:33", "categories": "Coffee & Tea, Donuts, Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 53, "predit_yelp_score": 2.7, "actual_yelp_score": 1.0}, {"review_id": "MUi8-9cA32OdBk0TShkx5w", "user_id": "1p8Pu1pvAsuNtuZDtn2OkQ", "business_id": "3m2SS1OSwVNhPXeNf6erSA", "review": [["While I have not had horrible experiences here I'd say that my experiences based on pretty much all the other Dunkin's in the area leads me to wish there were others closer by. I will say they appear to have cleaned up their act substantially from some of the reviews posted a few months back, but the wait times for no reason I can determine vary wildly.\n\nYesterday I went in, there was one person in front of me, I hit the bathroom (clean,) came out and nobody was there. There seemed to be a conference on where a mystery drink was supposed to be directed which took at least two employees.\n\nDrink I ordered had potential, had it been mixed properly. As it stood it was great great great and finished with burnt coffee.\n\nThat said, usually the product is absolutely Dunkin' average, and the people do seem to be nice."]], "date": "2016-11-21", "time": "03:55:11", "categories": "Donuts, Desserts, Bakeries, Food, Coffee & Tea", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 60, "predit_yelp_score": 1.775, "actual_yelp_score": 2.0}, {"review_id": "0fAIkH5amdvdGMX2Fw1apA", "user_id": "GqYK-R87aw0woVtu2pDNQQ", "business_id": "_ozCIOzZtIuAewuMYI_OqQ", "review": [["it would be great if they got my order correct just once. \n\nwhat a bunch of clueless workers. \n\nthey repeat the order back to you and type the sticker wrong so you end up with nothing you want.   \n\nfocus is all about speed - not service or accuracy.  the place needs to close."]], "date": "2022-01-16", "time": "22:05:47", "categories": "Coffee & Tea, Food, Donuts", "city": "Spring Hill", "state": "FL", "stars": 2.0, "business_review_count": 15, "predit_yelp_score": 1.075, "actual_yelp_score": 1.0}, {"review_id": "X7lBCJdgHkQzh_okXAf0tQ", "user_id": "WsGlJbBiNy2X6fj2QH7deg", "business_id": "q-dcHGK0ur8O2F9AI_0Ilg", "review": [["Great location and easy to access. So glad they finally opened up one in this area. It's brand new and the staff are very friendly. The inside is clean and opens a ton of sitting (leather chairs and coffee table, booths, tables, and a high top bar with stools). They also have a drive thru if you are on the go!"]], "date": "2016-04-08", "time": "10:15:19", "categories": "Donuts, Coffee & Tea, Bagels, Food", "city": "Riverview", "state": "FL", "stars": 2.0, "business_review_count": 32, "predit_yelp_score": 2.5, "actual_yelp_score": 5.0}, {"review_id": "6hkIG--CeGnmXScsplc8yw", "user_id": "clUq6gp_lK2w7BOH32YKGg", "business_id": "OhxH_vLWKwSohst8h0G3hA", "review": [["they gave me a donut im allergic to instead of the one i asked for. so. good job guys."]], "date": "2018-09-07", "time": "13:23:08", "categories": "Donuts, Food, Coffee & Tea, Ice Cream & Frozen Yogurt", "city": "Cheltenham", "state": "PA", "stars": 2.5, "business_review_count": 19, "predit_yelp_score": 2.3, "actual_yelp_score": 1.0}, {"review_id": "55Tp5ZoVMMA-L9UadSZTrg", "user_id": "qGaS0uufFI4Jq2hPbPQIXg", "business_id": "adnX5nTg3I_MTrThVkwmQw", "review": [["Not sure if it was just who was working this morning but when I went in I was ignored for a solid 10 minutes. When someone finally asked me if they could help me it was someone who wasn't even checked in, and she went to find someone to help me. I asked if they had any pumpkin drinks and they told me they had pumpkin coffee, I could have hot or cold. I know they have other options but i'm not a regular and they were not displayed inside. Yet nobody could take the time to tell me about them. It was not busy at the time, I was the only customer, so I don't understand why they couldn't. My order was finally slapped down on the counter and then I was promptly ignored again. I'm not a huge Dunkin fan but this turned me off even more."]], "date": "2013-09-27", "time": "17:15:47", "categories": "Restaurants, Food, Donuts, Bakeries, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 76, "predit_yelp_score": 0.95, "actual_yelp_score": 2.0}, {"review_id": "ic-sf9hGfM5U2-cQvlM5zw", "user_id": "BwnrgtsLf3MJn9AWH7HkpA", "business_id": "IcD4lXY6lT8zZPkGD9Flqg", "review": [["By far the worst Dunkin i have ever been to. I am not one to write reviews however this Dunkin has done nothing but frustrate me so I feel it is my only option. They will literally never ever get your order right. I've gone back to this location a few times as it is convenient on my way to work and every single time my order has been incorrect. I will tell the lady taking my order \"Can i get an iced tea with extra sugar and no lemon\" and she will say \"Okay, hot tea with just lemon.\" After I correct them I still get an incorrect order. They don't care or know how to take an order. Their iced coffee is the worst i've ever had from anywhere. If you ever order the snackin bacon or hashbrowns they will be ice cold. Please for the love of god do not even give this place your money. It is HORRIBLE."]], "date": "2021-09-15", "time": "15:47:26", "categories": "Food, Coffee & Tea, Donuts", "city": "Levittown", "state": "PA", "stars": 1.5, "business_review_count": 18, "predit_yelp_score": 0.55, "actual_yelp_score": 1.0}, {"review_id": "TmgeLtR_7wQb-MnO8mDM7w", "user_id": "GG0mFsEXb-02_dzFPqRV1Q", "business_id": "4E3iIAuCGDz7h3D4nJzuHQ", "review": [["A-OK Dunkin'. I feel that their lattes are a little light on the espresso, but other than that you get what you expect.\n\nIt'd be better if there was a drive-thru."]], "date": "2019-04-19", "time": "13:20:18", "categories": "Donuts, Food, Coffee & Tea, Restaurants", "city": "Norwood", "state": "PA", "stars": 4.0, "business_review_count": 10, "predit_yelp_score": 4.325000000000001, "actual_yelp_score": 3.0}, {"review_id": "hdSNNc2ywsQT9hcjP3kLxA", "user_id": "EqBtyis4YNNLghfMLBtuBA", "business_id": "5n8bFTaTWsZwb2rgOQsDEg", "review": [["A perfect place for zero stars! My first order, advertised on their boards, they did not have the ingredients to make. My second order they listed as $5 but tried to charge me $7. They informed me that despite their advertisement they had to charge me $7."]], "date": "2016-01-11", "time": "14:47:19", "categories": "Donuts, Coffee & Tea, Food, Ice Cream & Frozen Yogurt", "city": "Old Hickory", "state": "TN", "stars": 1.5, "business_review_count": 29, "predit_yelp_score": 2.45, "actual_yelp_score": 1.0}, {"review_id": "G-rCl2Nvj_m-MQg1513UQQ", "user_id": "_o7NNu2j4XAtrls8M5JJrQ", "business_id": "5Ubo-2HLRnCCo8Pnq-v-cQ", "review": [["I met a beautiful woman there 2 days ago when I walked out of the bathroom and into the line...we talked and ordered our personal favorites then proceeded to a table and sat and ate...we were talking about the awesome service and attractive staff they employ. We exchanged numbers and plan on meeting there or maybe going together at least 3 times a week...I am very happy with the service and the food and now that I met a new honey there I'm especially happy!!"]], "date": "2016-06-26", "time": "01:51:16", "categories": "Bakeries, Donuts, Food, Restaurants, Coffee & Tea", "city": "Wilmington", "state": "DE", "stars": 4.0, "business_review_count": 14, "predit_yelp_score": 2.8249999999999997, "actual_yelp_score": 3.0}, {"review_id": "rQ02QZ6nJBC3lSjQHZeysw", "user_id": "cuoyaNZUpSnZ0ZZ8IIhddQ", "business_id": "GBhdeF0ScyX5HN3gj-NNCA", "review": [["We went to Dunkin' Donuts to pick up the breakfast sandwich with the beyond sausage.  Turns our this location didn't  have them. \n\nWe wanted to get something, so we asked about whether the donuts are vegan. The attendant chuckled and said \"she wouldn't know.\" She directed us to the website even though we were sitting in the drive-through. \n\nWe then asked if the nutritional information was available at the store.  She told us she couldn't help us, we needed to look on the website.\n\nCustomer service was completely lacking."]], "date": "2019-08-17", "time": "22:22:19", "categories": "Donuts, Food, Coffee & Tea, Gas Stations, Automotive", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 21, "predit_yelp_score": 0.3, "actual_yelp_score": 1.0}, {"review_id": "imh5N-8Jt568Qoi9CIPJ6A", "user_id": "YSUxBPsdNYOpHAP_jEI1GQ", "business_id": "xGBHv5kA1Cm4eYyqzxy7Kw", "review": [["Tiny space but you gotta give them props they're danger fast"]], "date": "2010-12-09", "time": "08:36:38", "categories": "Breakfast & Brunch, Donuts, Food, Restaurants, Coffee & Tea", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 34, "predit_yelp_score": 0.025, "actual_yelp_score": 3.0}, {"review_id": "gd5U0en16D4-iOzbvFp4Hw", "user_id": "CTNgUtq4gpIfZtW4ggSlnw", "business_id": "-Wv0KRW7vv77bjOKLrxpXg", "review": [["I was happy that this location was opening in our neighborhood so we wouldn't have to continue to go so far out to make purchases but on the other hand was very disappointed that just about every time I come there, there is no rainbow sherbet ice cream. \nMy family and I have to go to the Riverview location in order to get this flavor on a cone may seem trivial but it's quite a hike when you've gotten it here before and then yet every time I made subsequent visits it just never seems like there's any there in I'll be told that they have the pre-packed version which I don't like. I just wish that the powers that be would pay more attention to the consumers that like certain things I even called there before and spoke with the manager out I'm not sure what her name was and she said she would look into it but I never heard anything else about it."]], "date": "2020-08-21", "time": "19:04:54", "categories": "Donuts, Food, Coffee & Tea", "city": "Lithia", "state": "FL", "stars": 2.5, "business_review_count": 12, "predit_yelp_score": 1.35, "actual_yelp_score": 2.0}, {"review_id": "aAe3lWsKRhH-ZlKJ_4XMmg", "user_id": "NCyLtKdnAxr6GqdgLP_5IA", "business_id": "ZekJUkrI9XqSx6fZ7Izzbw", "review": [["I wish I took a photo before driving through but this location needs new plastics over the drive through menu. Less than half of it is legible from the car because of the scratch and yellow tinted surface. Probably best to look at their menu online before getting there or expect to be asking a lot of questions about what they have."]], "date": "2020-08-09", "time": "15:26:47", "categories": "Donuts, Coffee & Tea, Food", "city": "Dunedin", "state": "FL", "stars": 2.5, "business_review_count": 30, "predit_yelp_score": 2.8000000000000003, "actual_yelp_score": 2.0}, {"review_id": "WzEZOuq1R2rrW2PrZdejfQ", "user_id": "ErakL4nUBfs3QlpiURX73g", "business_id": "45f_mcoZd3tU5VtUbHfr0g", "review": [["Went to get a couple dozen donuts there yesterday after first trying the DD shop closer to my home.\n\nThis location has maybe two donuts left at 2:15 pm in the afternoon.  No munchkins either. Nada. None. Zilch.  \n\nAnd from what the staff said - this is a regular occurrence at this location too!\n\nSeriously, you're a donut shop, with some add-on items - but your business name has the word donuts in it.   \n\nBut don't worry about us or the people we were planning to treat to donuts - we managed - we found another Dunkin Donuts that manages their inventory better.  \n\nGuess what - you might be the second closest DD shop to my home, but you're not going to be my go-to location.  Neither is the closest one, because they don't know how to have donuts in their donut shop either."]], "date": "2015-11-15", "time": "12:58:07", "categories": "Food, Restaurants, Coffee & Tea, Donuts", "city": "West Chester", "state": "PA", "stars": 2.0, "business_review_count": 10, "predit_yelp_score": 2.5, "actual_yelp_score": 1.0}]