[{"review_id": "G1R-wZSTfuKmjECPweBlog", "user_id": "SrwHXDUhVDAOeLUG1Tux5A", "business_id": "fJQHj9Sq1R0a9FO08q8HWw", "review": [["worst fucking service ever. i walked in and was completely ignored. 3 ppl walked in after me and were greeted immediately. i would've never gotten my drink if i hadn't spoken up. i ordered my regular drink and it tasted like shit."]], "date": "2020-05-27", "time": "18:24:40", "categories": "Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 30, "predit_yelp_score": 0.075, "actual_yelp_score": 1.0}, {"review_id": "6kspElQoYsBaFTYDtv0lUw", "user_id": "LojDefMzt-_qhj-9ZjJqUw", "business_id": "uzhiTCvVaK_0fZwa7rWDzw", "review": [["Terrible service by Barista too busy chatting.\nManager was rude!\nThe place was empty and I've been served quicker in extremely busy Starbucks. \nI overheard the barista say 'it's my last day' so hopefully things might improve but I'm hugely surprised by the managers attitude because they are usually so good in Starbucks! \nMy drink was wrong but it wasn't even worth mentioning!!"]], "date": "2016-11-05", "time": "20:48:47", "categories": "Food, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 4.0, "business_review_count": 39, "predit_yelp_score": 1.025, "actual_yelp_score": 1.0}, {"review_id": "eZjowtS53nHe1KBulkQ2sA", "user_id": "n7TlGclA7W8-UwZ0ozng0g", "business_id": "_8bELjUz5tnftBbXAxKyjA", "review": [["Amazing this store is so funny. The workers laugh over everything I say! Come here! Pleaseeeeeeeeeee come here rn the people will love to assist you :)"]], "date": "2021-04-07", "time": "02:43:40", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 3.5, "business_review_count": 34, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "VSgDxCJcEwTXKJK4HaKQHg", "user_id": "xyI9DCVKW91P6RMLdan0KA", "business_id": "MeA_7cfxh9c7wczQHYQKeQ", "review": [["It is never a bad thing when a Starbucks has a drive thru.  \n\nThe service at this particular location is always fast and friendly and my order has never been messed up.  The location of the actual drive thru line seems to be in a bad location but it is functional none the less."]], "date": "2012-11-01", "time": "15:35:16", "categories": "Coffee & Tea, Food", "city": "Edmonton", "state": "AB", "stars": 2.0, "business_review_count": 11, "predit_yelp_score": 3.275, "actual_yelp_score": 4.0}, {"review_id": "XQ_ByAZ4oWCpxLIfYuntfA", "user_id": "ASPYq2tVrSgcnzk75uUOnw", "business_id": "QnVOsBJWKZ6nN79VbV6l2Q", "review": [["The drinks are well made, the staff is very friendly, but they are sooo slow in comparison to other locations."]], "date": "2015-08-26", "time": "04:48:53", "categories": "Coffee & Tea, Food, Restaurants", "city": "Avon", "state": "IN", "stars": 3.0, "business_review_count": 34, "predit_yelp_score": 1.525, "actual_yelp_score": 3.0}, {"review_id": "3p6C5aMSYz_6tH3pL34sdw", "user_id": "KSWnQIn93Aw44NTk4uSPJA", "business_id": "k4WBufHPsiz4HgmT_gwK3g", "review": [["Truly the best Starbucks I have been to. They are always so sweet and understanding in there. You can tell they really care about the community with all of the programs they have going on in store. They give their grounds out for free for those who compost and have a sanitary product donation drive too. The store is always decorated for the season and has a pride flag year round. I love you market street Starbucks!"]], "date": "2021-05-11", "time": "14:17:49", "categories": "Restaurants, Coffee & Tea, Food, Cafes", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 35, "predit_yelp_score": 4.7, "actual_yelp_score": 5.0}, {"review_id": "aj89bCaQ9QuPOfz1zFOIvA", "user_id": "eEW50s64FBaNwdsWiREdKw", "business_id": "DTyeAYLV9YCc4mG5XTorTA", "review": [["Do yourself a favor and download the app and place a mobile order! It seems like they will make everything that's ordered online before those who order in the store. This will save you 15+ min of waiting at all times throughout the day."]], "date": "2017-10-25", "time": "00:03:45", "categories": "Food, Coffee & Tea", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 36, "predit_yelp_score": 4.3, "actual_yelp_score": 3.0}, {"review_id": "dhXyWHexsaakLLo3ABx_7Q", "user_id": "W0Z5KlA7YCfy8NLDbor6aA", "business_id": "elX9a3nvGMSweRaMWgSb0Q", "review": [["My fav coffee. Won't go anywhere else for my cup of joe."]], "date": "2013-04-14", "time": "18:59:12", "categories": "Coffee & Tea, Food", "city": "Santa Barbara", "state": "CA", "stars": 3.5, "business_review_count": 92, "predit_yelp_score": 4.925, "actual_yelp_score": 5.0}, {"review_id": "DOlcqyRAUwuNzbrI85w8qw", "user_id": "pKksEJAIIC2FZpjKe9fhyQ", "business_id": "k7AoT14yuZZ9fFUtGNZ_1A", "review": [["A friendly local Starbucks near the U of A hospital. The location is small, even for a Starbucks. However, they do have an extra seating area outside the store, both on the walkway outside and in the commons of the building area inside. This is essential since its freaking cold in Edmonton and outdoor seating is basically useful only 4 months a year. \n\nThe staff was friendly and the drink order made accurately. I also love the fact my Starbucks card is usable here even though I am from the US."]], "date": "2017-11-22", "time": "19:37:42", "categories": "Food, Coffee & Tea", "city": "Edmonton", "state": "AB", "stars": 4.0, "business_review_count": 8, "predit_yelp_score": 3.875, "actual_yelp_score": 4.0}, {"review_id": "57XvW7l_wiIKG18mmhxT0A", "user_id": "u8FTX0uDbDewm1RctRBrdg", "business_id": "OUvtfVGqDo8ZfD_eDVTALA", "review": [["The  barista did not know how to make a candy cane frappuccino, which is on their main menu.  For the past two times, my card has been declined there and only there,and it's kind of embarrassing, and inconvenient, because I have to charge a coffee to a credit card, when there are funds on my debit card, starbucks just can't read the magnetic strip. The employee was rude when I asked her to run my card again.  Called the bank, and they said there is no reason why my card should decline at starbucks, and this is the only place it does.  I love starbucks, but it's not worth the hassle and inconvenience, so I won't be back."]], "date": "2014-12-13", "time": "19:26:05", "categories": "Food, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 92, "predit_yelp_score": 0.07500000000000001, "actual_yelp_score": 2.0}, {"review_id": "FPieX9zGqBzG9A3ZCp7V7g", "user_id": "X0YpEIL1aURFnlk5HNb59A", "business_id": "U-VlSil0ZxpbfBX6TxKXbw", "review": [["This location went from a 2 star to a 1 star.. If 0 were an option I would have chose that. Today I bought a coffee thru the drive thru. Americano, sugar free vanilla with cream. Tasted completely burnt and sour and normally it's smooth and sweet. The rest of the day I was physically ill and had to stop everything I was doing and go home.. I'm guessing the creamer was spoiled cause they leave everything out, and didn't feel like getting a fresh one for there customers. I'll drive a little farther next time to go to a better location."]], "date": "2016-02-18", "time": "05:30:03", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 46, "predit_yelp_score": 1.875, "actual_yelp_score": 1.0}, {"review_id": "IpDYegfYr8N462KyHSn27g", "user_id": "JAlIqaYwI0Lf2DXtRBHoXQ", "business_id": "37QpeBaevTiz0vC2unFT4g", "review": [["The coffee is good coffee, you know, standard Starbucks coffee. The people there are so nice but they are always SO SHORT. There's no parking and the cars back up in the road to get in because the drive through goes so slow. You get blocked in the parking spots constantly and I have had to wait up to thirty minutes for a coffee I ordered in advance on the app. They REALLY need to move locations and hire more staff!!!"]], "date": "2020-09-20", "time": "15:09:54", "categories": "Food, Coffee & Tea", "city": "St. Charles", "state": "MO", "stars": 2.5, "business_review_count": 92, "predit_yelp_score": 1.6, "actual_yelp_score": 2.0}, {"review_id": "ceAibvz3galDrZYzOq1zZA", "user_id": "yReELA8LnOtOwT-uYDp8bw", "business_id": "Ag_GeZwOrT0nmyhnKQiVBA", "review": [["came in on vacation and they were so speedy with my order, there was a mistake with whether my drink was iced or hot and they fixed it immediately and were extremely accommodating and sweet about it. good music, nice place to sit down and relax! one of my best experiences at a Starbucks!"]], "date": "2019-06-23", "time": "11:50:06", "categories": "Restaurants, Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 3.0, "business_review_count": 46, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "DefxK5hozCzklroSumMFMw", "user_id": "7Ix6TYbphOXFp1RHuNtmRQ", "business_id": "E4hgF2y1DiDdijo7rcOrLA", "review": [["The staff is great here - fast, pleasant and always in a good mood considering the fast pace in the mornings of caffeine deprived customers"]], "date": "2017-07-14", "time": "00:22:09", "categories": "Food, Coffee & Tea", "city": "Lionville", "state": "PA", "stars": 2.5, "business_review_count": 17, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "cjFDDnONNoCMQ6i3gRNyoA", "user_id": "yL1ZRd1s_StvQblPH_g4PQ", "business_id": "VPZY6vzompsA69myzmQDgg", "review": [["I typically am not inclined to write a review for a Starbucks I go into once, but I felt inclined to write one for this location for several reasons. Lots of younger people working and they were exceedingly polite, greeting each customer, not rushing, yet still kept things moving and hustling to get drinks and orders to the lots of waiting customers. I was very impressed with how they worked together to take care of everyone quickly and our drinks were made well. Nice job ladies!"]], "date": "2017-03-30", "time": "14:15:10", "categories": "Bakeries, Food, Coffee & Tea", "city": "New Orleans", "state": "LA", "stars": 2.0, "business_review_count": 7, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "BmWRmKKWRuO9DwQk537aoQ", "user_id": "Nfx0oJyI3wcGdwar5I6IVQ", "business_id": "kKkw3zsIGMQDFQXP-_yYbQ", "review": [["Super friendly crew, the baristas seem like they have fun being there. VERY busy store but communicate with each other well. Although they're always busy no matter what time you go they always makes my drink right, in and out quickly."]], "date": "2016-07-21", "time": "16:05:33", "categories": "Coffee & Tea, Food, Restaurants", "city": "Mt Laurel Twp, NJ", "state": "NJ", "stars": 3.5, "business_review_count": 45, "predit_yelp_score": 3.6999999999999997, "actual_yelp_score": 5.0}, {"review_id": "THf-275Vt_-bUBYU54-O1w", "user_id": "NdX1_MRm4RmOr5JuFQ28pg", "business_id": "H-6Obgfximh5vDpgWGlHlg", "review": [["Would be better if the staff didn't talk bad about their customers when other customers can hear. Overall not a bad experience; staff seemed to enjoy each other's company. But it leaves a bad taste hearing then talk about other clients in a bad way while people waiting for their drinks. It just leaves a bad taste and makes me wonder what they say about me when I leave."]], "date": "2017-05-13", "time": "15:53:46", "categories": "Food, Restaurants, Coffee & Tea", "city": "Montgomeryville", "state": "PA", "stars": 3.0, "business_review_count": 53, "predit_yelp_score": 2.9, "actual_yelp_score": 3.0}, {"review_id": "jAWyG_Qsxq2TE6Qpsmj1bQ", "user_id": "PGqhwyRU8egVkKchI3to7g", "business_id": "SbGlm_zejxo5hec2Kniojg", "review": [["Asked for a granda latte with 2 inch of room. Drink came with maybe a inch. The girl said here is the drink. Not sure what he did? Refused to correct the issue."]], "date": "2017-09-22", "time": "10:27:33", "categories": "Food, Coffee & Tea", "city": "Saint Petersburg", "state": "FL", "stars": 3.0, "business_review_count": 14, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "-PIth8b6PiZeT-ZNkV5ddw", "user_id": "MR9ICv0y__1wNvOwusN3_Q", "business_id": "wVgo5MaohDWNuudZWWwfJg", "review": [["I just bought an ice coffee, it's the Slowest drive thru service with rude attitude!  You can see the ladies work there are joking and laughing doing nothing thru the glasses."]], "date": "2017-03-29", "time": "15:42:09", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.5, "business_review_count": 33, "predit_yelp_score": 0.9, "actual_yelp_score": 2.0}, {"review_id": "upPf3zyuXVTw1IKD4lZyIQ", "user_id": "GGSqyGssajjQhknA3-M_pA", "business_id": "yi1qt3cUK-RojZPXEjVFXQ", "review": [["First of all I love Starbucks. My husband and I were looking for coffee the day we left Reno. We figured any Starbucks is the same. I was disappointed with this location and had to wait over 25 minutes  for two coffees!   The way it was set up it was awkward to say the least. It seemed we had to push chairs out of the way to walk out....the one and only door we had to enter. The workers were friendly enough but it just seem to take forever and was awkward."]], "date": "2016-05-31", "time": "21:36:48", "categories": "Coffee & Tea, Food", "city": "Reno", "state": "NV", "stars": 3.5, "business_review_count": 50, "predit_yelp_score": 1.25, "actual_yelp_score": 3.0}, {"review_id": "m_Nm8zC06wMedoHI6Ag2RQ", "user_id": "q39mVpfBW8GQ57sjyJRwNA", "business_id": "5QmWfGLN0E-cjfUs_Y3CDw", "review": [["Perfect place for a shopping break. There's indoor and outdoor seating. Baristas are always super nice and the overall vibe is so relaxing. I had a Starbucks reward so I got an iced venti vanilla latte and it was the definition of perfection.  \n\nFun fact: Starbucks Coffee could have been called \"Pequods Coffee.\""]], "date": "2019-03-17", "time": "16:37:36", "categories": "Sandwiches, Salad, Food, Coffee & Tea, Restaurants", "city": "Lutz", "state": "FL", "stars": 4.0, "business_review_count": 26, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "CGB5IFzVvakIOlQQfNEYrg", "user_id": "tOS890ZawuvLecvNsGV8QQ", "business_id": "ovC2avD35bouIDnxJfWHGQ", "review": [["This Starbucks has failed me so many times today I asked for iced macchiato splash of heavy cream and they gave me a hot drink. I asked they remake it and they basically gave me a cup of cream that is not consumable. And before I ordered sugar free caramel macchiato to then find out they don't have that option so this past year I have been I unknowingly been drinking sugar! This is so dangerous what if I was diabetic!!!!"]], "date": "2018-08-22", "time": "12:27:11", "categories": "Coffee & Tea, Bakeries, Food", "city": "Clearwater", "state": "FL", "stars": 3.5, "business_review_count": 52, "predit_yelp_score": 0.35, "actual_yelp_score": 1.0}, {"review_id": "XEvtUXwdJHPVzLBc5cGaWg", "user_id": "5dcCYWV0MdlE9iiI-ZVSxA", "business_id": "VA3WTqU9b88Zgck34s-0sg", "review": [["Soooo, this is me being nitpicky, but I found this comical and slightly annoying. Any time I order my specific drink, I have two customizations that are incredibly simple. It gets messed up occasionally because the baristas have a routine when making drinks and I get that. It happens. Normally, I'll let the barista know, they will hand me a new drink, and ask if I want to give the incorrect one to someone else. I always do to pay it forward cuz the drink is still good and who doesn't want a free Starbucks to make their day better. The barista originally asked if that's what I wanted to do and I said sure, she talks to her manager, and is like ummm I think I will just toss that one and takes the incorrect drink. It's not the end of the world, but it's just bad managerial skills. You would rather toss a drink that YOU made incorrectly to what I prefer, instead of letting me gift it to someone else to keep me from getting two? I didn't make the mistake and you just wasted a drink unnecessarily. Only Starbucks I have ever had do this and I won't be back. It was incredibly awkward and a like, really moment lol. I'll stick to my Murfreesboro locations especially after reading the other reviews."]], "date": "2019-09-03", "time": "14:43:16", "categories": "Coffee & Tea, Food", "city": "Smyrna", "state": "TN", "stars": 3.0, "business_review_count": 79, "predit_yelp_score": 0.8, "actual_yelp_score": 2.0}, {"review_id": "NZWKMjz-tNolr_IOgSTeSw", "user_id": "MA5Ff_s5YSAOLSr13QLs9A", "business_id": "WfGXFCu0e0SVr9tZG3-TfQ", "review": [["Extremely poor service. First made one of the drinks wrong that I had ordered. Then we stood and waited for the food to be ready for 15 minutes before I had to ask about it. They apparently forgot. Gave me a plain croissant instead of a chocolate croissant and a bagel with cream cheese, instead of toasted with butter. Starbucks in airports need to work much quicker since most people are trying to get to a flight. Unacceptable."]], "date": "2016-04-25", "time": "14:16:23", "categories": "Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 43, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "KlevpZZzTHTeO1W2QV8jXA", "user_id": "v4vb7goDlQM1mMpc83tzGg", "business_id": "X_T1gP8z1f_sGNX7qV0PJw", "review": [["This Starbucks location inside the Greenwood Target had some very friendly Baristas working yesterday. Through the Target app; Target has been offering 20% off drinks. I took advantage of that discount several times before the coupon expires. They were unfortunately out of my favorite breakfast sandwiches; however that is something I encounter frequently at many Starbucks locations. The Barista made a delicious iced Americano Cold Foam Irish Creme for me and I got one of my favorite treats - a brownie."]], "date": "2020-02-25", "time": "00:48:55", "categories": "Food, Coffee & Tea", "city": "Greenwood", "state": "IN", "stars": 4.5, "business_review_count": 6, "predit_yelp_score": 3.25, "actual_yelp_score": 5.0}, {"review_id": "H5bAyj4--IoMQm867z9zcw", "user_id": "k991RbaPygzLARE3CNpgag", "business_id": "vp_hPIvAcUJ7xjuWxYLZAg", "review": [["I absolutely love this Starbucks location! I come here most Wednesday mornings at 6:30am and the staff is always super positive and welcoming! Not only is the staff friendly, but it's been a great space to meet other people in the area who have made this their neighborhood coffee shop! There is plenty of space and usually an open outlet for a charger! Long live the Caffeinated Siren Queen!"]], "date": "2019-12-03", "time": "16:27:17", "categories": "Fast Food, Restaurants, Food, Coffee & Tea, Sandwiches", "city": "Indianapolis", "state": "IN", "stars": 4.0, "business_review_count": 32, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "xT1F5fJlIce0IfLCZ26xhA", "user_id": "cS61uflmhe8phJV_PT3HAA", "business_id": "eiQ7HEEuzToQue026gutXw", "review": [["If a snail or a child ran a business, this would be it. They should change the name to Starbucks the Experience, because it feels like a Disney ride. Ridiculously understaffed or just terrible group of workers. Rather go to the one in Medford, faster and cleaner too."]], "date": "2021-11-06", "time": "16:21:04", "categories": "Coffee & Tea, Food", "city": "Lumberton", "state": "NJ", "stars": 2.0, "business_review_count": 9, "predit_yelp_score": 2.475, "actual_yelp_score": 1.0}, {"review_id": "lnULDXARFJy8H-mCkpDB2A", "user_id": "3znPmNYYV2CjjsDjFVuytQ", "business_id": "9c1p8TTOG_F55i3yEiVVDQ", "review": [["This location use to be my Go To place for studying. I stopped going there because the baristas conversate amongst each other so loudly about their personal matters (even when the background music is playing). They should remember that Starbucks is a place where a lot of their consumers come to do their work/study. I use to admire the quiet environment they once provided. Their customer service went down immensely. \nNow, my new spot is Kafe TR on Ashton Road for those who want that quiet environment! Please, also train the baristas to be friendly rather than  having rude attitudes and miserable faces. They look like they hate being there."]], "date": "2016-06-02", "time": "04:13:37", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 70, "predit_yelp_score": 1.625, "actual_yelp_score": 1.0}, {"review_id": "Soa2aPJKichUWS16j7TR4Q", "user_id": "dH5621mQHTMNRfJO7-s03Q", "business_id": "dHYGLQkSxp8nFyzydmgeVw", "review": [["Always nice people \nAlways consistent \nCoffee never bitter\nNice option to sit from time to time and get get the day moving forward."]], "date": "2020-02-04", "time": "13:27:51", "categories": "Food, Coffee & Tea", "city": "St. Petersburg", "state": "FL", "stars": 3.0, "business_review_count": 45, "predit_yelp_score": 4.95, "actual_yelp_score": 4.0}, {"review_id": "slvnSHY72UWlAN4miT8vzw", "user_id": "i6yU6keDqiWAiQGQ3kmyDQ", "business_id": "aWQ2ObC8LoMCpl4w33mokg", "review": [["Horrible Service. Unorganized. Slow. No sense of urgency whatsoever. I counted 4 people behind the counter moving slower than molasses. I've been to A LOT of Starbucks coffee houses, and this one is definitely the worst I've ever experienced. I waited approximately 20 minutes after ordering my beverage and STILL they didn't have it ready. I had to ask for a refund because I had to leave. They seemed to be upset that I asked for a refund.. like I was the problem?? Anyway, I've been to this location a few times and always left unhappy either because of the service and/or poorly made drinks. The reason I had continued to go is because the location is convenient, but I can't sacrifice my time anymore for lousy service. Get it together people!"]], "date": "2014-12-03", "time": "03:49:41", "categories": "Food, Coffee & Tea", "city": "East Norriton", "state": "PA", "stars": 3.0, "business_review_count": 32, "predit_yelp_score": 0.125, "actual_yelp_score": 1.0}, {"review_id": "OpRurA4yI3MbuFnehfkylQ", "user_id": "jCw99WybEwOnuZM4xBUKQg", "business_id": "eQdB1ZjnNspjE7KTFzblzA", "review": [["The space is a bit crowded, but the coffee is standard Starbucks. The pickup area is ineffective for the space, but it is something the atore has to work with. The service was efficient, and even though the lineup was off-putting, I was not dissatisfied with the time it took to get my drink."]], "date": "2017-10-22", "time": "17:04:38", "categories": "Coffee & Tea, Food", "city": "Edmonton", "state": "AB", "stars": 3.0, "business_review_count": 11, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "sIu0hARa-fH-gOQh9fUivg", "user_id": "KXpfG9zNuE3233_Ym_ArUQ", "business_id": "lcJc6yH1uqwMOBNO6ux5UA", "review": [["Outside of the 15 minute wait for an iced vanilla latte and growing, the ambiance of this Starbucks provides serenity when patience is necessary.\n\nThe staff that is here has changed and in between them explaining how bad their schedules were made; found it possible to make a couple of drinks. \n\nHowever, aside from the collegial disgruntlement of a staff the patrons go about their work with absolute mindfulness. The cozy fireplace and modern decor invite you to sit down, plug into a book and forget about the bustle of the day.\n\nMeanwhile....I'm still waiting on my latte."]], "date": "2016-10-25", "time": "14:29:08", "categories": "Coffee & Tea, Food", "city": "Indianapolis", "state": "IN", "stars": 4.0, "business_review_count": 40, "predit_yelp_score": 0.0, "actual_yelp_score": 4.0}, {"review_id": "vlFWDya97DUPFUckhba7dg", "user_id": "arthZv-n4k1KkXtsZOSwmg", "business_id": "2f1ZnZg7730yChhV24ARJw", "review": [["I always enjoy my drinks from Starbucks (bring back Valencia Orange Refresher).  A pet peeve of mine is when someone does not say thank you or you're welcome. When placing orders at the drive up, it would be pleasing to hear them say thank you.   They say thank you at the window,but it should also be said when you place your order. Why not?  It is what starts your day.  Gratitude is so important!"]], "date": "2015-10-17", "time": "13:05:22", "categories": "Coffee & Tea, Food", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 44, "predit_yelp_score": 4.875, "actual_yelp_score": 4.0}, {"review_id": "m-GnCI964ZK7VSTttGtwIQ", "user_id": "L1L7VRtUaY8jAJWUWIwyhw", "business_id": "JngvCO_EWSG5r3Mcy_5_9A", "review": [["Worst starbucks I've been to. Lost my drink order, then proceeded to blame me. Waited 25 minutes fir my drink. Never received an apology. And was late to class."]], "date": "2016-09-19", "time": "14:00:08", "categories": "Restaurants, Food, Coffee & Tea", "city": "University City", "state": "MO", "stars": 3.0, "business_review_count": 24, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "FGQCRP3CpDnJMzIAlCXu1w", "user_id": "LnFIWZM_l__4t8Qxj3pnOg", "business_id": "yjXSQDwuI49poc3MA7AGdw", "review": [["I usually love this star bucks, but this time the older women making my drinks was rude."]], "date": "2013-12-13", "time": "14:03:06", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 39, "predit_yelp_score": 0.05, "actual_yelp_score": 2.0}, {"review_id": "J25VbRjbEfXwqarLXkty6Q", "user_id": "aW6PC6FlwHyCXnejwpLClQ", "business_id": "KD20H4BiOqSaw-0n5LsV1A", "review": [["i had to take place my order to pick up at this location because the one on citrus was out of most ingredients today. i ordered about 12 drinks. if i was at work and someone ordered 12 drinks... i'd probably hate my fucking life, too. told the girl im picking my mobile order up and they had my drinks in one corner and i stood there waiting for them to give me my drinks. some point, i asked her can i bring some drinks to my car and come back to get the rest. dont really know what happened but i ended up reaching over to get my drinks and put them in cup holders!! :-) i kindly asked her if the girl wouldnt mind pushing my drinks towards me because i couldnt reach that far. i didnt want to keep bothering her either. im just going to stick with the one on citrus."]], "date": "2021-05-07", "time": "05:38:06", "categories": "Food, Coffee & Tea", "city": "River Ridge", "state": "LA", "stars": 3.5, "business_review_count": 21, "predit_yelp_score": 1.325, "actual_yelp_score": 3.0}, {"review_id": "jB4qzrLXVwXuj2N1hJFBFg", "user_id": "abGSYrs1tIy8U9fvN11sDw", "business_id": "ocvQV-47kkkG19z8tmedpw", "review": [["Not very busy compared to most Starbucks. Kind of slow for the lack of business. Close to our hotel so that was nice"]], "date": "2020-07-25", "time": "14:36:37", "categories": "Food, Coffee & Tea", "city": "Mt. Juliet", "state": "TN", "stars": 2.5, "business_review_count": 28, "predit_yelp_score": 2.175, "actual_yelp_score": 3.0}, {"review_id": "H1pqo8VporaY-PSF9gY87Q", "user_id": "PcMLFU1XQkAdLkWIA_ZMSw", "business_id": "dXmx686sTWcyTHB0vXm5JA", "review": [["Hands down worst Starbucks that I've been to. Getting a drink here usually takes about 30 minutes. Not worth it. I only stop here if it's my LAST resort for caffeine. The lines are outrageous and there's just not enough people working registers and not enough people making drinks. For a week straight I couldn't get any drink that I wanted because they ran out of cold brew each day which was insanely annoying considering I'd already waited in their huge line. A complete waste of my time. They could at least put up a sign when they are out of something so that we have the option to go elsewhere. Honestly do not go to this Starbucks unless it's completely dead."]], "date": "2018-11-09", "time": "05:18:23", "categories": "Food, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 2.0, "business_review_count": 9, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "mBz-v9hXQHIfAM0c26OrMQ", "user_id": "Q-H4m-8R24VZSS_svjlG4Q", "business_id": "HlaqPcOkOb7AjLpYU5fsoA", "review": [["My favorite Starbucks. They never forget my order. They make it with smiles on their faces"]], "date": "2016-08-11", "time": "04:43:11", "categories": "Coffee & Tea, Food", "city": "Sahuarita", "state": "AZ", "stars": 5.0, "business_review_count": 10, "predit_yelp_score": 4.475, "actual_yelp_score": 5.0}, {"review_id": "gaOeH-LyHC0CbyY8B_chfw", "user_id": "EP-T2LLB5dLDtMpzHSWQ7g", "business_id": "9c1p8TTOG_F55i3yEiVVDQ", "review": [["Worst experience I ever had at any coffee shop ever. I waited in the drive thru for over an hour. It seemed like they forgot about the drive thru line because I kept watching people pull in the parking lot go in and order pay wait and get there order. When I finally got to the window the employees were rude and disinterested in helping me. When I finally got my coffee the order was wrong. I will never go to this Starbucks again. STAY AWAY UNLESS YOU WANT HORRIBLE SERVICE, RUDE EMPLOYEES, AND AN INCORRECT ORDER."]], "date": "2017-04-25", "time": "03:43:13", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 70, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "qRDM1Gklq-TPFnA-mnEpYQ", "user_id": "GLEN2i1n7FsDlpaAgXgRoA", "business_id": "ZDNPWWMny8RzZ9Wg27aMFQ", "review": [["Your typical Starbucks located within another organization - small and without a lot of the extras. For example, no breakfast sandwiches :( Or any hot food what-so-ever. But staff was friendly."]], "date": "2013-04-21", "time": "01:16:38", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 2.0, "business_review_count": 79, "predit_yelp_score": 5.0, "actual_yelp_score": 3.0}, {"review_id": "D40J0_OLC17ZucxkwkpnPg", "user_id": "pJZzkkrgs_rjIAmOWM20XQ", "business_id": "5qVG7T82jRnKGR9O7_0cFw", "review": [["Sarah was great.. The guy that made my 3 caramel frap didn't bother letting me know that my coffee was ready. He went on to serve someone else. While the other ppl had to cross over my 3 drinks...."]], "date": "2019-03-14", "time": "17:57:03", "categories": "Coffee & Tea, Food, Restaurants, Breakfast & Brunch, Cafes", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 130, "predit_yelp_score": 4.375, "actual_yelp_score": 1.0}, {"review_id": "wzhzmdkGRmAI7TKE96J2aQ", "user_id": "GgJr5L5rUQa9cvprTikdTg", "business_id": "xBFNCseDehGAf5D--HWG5w", "review": [["Do not bother to come to this Starbucks (Elcon Mall) in the evenings! It says they are open till 10:30, so you come in, order your coffee at 9:45, then you get kicked out at 9:55 because the lobby closes at 10. So you transfer to the outside table, get comfortable only to be kicked out again at 10:05 because they have to lock the chairs! And if you do not like it, talk to a manager who is nowhere near!\n\nI have been out of Tucson for a while and this used to be MY Starbucks. It used to be a customer friendly place where the crew did not have to defend their actions by shifting responsibility to some distant managers. \n\nIt's OK if Starbuck's new preferred way of dealing with customers is through a faceless drive thru. But why not kindly spell that out on the Google search hours-of-operation page? So that those of us who prefer getting a personal touch with our $5-coffee-flavored-water would know it's an unfriendly place to stop by during an evening walk."]], "date": "2017-12-02", "time": "06:06:59", "categories": "Cafes, Restaurants, Food, Coffee & Tea", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 10, "predit_yelp_score": 1.4000000000000001, "actual_yelp_score": 1.0}, {"review_id": "JPL6w0I6lj3Jwz1yY9UJpA", "user_id": "esMNMMH7BKkiJd91fvO-FA", "business_id": "zXCB28oFHB3SFNPKIDpdfw", "review": [["great customer service by the lovely lady with glasses."]], "date": "2012-02-10", "time": "03:06:43", "categories": "Food, Coffee & Tea", "city": "St. Louis", "state": "MO", "stars": 3.5, "business_review_count": 22, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "HsK6By9n4l5v0Gp0FEYjHw", "user_id": "VRSpx_5mCoUNdggVyybl2Q", "business_id": "vtJzY7yw636iiEH5tz3B-g", "review": [["Great place to get work done! My new obsession is the mango tea lemonade!! \n\nLove the feature to order ahead and have it waiting for you!!!"]], "date": "2016-09-01", "time": "20:21:40", "categories": "Coffee & Tea, Food", "city": "Carmel", "state": "IN", "stars": 3.5, "business_review_count": 21, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "VpTgG4gQyjWICWs9Bxzt4w", "user_id": "Zn8tgekH0oCfyk4SUtygoA", "business_id": "6fqL0jlPqhj0j_--hF3HWg", "review": [["This Starbucks has one key feature that puts it on my regular itinerary. It's near where I sleep and therefore can provide an early morning double espresso when I'm too lazy to crank out some coffee on my own. \n\nHonestly, I've been to so many Starbucks that I can't really tell them apart anymore. Why is there not a Yelp badge for this amazing accomplishment Hello!? Yelp! I want a badge now. \n\nOk. Maybe this is the caffeine talking."]], "date": "2014-04-03", "time": "12:51:24", "categories": "Food, Coffee & Tea", "city": "Clearwater", "state": "FL", "stars": 3.5, "business_review_count": 32, "predit_yelp_score": 2.575, "actual_yelp_score": 4.0}, {"review_id": "6y7ff5nehNWNRUpMHf_6CA", "user_id": "mIcrYXYGyf_4vZSj87BMzA", "business_id": "yBrK-DwpdbJY2F795ZStcw", "review": [["Super awesome staff! They are very fast and welcoming. This is the only starbucks I will go to...the others don't even compare."]], "date": "2015-03-05", "time": "23:38:09", "categories": "Food, Restaurants, Coffee & Tea", "city": "Sparks", "state": "NV", "stars": 3.0, "business_review_count": 55, "predit_yelp_score": 4.450000000000001, "actual_yelp_score": 5.0}, {"review_id": "0NyZjohqSNa3brgb5DLh3g", "user_id": "MWODim3pDmpNSX4c28tyYQ", "business_id": "wWoX5l58K8YTokEWRcFstw", "review": [["Love this location! Always great service, friendly,fast, always get my order right, and drive through is the biggest plus."]], "date": "2013-10-07", "time": "12:58:48", "categories": "Food, Coffee & Tea", "city": "Wesley Chapel", "state": "FL", "stars": 3.5, "business_review_count": 57, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "Bp59hWk_V5BTf7ezdaJ6FA", "user_id": "llYaY5W1-xdvijb59Hi86g", "business_id": "aJvxWyQIG5OLfBw3qAe8xA", "review": [["Great customer service. The drinks are always good. I'm Usually in an out the drive thru pretty fast besides during the peek hours. Will definitely go here again."]], "date": "2014-09-05", "time": "21:39:14", "categories": "Restaurants, Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 65, "predit_yelp_score": 4.65, "actual_yelp_score": 5.0}, {"review_id": "H3jivvvugp0O6aPx4Ww8RQ", "user_id": "P7u-LT6RFnABIWLt8CrU8Q", "business_id": "B6k9V9q3BaSCjWtDyNipfA", "review": [["First off, the advertising in the store is horrible. There was a display of breakfast sandwiches that were labeled collectively as \"breakfast sandwiches\". No further descriptions for each sand which. So if you wanted a specific sandwich you saw, you had no idea what to tell the cashier. \n\nWhen I told the cashier I wanted a breakfast sandwich she frustratedly asked, \"which one?\". Well maybe if you labeled them I would know which one I wanted. She also failed to inform me of the options which in turn led to me canceling the whole order. \n\nHorrible customer service. \n\nThe way the line formed was ridiculous. Find another Starbucks location. You won't regret it."]], "date": "2015-02-14", "time": "15:22:24", "categories": "Coffee & Tea, Food", "city": "Bala Cynwyd", "state": "PA", "stars": 3.5, "business_review_count": 36, "predit_yelp_score": 0.675, "actual_yelp_score": 1.0}, {"review_id": "T_KQUeK7u478ANswonKKIQ", "user_id": "0gjhJz1pS47DfOmvL_9Ixw", "business_id": "8zBmf2sXiiCl1EuztLWNhQ", "review": [["Nice staff, lots of outside seating on the sidewalk, and inside. I live close, but I am happy to have a neighborhood Sbux. Would be better if it had a drive thru, but it isn't set up that way, so I forgive them!"]], "date": "2015-10-28", "time": "18:29:21", "categories": "Food, Coffee & Tea", "city": "Clearwater", "state": "FL", "stars": 3.5, "business_review_count": 42, "predit_yelp_score": 3.8249999999999997, "actual_yelp_score": 4.0}, {"review_id": "XAmzqqOFmNI6zutl5Ndnew", "user_id": "MWAtqevcMUofGnxL8aZCHQ", "business_id": "88r-82tHoOm52PSt6dXy0g", "review": [["Avoid at all costs!  We stopped in for a simple drink and it's now thirty minutes later and we still don't have it.  Plus the bathrooms are worse than any gas station I've seen recently."]], "date": "2016-07-23", "time": "21:52:35", "categories": "Food, Coffee & Tea", "city": "O'Fallon", "state": "IL", "stars": 2.5, "business_review_count": 117, "predit_yelp_score": 0.55, "actual_yelp_score": 1.0}, {"review_id": "VNwFn0N9jUH_jgGaqOORsA", "user_id": "zI5kbYGydcnRSj2K-ZVHkQ", "business_id": "soaZ7_oU7xcphlw6gpWblg", "review": [["This is the perfect location for an SBCC student like myself to study, socialize, and grab a drink. The service is always great, very friendly staff. Also, try the Very Berty Hibiscus Refresher if you haven't already. I'm not sure why there's so many bad reviews, so don't give up on this location. It's really great."]], "date": "2012-07-25", "time": "18:48:23", "categories": "Food, Restaurants, Coffee & Tea", "city": "Santa Barbara", "state": "CA", "stars": 3.0, "business_review_count": 47, "predit_yelp_score": 3.75, "actual_yelp_score": 5.0}, {"review_id": "rct-M6tfvuGVXbzy4lIpTw", "user_id": "rLPMxUDKMkvpJay3qvhRdA", "business_id": "qnTszlGgzUBu44tdQR7QgQ", "review": [["I don't know how the barrista's are supposed to be trained, but the one I had this morning clearly needs more training. I know this isn't Europe, where they actually know how to serve a pastry, but the service was ridiculous. I walked in, put my computer and book bag down, and went to order my food. I ordered a chocolate croissant and bought a bottle of water. The girl just threw it in a paper bag and stuck a label on it. Is that how Starbucks is training their people? Pastries of any kind are supposed to be served warm and on a plate. I know, very difficult. We Americans and our high standards. Such snobs we are, expecting a pastry to be warmed up and put on a plate as opposed to being thrown in a bag. Making coffee and pastries is so hard these days! If I wanted a hard piece of chocolate, frozen between the layers of a piece of bread, I could do that at home. Even at home I'd at least get a plate"]], "date": "2014-05-25", "time": "20:50:41", "categories": "Coffee & Tea, Restaurants, Food", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 57, "predit_yelp_score": 0.4, "actual_yelp_score": 1.0}, {"review_id": "NGNFapmMnzGdl8BSd_Ky-Q", "user_id": "DjpwD4hl0VzlkENOjY_TSw", "business_id": "CV2NybLmtkyegVvoZ-Ncgw", "review": [["Hey Starbucks-\n\nWhen someone comes in with their four year old and asks about the dragon drinks caffeine content- you should probably give a better answer than \"barely any\". \n\nYou guys served my toddler 45mg if caffeine today and I had NO idea. This could be incredibly dangerous. All dietary questions should be treated with seriousness. \n\nI won't be going back to this location. And maybe Starbucks at all."]], "date": "2019-12-04", "time": "02:03:51", "categories": "Food, Coffee & Tea", "city": "Vail", "state": "AZ", "stars": 3.5, "business_review_count": 6, "predit_yelp_score": 0.44999999999999996, "actual_yelp_score": 2.0}, {"review_id": "RJvezOgv9_ZIP5PmahtAqA", "user_id": "RCn5yQhyfxiy_AMn_VWzDg", "business_id": "EM1P1u4ihl1Ritzm-P14iQ", "review": [["Love this SB location. My favorite part is seeing my baristas and getting my happy greetings from them! Love Michelle, Nick, Brady, Hailey and several others. I hate that I can't recall all their names. My drinks are always made quickly and accurately!!"]], "date": "2018-07-26", "time": "05:05:47", "categories": "Coffee & Tea, Food", "city": "Sparks", "state": "NV", "stars": 4.0, "business_review_count": 49, "predit_yelp_score": 3.95, "actual_yelp_score": 5.0}, {"review_id": "Afd2Ni7A0xWBmIJBU5UKDg", "user_id": "sLQWRwuxGAULf5D5z1qPaw", "business_id": "QDIayj7bwqoH-rrBfbBZBA", "review": [["St. Louis, MO Airport\n\nGood coffee as usual. Workers need to drink coffee to wake the HECK up!!! Customer service sucks. My \"warmed bread\" is cold. \n\nBad attitude from the servers..."]], "date": "2014-10-26", "time": "11:00:27", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 2.0, "business_review_count": 66, "predit_yelp_score": 2.3, "actual_yelp_score": 3.0}, {"review_id": "Zo1Aszxa3sENwOVNanvYOQ", "user_id": "WwulXySQN8t2hwqH_yWurA", "business_id": "2sGHOKjHl5S0iqRDTmNgMQ", "review": [["Located in a small brick house off of 116th Street, this Starbucks frequently has a long line of car going through the drive-through. The inside is surprisingly large and full of great work spaces. There's a big bar against the windows, but community table, and a few smaller tables. Service seems to go super fast inside (fewer people opt to actually go inside when there's a drive-through). $3.75 for a cup of water and egg, sausage breakfast sandwich is pretty dang good."]], "date": "2019-02-14", "time": "21:10:34", "categories": "Food, Restaurants, Coffee & Tea", "city": "Fishers", "state": "IN", "stars": 3.0, "business_review_count": 32, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "cHVOCuApSsfWvJZAf8z5IQ", "user_id": "C2iFhJOLjUPZwAnv4te8Kg", "business_id": "hNH1ILskk1qu7TA0rBvvlw", "review": [["I'm generally ambivalent about Starbucks, but this location is worth patronizing.  The staff here seems very close and they are always friendly with customers.  The only thing I don't like is the shop's temperature.  In the summer, the air conditioning is on full-blast all of the time.  I'm not sure what they have the temperature set at, but it can't be higher than 65 degrees.  It's not a problem if you're trying to stop for a quick drink and get out the heat, but if you're planning to do work here, you should bring a sweatshirt."]], "date": "2011-07-22", "time": "16:49:12", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 2.5, "business_review_count": 50, "predit_yelp_score": 4.675, "actual_yelp_score": 4.0}, {"review_id": "8a-0pOBcZfYzFQkGB70bzg", "user_id": "eCl5_6mKC54Mjk392xUgWQ", "business_id": "0wOp7FA8vyUOEgqWRcfEeg", "review": [["Thanks to the kind gentleman at the drive-thru today!  He made my day and the best way to start my birthday count down off! 3 days away! The service was fast, friendly and great!!!"]], "date": "2021-01-08", "time": "20:57:00", "categories": "Coffee & Tea, Food", "city": "Temple Terrace", "state": "FL", "stars": 4.0, "business_review_count": 10, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "V4luuVKpT6AiEtfM5Lqvtw", "user_id": "Tzql1xnrk8BLS3-h7-eYTQ", "business_id": "JyYT5phFLg3BESNL-WXf4Q", "review": [["Friendly, efficient staff but what an ugly building!  It looks like a bank from the 60's on the outside.  Inside I found it cramped and cluttered, with people bumping into each other constantly due to a poor layout.  The line to order stands in between the door and the line to pick up your coffee.. so you go in, order.. wait for your coffee and then have to fight your way back out through the ordering line to exit.  Oddly shaped room too, like a long hallway."]], "date": "2011-11-18", "time": "00:09:59", "categories": "Restaurants, Food, Coffee & Tea", "city": "Creve Coeur", "state": "MO", "stars": 3.0, "business_review_count": 68, "predit_yelp_score": 1.375, "actual_yelp_score": 3.0}, {"review_id": "b5_CvigMpEPXmt6GyMhoog", "user_id": "b4M2xTA_mPpjsSNcVL8BQQ", "business_id": "sA-jrCH-R5741DQ3LWi9Mw", "review": [["Best service I ever had!!! Manager on duty was more than helpful and she was on point!!! I just think that they get such bad reviews is because people are so miserable that they need to be rude and non understanding toward the fact that a lot goes into keep things clean 24/7 not to mention that they are always so busy which to me means that there are way more satisfied customers than the rude miserable people that post bad reviews!!! Keep up the great work!!!"]], "date": "2019-06-21", "time": "12:08:07", "categories": "Cafes, Restaurants, Coffee & Tea, Food", "city": "Levittown", "state": "PA", "stars": 3.0, "business_review_count": 32, "predit_yelp_score": 3.75, "actual_yelp_score": 5.0}, {"review_id": "80hvBoBHhjNpNqo8OOpi7A", "user_id": "pvxEgoN3H5v18JzGsR_v8Q", "business_id": "B5YzH2QTnHThzrHPt-qHow", "review": [["Great Place for a morning breakfast and a nice cup of coffee. Love the location and the vintage ambience. It feels like an old coffee shop in a little town. Baristas are friendly and nice. The only sad thing about this place is that it now closes at 9:00pm. I hope they change that soon."]], "date": "2018-02-07", "time": "05:12:06", "categories": "Food, Coffee & Tea", "city": "Riverview", "state": "FL", "stars": 3.5, "business_review_count": 54, "predit_yelp_score": 3.825, "actual_yelp_score": 5.0}, {"review_id": "qdeWgjQO2iyhHc78NJPQEg", "user_id": "g4--mbRTrBBZHX1uk-6knA", "business_id": "1N58_B4IsWcj19QZyJdzag", "review": [["Very fast paced but the staff was very friendly and got my order right. This Starbucks is located inside a hotel and it's owned by the hotel, meaning that you can use your Starbucks card to pay, but you can't redeem the stars for a free drink or beverage. Only issue I have is that I wish this location could have mobile order. Sucks that I have to wait in a long line just for an oatmeal order. Loved how clean it is and inviting it is."]], "date": "2018-06-16", "time": "15:44:22", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 2.5, "business_review_count": 24, "predit_yelp_score": 3.35, "actual_yelp_score": 4.0}, {"review_id": "40U8ctVnDIyZJysFoH3i_g", "user_id": "m1u45eg9M3cRR9X_mpWGFA", "business_id": "aJvxWyQIG5OLfBw3qAe8xA", "review": [["I like Starbucks because of the consistency between stores all over the country. This one is close to my house and the drive thru is always fairly quick! I get the Strawberry Açaí refresher with lemonade instead of water  with a chocolate croissant!! Yum!! The guy working the drive thru this morning was super friendly and upbeat, which really gave a great start to my day!"]], "date": "2018-11-07", "time": "20:10:42", "categories": "Restaurants, Coffee & Tea, Food", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 65, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "NhmImK5rcFhhav_1jsL7HQ", "user_id": "wOatyameNWKKqjqj8WqyMA", "business_id": "L_4GDsQT0UXSMxDKdB7rQg", "review": [["This new location is small and does not have a large area inside of the strip mall, but a table is usually available. The store staff are always friendly and personable and consistently get my orders correct, and the inside of this store is kept extremely clean. \n\nThis location is clearly run well."]], "date": "2015-12-02", "time": "14:26:56", "categories": "Coffee & Tea, Food, Bakeries", "city": "Voorhees", "state": "NJ", "stars": 4.0, "business_review_count": 10, "predit_yelp_score": 4.825, "actual_yelp_score": 5.0}, {"review_id": "AexAqus8p4leEFZY8De7Sg", "user_id": "s_GIuqASoJfJPsj3lBow7w", "business_id": "crDmS2Hux1Rwgylo6S022Q", "review": [["My drinks never taste as good as at other locations. I don't know why this one keeps falling short. The staff isn't as friendly or courteous, either. I've never gotten a \"hi\" or even \"have a nice day.\" Even if it's slow, my drink is never well blended. It's more like a Slurpee, with ice chunks and 50% whipped cream. Maybe they're short staffed and need more training? Go elsewhere in the meantime."]], "date": "2021-03-05", "time": "20:47:57", "categories": "Coffee & Tea, Food", "city": "Indianapolis", "state": "IN", "stars": 3.0, "business_review_count": 38, "predit_yelp_score": 0.875, "actual_yelp_score": 1.0}, {"review_id": "LkhL__dp6CBWJ_FjwrQLMA", "user_id": "H9WKmBWmqqS50sQ8Z928pA", "business_id": "mBcvp7NarEQEviJyRiX23Q", "review": [["This store is dirty and gross. Employees are rude and I even saw water leaking from their ceiling onto their coffee machines for hours. Dirty!! Onto their drinks. \n\nAVOID. Go local!!! So many other cheaper and better local coffee places within the same block."]], "date": "2019-02-23", "time": "17:51:05", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 63, "predit_yelp_score": 1.25, "actual_yelp_score": 1.0}, {"review_id": "loI19FYM3yrrVO1S8G1c2A", "user_id": "yyxEa8y4HGij_m7g1wDKWg", "business_id": "A_GAAY2LoP3RS1TIwHzuxA", "review": [["I love Starbucks. So much that I have the gold card and it has already automatically renewed two years ahead. But this location has terrible baristas - the worst I've ever experienced at a Starbucks. On top of that the service is much slower than anywhere else. Because of that to there are really long lines. Also beware: there is never anywhere to sit at this Starbucks location. It's more of a grab and go location."]], "date": "2014-08-09", "time": "18:11:12", "categories": "Coffee & Tea, Food", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 45, "predit_yelp_score": 1.7000000000000002, "actual_yelp_score": 2.0}, {"review_id": "mIWkWgRbgolXaWyqK-usLA", "user_id": "8anfKBC7p10SB6hOvdUeGQ", "business_id": "AN0zjd-9W1vq1AS9UnOWrw", "review": [["I am actually back in St.Louis to participate in a deposition regarding a lawsuit against this particular location.I went to this store a little over a year ago .My business partner Katie and I were shocked when the manager started yelling at a customer,who was African-American.I felt awkward at which time I began to record the incident. The young lady accused a worker of disrespecting and lying on her as well as making an attempt to assassinate her character by accusing her of being banned from another location.The manager literally yelled and scolded the young lady.I cringed from discomfort.A few days later I went to the same location and overheard the same manager telling a customer about the incident.After the protest and murder of George Floyd and me realizing that I was no different then the manager because she decided to yell and behave unprofessional to someone who was African-American after I come to find out after speaking to a friend of mines who's a Politician as well as regular customer there  who actually decided to be a witness in the young lady lawsuit .He told me the lady actually made a complaint that caused a employee she recorded yelling and using profanities in front of children. The boy T.....was fired before he was able to quit.It's not right for white women to use our color to make false allegations against African-Americans  it's also not right  to use the judicial system to call people \"ghetto\" and claim the person threatened physical harm or file restraining orders against someone who spoke up for herself.My friend reached out to me for the video of the manager TABITHA yelling at the lady. I didn't want to get involved in this lawsuit until I found out the manager included officers names in her restraining order that never answered or recieved a call for a disturbance involving the African-American lady.I am sickened at Starbucks staff as a company for their continual abuse of African-American people.The young lady handled it the right way .My friend has worked with the lady and her non profit .At no point should any customer be yelled at then expected to shut up and be quiet or get threatened with having a police report that was never filed and a restraining order filled with racial slurs \"I am from the ghetto I will beat you up.\" I was shocked that Tabitha actually had the courage to include Clayton police names in her restraining order but ,I have turned over my recording of the incident to the young lady's attorneys in Clayton.Noone deseves to have pictures from their surveillance cameras given to an investigator to be shown to other employees at other Starbucks. They clearly wanted her to be intimidated for speaking up .Starbucks BLACK LIVES MATTER AND THAT'S COMING FROM A PROFESSIONAL WHITE WOMAN WHO IS SICK OF THE HATE TRAIN AND SICKENED AFTER BEING CONTACTED BY MY FRIEND AND READING WHAT THE MANAGER WROTE ABOUT A WOMAN OF COLOR WHO RUNS A NON PROFIT,THAT CLEARLY STATES SHE GREW UP POOR BUT GRADUATED FROM A PRESTIGIOUS UNIVERSITY IN ATLANTA .ENOUGH IS ENOUGH .I wouldn't be shocked if the staff go track me down to file  restraining order on me for recording the argument.Nice try ..I will see your staff in civil court to testify along with two former employees who are African-American and claimed Tabitha and Amy bullied them.God bless everyone .All people have a right to speak up.I hope she wins millions"]], "date": "2020-09-02", "time": "18:28:06", "categories": "Restaurants, Cafes, Coffee & Tea, Food", "city": "Clayton", "state": "MO", "stars": 3.5, "business_review_count": 35, "predit_yelp_score": 1.1, "actual_yelp_score": 1.0}, {"review_id": "xrelZKJXnKwOFOCSJHz35g", "user_id": "JOFQLbWOEgjhZvjZ2KiPUQ", "business_id": "YwlhxsSsa5WcrR-_myL9qQ", "review": [["Save your time and energy and drive to Sunset Hills, Crestwood, Rock Hill, or even inside Target. This is always the WORST Starbucks! Not to mention how small is it, with no drive through. Besides that, the service has always been the worst! \nI go there MAYBE 2x a year, because I go next door for my glasses. Otherwise I avoid it at all costs! \nFor instance, spent $6.06 on my Venti Iced vanilla latte with almond milk today (which I get everyday)... he made it COMPLETELY wrong. It was dark, made with iced coffee instead of a latte, and I told him it was wrong and tasted bad. Him AND the manager looked at me crazy. She said we can add more almond milk... so he added more almond milk to it and wouldn't just remake the drink they made wrong in the first place! I just left, because I did t want to cause a scene. I walked there today, because we live close and I still try and avoid this location! Do. Not. Waste. Your. Money. There!"]], "date": "2018-04-27", "time": "16:45:12", "categories": "Food, Coffee & Tea, Restaurants", "city": "Kirkwood", "state": "MO", "stars": 3.5, "business_review_count": 22, "predit_yelp_score": 0.15, "actual_yelp_score": 1.0}, {"review_id": "u0ijCZYtKxXPcO9HaQvPyg", "user_id": "SCYUCnRiaNo932L0flZy5w", "business_id": "ZIfvFrdyT1L9mS-NpGhuMA", "review": [["I've come in two mornings in a row.  Different staff on the different days.  All wandering around behind the counter kind of clueless.  Don't come here unless you have a minimum of 15-20 minutes to stand in line and then wait for your coffee.  Two registers running, but one barista-- you do the math..."]], "date": "2017-02-07", "time": "14:13:14", "categories": "Food, Coffee & Tea, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 79, "predit_yelp_score": 2.225, "actual_yelp_score": 1.0}, {"review_id": "pNjV35sNeN8G_CifrYg98Q", "user_id": "cvA8vHPR0Gs0zsPnyv6JEQ", "business_id": "P3Oy6-nfqP46PmHJXNPLYA", "review": [["This is easily one of my favorite Starbucks. Whenever I order via phone, my drink is always ready with no mistakes. The staff is pleasant and they work quickly.\nAlso, I adore the location since it is near where I  work, and it is always on the cleaner side considering that some many students hang out there. Although the students are well behaved and quite pleasant, I don't think I'll be there working."]], "date": "2019-09-26", "time": "21:50:39", "categories": "Food, Coffee & Tea", "city": "New Orleans", "state": "LA", "stars": 4.0, "business_review_count": 19, "predit_yelp_score": 4.75, "actual_yelp_score": 5.0}, {"review_id": "8e-sUaNdpr6SgOZM41nTUQ", "user_id": "RYU07vycKVKKs2-pjbPsrw", "business_id": "td1ykOOoMhGkW76D0N9dYw", "review": [["What to say - Its a Starbucks with great service.  Usually hang outside after cycling on the weekend - can't beat it.  Baristas are very friendly."]], "date": "2015-04-27", "time": "01:26:39", "categories": "Food, Coffee & Tea, Restaurants", "city": "Tampa", "state": "FL", "stars": 4.5, "business_review_count": 31, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "pY0OTcaYYqPcwbPuPu_ndg", "user_id": "P-0BHlXe0AdwnEmQ7hh9AA", "business_id": "SsB0kJpBhIDK8CrcRWXuYA", "review": [["This is a very nice, friendly Starbucks. It's a little hard to get in and out, due to the layout of the drive through and parking lot.  Every time I've gone there they make my drink perfectly and I'm a bit picky. Brentwood is a very busy road but I've found the service to be prompt even when they're busy, unlike some Starbucks."]], "date": "2018-04-03", "time": "18:47:03", "categories": "Coffee & Tea, Food", "city": "Brentwood", "state": "MO", "stars": 3.0, "business_review_count": 50, "predit_yelp_score": 3.125, "actual_yelp_score": 4.0}, {"review_id": "DIk2YYCDKwJyHz8Wl38r1Q", "user_id": "dIyQLJLF4gaDPiF46pbWLA", "business_id": "saJFbz12EnzanelpD8_xXQ", "review": [["Usually a long wait since it's the only location in the area. Service has always been polite and efficient but make sure they repeat your order back to you. I've received wrong orders a couple of times and unfortunately did not realize until I was down the street."]], "date": "2014-12-17", "time": "14:36:19", "categories": "Food, Coffee & Tea", "city": "Riverview", "state": "FL", "stars": 2.5, "business_review_count": 95, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "AXm1GwyQFOdZV8b1DhomIw", "user_id": "5RtWvfSUS-qDdzHFTdZy-w", "business_id": "_8bELjUz5tnftBbXAxKyjA", "review": [["They take so long in the drive thru and inside, the service is horrible, they give you the wrong items and then their excuse is always they are short staffed. Whoever owns this Starbucks needs to step it up."]], "date": "2018-12-15", "time": "21:39:56", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 3.5, "business_review_count": 34, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "4KOzzasRtdWDbcrifyqX9A", "user_id": "MqY8GTQWWS9fT1o3-ahxTg", "business_id": "2785LQ3MgpXMgQRakACT3g", "review": [["This location is horribly slow and has extremely poor customer service. I waited for 20 minutes for my food order. They had plenty of staff working but they sure were inefficient. They gave me half my order and then looked surprised when I asked where the rest of it was. No reason that this place can't be more more organized and customer centric. They were also out of basic items like napkins and Splenda. Not a great experience to say the least!"]], "date": "2019-06-11", "time": "12:55:13", "categories": "Food, Restaurants, Coffee & Tea", "city": "Brentwood", "state": "TN", "stars": 3.0, "business_review_count": 45, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "HS5sJ01OGUE7-I7tNzvC_w", "user_id": "s1APyHZsvp4H-1izkXExGQ", "business_id": "niV3iDWcxuKFOJr3qWp9pQ", "review": [["Horrible service. They no longer have or try to cater to allergies. Manager tried to refuse me service. Even when I tried to explain I'm ordering for my husband her attitude was horrible and her voice extremely condescending when she responded ' Well, it's probably not safe for you because we have almond milk on everything, it's everywhere. To which I repeated that it was for my husband. If you have almond milk like, every where as you say, maybe you need a health inspector come by and see why you aren't cleaning up your products."]], "date": "2018-11-03", "time": "18:29:21", "categories": "Coffee & Tea, Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 96, "predit_yelp_score": 0.15, "actual_yelp_score": 1.0}, {"review_id": "5KyV8G-8uUTxgDJ58Pw7mg", "user_id": "PD2-xHLp2dG692at1t7X9w", "business_id": "EoXPPhjf617rKvEtJ-gssw", "review": [["When I worked briefly for Starbucks (albeit it was a decade ago) my manager made one worker a shift wear a timer that'd go off every 10 minutes to remind us to do a sweep of the seating area to keep it tidy. That should be instituted here. I have never been in such a filthy Starbucks and won't be spending any time here again soon."]], "date": "2016-07-10", "time": "19:53:54", "categories": "Cafes, Coffee & Tea, Food, Restaurants", "city": "Exton", "state": "PA", "stars": 3.0, "business_review_count": 37, "predit_yelp_score": 0.05, "actual_yelp_score": 2.0}, {"review_id": "z-Xue48hEmB4jKZFUcOs6Q", "user_id": "nQY1qFOScQSc_kb2uS6FBw", "business_id": "0drpRPpYFGURvX_kbdPiCA", "review": [["I live in Pinellas county but come to this area quite often for dinner.  I have had nothing but great  service  here!!!  The staff are really nice. \nI popped in literally before closing on a Sunday night not realizing how late it was and the two young ladies working were super sweet! They cheerfully made my drink and gave me a  piece lemon cake!  They made me feel important and I really appreciate them!!! Thanks for making my night ladies! I will be back!!!"]], "date": "2019-07-22", "time": "03:56:20", "categories": "Food, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 4.0, "business_review_count": 47, "predit_yelp_score": 4.875, "actual_yelp_score": 5.0}, {"review_id": "rTaP6i2ntcTlSd95uFQShA", "user_id": "SDytcPY5fiuuDbTkPE8GyA", "business_id": "w5fyVRnGWXl_ldGt0Hu5uQ", "review": [["They serve coffee flavored water! Don't mess with me I am from NYC and need my caffeine! But they get 2 stars because their bathroom is the cleanest I have seen on the east coast! It seems the further you get away from NYC the cleaner the bathrooms!"]], "date": "2011-06-07", "time": "05:57:16", "categories": "Food, Coffee & Tea", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 26, "predit_yelp_score": 3.4, "actual_yelp_score": 2.0}, {"review_id": "_RNRYKOvc0FjXNafT8ol5Q", "user_id": "0LDZQ3QfQGANJN9is1BVPQ", "business_id": "InI2O9i59galnR563-A9oA", "review": [["There are a number of nice Starbucks in the area, but the entire staff at the newly-remodeled Ridgemoor Starbucks is the best-bar(ista) none!!"]], "date": "2014-10-21", "time": "15:22:36", "categories": "Food, Coffee & Tea, Restaurants", "city": "Palm Harbor", "state": "FL", "stars": 4.0, "business_review_count": 19, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "QF5kq5C16K2zUjbO4mG24w", "user_id": "REFGsoLynoBWxdTEJeXYfw", "business_id": "FmBvwussMAP_hh5psTcHOw", "review": [["It's a typical Starbucks and I always feel like I'm an idiot when I'm trying to order coffee here! I just don't get all the lingo that I suppose coffee aficionados use! Still, staff is friendly but I do find the service to be a bit slow at times. I find their coffee to be a bit on the pricey side and a bit stronger than I usually prefer. I do really like their hot chocolate! Still, this is a clean Starbucks with available indoor and outdoor seating along with a drive-thru. The parking lot is not overly big and during busy times, you just need to be extra careful."]], "date": "2012-11-07", "time": "22:45:37", "categories": "Coffee & Tea, Food", "city": "Royersford", "state": "PA", "stars": 3.0, "business_review_count": 21, "predit_yelp_score": 1.5, "actual_yelp_score": 3.0}, {"review_id": "T-UeQLTZRu7iKCNhgZWSdw", "user_id": "V-w_c3Ud_tIBVMnIAxW3pg", "business_id": "37QpeBaevTiz0vC2unFT4g", "review": [["Extremely slow service. I will be taking my business elsewhere. I'd love to be able to stop here on my way to work, but the wait is disappointingly long."]], "date": "2016-11-21", "time": "13:26:40", "categories": "Food, Coffee & Tea", "city": "St. Charles", "state": "MO", "stars": 2.5, "business_review_count": 92, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "2Ip184QLaFwpEeAn7-YebQ", "user_id": "BnZqFM_iEx3AY2saeNStEg", "business_id": "88r-82tHoOm52PSt6dXy0g", "review": [["This service was absolutely disgusting. We stopped here on a 12 hour car drive and went in to order and the MANAGER was on the phone, watched me wait for 5 minutes while 2/4 other employees were doing INVENTORY while the other two were swamped with 20+ cars in the drive through. THEN the manager told me she had to go take care of a few things before taking my order...... first off. I work in the service industry so if they had been swamped and all employees were genuinely just trying to catch up I would understand but no, instead they have 2 of them doing INVENTORY.... Do not come here unless you wanna waste gas & not get any coffee!!"]], "date": "2021-10-29", "time": "20:29:52", "categories": "Food, Coffee & Tea", "city": "O'Fallon", "state": "IL", "stars": 2.5, "business_review_count": 117, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "BnDjmIVoaYvL5DdhfIDsxQ", "user_id": "wuvwynCzvDxRFnPdJY6Afg", "business_id": "OUvtfVGqDo8ZfD_eDVTALA", "review": [["The gentleman who took my order was very kind and definitely knows good drinks . i ordered a \"Guava ice tea lemonade \" asked for feedback and definitely glad i got it . very sweet and fast service here :)"]], "date": "2020-05-18", "time": "23:06:06", "categories": "Food, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 92, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "V3TKKp1zy0kRziCl2avg3w", "user_id": "QQ_fx8MawSNvPOWJKzlOcg", "business_id": "hSgY_2L02kB-1xRDoJKsng", "review": [["I often stop here on my way to work when in town.  Not going to review the coffee her because Starbucks is a industry leader for obvious reason.   This is all about the staff here.\n\nThe people working here are wonderful.  Always smiling, always happy.  They are often my first interaction of the day with other people and it's always a pleasant one.\n\nThanks for that!"]], "date": "2018-03-07", "time": "16:44:01", "categories": "Coffee & Tea, Food", "city": "Edmonton", "state": "AB", "stars": 3.0, "business_review_count": 10, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "vpYqp4Z3D4V9a396ikZbsQ", "user_id": "cDQG_OGCpu4ATDz6rQSryw", "business_id": "Gn34llSvalq0_RNsZLCsfQ", "review": [["When in the area I visit this location, there is almost always a line fir the drive thru but the cashier is always super warm & inviting. \n\nThe only issue I have noticed with this location is that they seem to sell out if pastries especially cake pops by the afternoon."]], "date": "2017-05-18", "time": "16:47:00", "categories": "Food, Coffee & Tea", "city": "Trevose", "state": "PA", "stars": 2.5, "business_review_count": 59, "predit_yelp_score": 3.875, "actual_yelp_score": 4.0}, {"review_id": "Un-ZHMKkH5pFlZlntavl8w", "user_id": "hNeTousWkLxYbuqiS-u0oQ", "business_id": "mqlriZ2dy-tf9-jtYRdRqw", "review": [["Coffee is always hot and perfectly blended! The line stays long because of it..but it is definitely worth the wait..."]], "date": "2017-02-01", "time": "00:15:31", "categories": "Food, Restaurants, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 48, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 4.0}, {"review_id": "vXNMli3-VtQY19gQrH-1UA", "user_id": "jPffxp-9NSWhoD3GIpMVMQ", "business_id": "G4sLH98DHyejB5RcDljaFQ", "review": [["It's a Starbucks. Everything is overpriced.\n\nFriendly staff and WiFi works as usual. I went at 6am and it had a decent crowd. \n\nWent there because it was open and close by, but nothing special about this Starbucks."]], "date": "2019-03-01", "time": "21:47:54", "categories": "Restaurants, Food, Coffee & Tea", "city": "Nashville", "state": "TN", "stars": 3.5, "business_review_count": 49, "predit_yelp_score": 3.2, "actual_yelp_score": 3.0}, {"review_id": "O4XYRThnucG27Gx0VAkQ7g", "user_id": "r6N8XxrsonNHesJfn3ZNSg", "business_id": "XWbWhTXkyzfhwh4dbfwEAA", "review": [["If it looks like a Starbucks, acts like a Starbucks and tastes like a Starbucks then it's probably a Starbucks.  And this my friends, is a Starbucks.  Not really a whole lot to say if you're familiar with the franchise.  They got my order right, it was clean and I enjoyed my experience.   Work a stop if you need some caffeine."]], "date": "2018-04-20", "time": "00:37:31", "categories": "Coffee & Tea, Food", "city": "Boise", "state": "ID", "stars": 3.5, "business_review_count": 23, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "-H53GfniorpvJldJfpi0Aw", "user_id": "4MNipe--LZ_RcvVmDxjBhA", "business_id": "6_Zf2QsRHCH1RhbzA9inyw", "review": [["Great sbux, always fast service, although, no perfect rating because twice they haven't had my favorite sandwich feta and spinach wrap in stock, otherwise they're great."]], "date": "2014-04-09", "time": "03:33:52", "categories": "Coffee & Tea, Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 56, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "p27AjYFYJ4chQ_BOmHuKyQ", "user_id": "iJhysgL1YxVfBhvstih9rQ", "business_id": "GfKb7u9KLgp6OExvIHf_Cw", "review": [["Learn to sweeten the beverages sufficiently, then MIX them. It's not rocket science. Also, pick up the pace. There shouldn't be a 6-7 car line every time I drive through."]], "date": "2019-01-26", "time": "06:52:05", "categories": "Food, Coffee & Tea", "city": "Burlington", "state": "NJ", "stars": 4.0, "business_review_count": 19, "predit_yelp_score": 2.6, "actual_yelp_score": 1.0}, {"review_id": "OSCxcIJoQXFTkh5y7ai6uQ", "user_id": "mneHy3IryFQJfXmzEv3sMA", "business_id": "vLKZGIQYKaTDxcY5shttWg", "review": [["Very clean and I asked for extra whip and they gave me that. Some Starbucks don't. Everyone is very kind and amazing drinks!"]], "date": "2021-10-16", "time": "21:35:48", "categories": "Coffee & Tea, Food", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 5, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "xjSyDqv66sNLuKOTjkx5wg", "user_id": "8TQ4QWrbS6nKvQAjvQMbug", "business_id": "y6HD7qhOsXt-BTnkuJLUSg", "review": [["It's a beautiful space to enjoy the Riverfront after a movie or ice skating.  The staff thus far have been friendly, helpful and knowledgeable about the products.  So glad we finally have an S'bux in the area!"]], "date": "2015-01-17", "time": "15:58:03", "categories": "Coffee & Tea, Food", "city": "Wilmington", "state": "DE", "stars": 3.0, "business_review_count": 35, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "1ODAHk1BQGNhddWCPIfKog", "user_id": "o3V225S8VLj6nui1rqV00A", "business_id": "kgzgHWoGBznqRODFLy9FaQ", "review": [["I always go there. They always give me free water when other places make a big deal out of it. The customer service is always on point. I recommend you guys to try this location. Thank you!"]], "date": "2019-06-02", "time": "04:57:49", "categories": "Food, Coffee & Tea", "city": "Boise", "state": "ID", "stars": 4.0, "business_review_count": 10, "predit_yelp_score": 4.925, "actual_yelp_score": 5.0}, {"review_id": "_H0wouw_D3x4hEI732vY1g", "user_id": "OLncLo11Ucs14qkSMJpO6g", "business_id": "1N58_B4IsWcj19QZyJdzag", "review": [["Always friendly staff!\nI go every day I'm in the office and bring my own coffee mug and they only charge $1 refills for any house blends. \nThey don't redeem Free Drinks from the a rewards card, but they do earn you stars. 12 days of coffee for $12, earns 12 stars and a free drink at any Starbucks location!\nCan't beat it!"]], "date": "2014-05-09", "time": "12:39:56", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 2.5, "business_review_count": 24, "predit_yelp_score": 4.175, "actual_yelp_score": 5.0}, {"review_id": "uTXCYZ5blhLtYhH7Pgkn_w", "user_id": "E82DZ0ncGA1BQjJh_yz7Zw", "business_id": "me-gE1a7-DRGK9oeuCmbrw", "review": [["Hoooooly crap don't ever come to this Starbucks.  I have been inside for 30 minutes and counting waiting for my drink.  What a sad excuse for a Starbucks!  Corporate should be ashamed"]], "date": "2017-10-21", "time": "16:11:17", "categories": "Food, Coffee & Tea", "city": "Reno", "state": "NV", "stars": 2.5, "business_review_count": 95, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "n_71deoVDPcQGdxKzXoxwg", "user_id": "TaydV42JMxdIdrcv9g6rVQ", "business_id": "saJFbz12EnzanelpD8_xXQ", "review": [["Every time I have gone to this Starbucks I have nothing but great service today DJ took my order he was charismatic funny and just straight up awesome. He even tried to upsell with an extra shot him since he was so nice I almost took it but I don't like my coffee too strong so I turned it down. A couple weeks ago I ordered a tall and got a venti I told them it was wrong and they gave it to me free of charge. Another time I wanted a plain bagel and they ran out and I was able to chose something else that cost most. I feel like these people put the customer first every time."]], "date": "2015-10-29", "time": "13:58:33", "categories": "Food, Coffee & Tea", "city": "Riverview", "state": "FL", "stars": 2.5, "business_review_count": 95, "predit_yelp_score": 2.625, "actual_yelp_score": 5.0}, {"review_id": "LzyquBiwyd9-JKCvuy5F4Q", "user_id": "fIYkj9FX6qxDasCrG8RQZQ", "business_id": "_lCaW3aU3yp-acJ8BnCLyQ", "review": [["Everybody at this place is ridiculously nice. It's not a one time thing I've been going for years every single person is obnoxiously kind. Highly recommended."]], "date": "2019-03-08", "time": "14:11:54", "categories": "Food, Coffee & Tea", "city": "Tampa", "state": "FL", "stars": 3.5, "business_review_count": 83, "predit_yelp_score": 2.475, "actual_yelp_score": 5.0}, {"review_id": "DEXAkz0znSiPy7vgu3FVjA", "user_id": "GqBOj73Wkd3FhoPHKpNr8A", "business_id": "N4xmF_96VDb2bRPpBu_O9w", "review": [["Stopped in for breakfast before work. I got the impossible breakfast sandwich. It was nice and warm but the corners of the bun were hard as if it had been overheated. I didn't get a drink since I was headed to the office where coffee and tea were available. I'd like to see truly vegan options for sandwiches."]], "date": "2021-07-02", "time": "01:06:25", "categories": "Food, Coffee & Tea", "city": "Indianapolis", "state": "IN", "stars": 3.5, "business_review_count": 60, "predit_yelp_score": 1.5, "actual_yelp_score": 4.0}, {"review_id": "Pj_lNjMgJe0AZFbkg_9Ccw", "user_id": "091K7-ql5wNdSbJ1taZBkQ", "business_id": "mBcvp7NarEQEviJyRiX23Q", "review": [["Excellent service on Thanksgiving morning 2020. They had a great crew working and I was blown away how cheery everyone was. I'm thankful they were open being here from out of town With now coffee service at our B&B. The coffees were perfect and so were the impossible breakfast sammys and the Coup de grace chocolate croissants!"]], "date": "2020-11-26", "time": "15:35:46", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 63, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "r0XP5SS5wtUDlzqBpmtDhQ", "user_id": "QAsiyrCpFfo3YRGN1JkM5g", "business_id": "_5k9hs8ae9S9Dj46EZrSAg", "review": [["Starbucks is just OK.   They never make anything sweet enough for me so I always have to get extra flavors but they are coming up on their food menu which is always helpful.  Just wish they weren't so pricey.  Good quick drive thru though."]], "date": "2015-01-30", "time": "17:37:27", "categories": "Coffee & Tea, Food", "city": "Brandon", "state": "FL", "stars": 2.5, "business_review_count": 98, "predit_yelp_score": 4.525, "actual_yelp_score": 4.0}, {"review_id": "RI0K9fWUjv6YS0FX_tvB9w", "user_id": "I1Kn2D6aS__ik2GJnoPLIQ", "business_id": "_L4N2qjUUZWR9BELd4oemg", "review": [["I hate reviewing chains, because the heart of a franchise is consistency. What's the difference between one Starbucks and another? Nothing, if they're doing it right. This one does it right, but the staff is above and beyond. I stop in here whenever I visit IKEA and I'm always greeted warmly. They make conversation, they ask how my day is, they spell my name right = these are good people. This is also a good place to run into Deanna S., but that is probably true of any Starbucks."]], "date": "2013-04-29", "time": "16:08:18", "categories": "Coffee & Tea, Food", "city": "Edmonton", "state": "AB", "stars": 4.0, "business_review_count": 5, "predit_yelp_score": 3.6750000000000003, "actual_yelp_score": 4.0}, {"review_id": "PiIHrAVh8uCYhYRhdjM1yA", "user_id": "FGojSnou5Nt75Inhg1og5w", "business_id": "ZIfvFrdyT1L9mS-NpGhuMA", "review": [["Nice place to have coffee. Very friendly people. Very good environment. I like this place."]], "date": "2011-04-26", "time": "15:43:21", "categories": "Food, Coffee & Tea, Restaurants", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 79, "predit_yelp_score": 5.0, "actual_yelp_score": 4.0}, {"review_id": "RQWjMemhFDoUT3ygMDFpTQ", "user_id": "ULjf8op0QDJqgeXAVLeCFA", "business_id": "VvfvtuVehnBOn6AeQvovZg", "review": [["Iced coffee was old/had a really weird taste. The manager tasted it after I brought mine back and agreed and made me an iced americano instead! So there was a mess up but they were so awesome about it!"]], "date": "2014-12-28", "time": "14:45:44", "categories": "Food, Coffee & Tea", "city": "Plant City", "state": "FL", "stars": 2.5, "business_review_count": 116, "predit_yelp_score": 2.45, "actual_yelp_score": 4.0}, {"review_id": "CFSYeFZIM0tUMEHwi5en3A", "user_id": "g1etLmsmplrSVy_vKX90-w", "business_id": "iFunuVzrg10UesZvMPCHHg", "review": [["I like this particular Starbucks because it is open longer then the Starbucks in the Loop is. I believe they are open till 10pm. The service is a little slow but spot on. The employees are also very friendly. \n\nThere is ample seating inside with plenty of room to study, read, or chit chat. This Starbucks does not have that claustrophobic feeling when walking in unlike some locations. My only true complaint would be parking. Parking spots are very limited and you might have to park in the neighboring business's parking area."]], "date": "2013-01-16", "time": "15:04:49", "categories": "Coffee & Tea, Food", "city": "University City", "state": "MO", "stars": 3.0, "business_review_count": 39, "predit_yelp_score": 2.225, "actual_yelp_score": 4.0}, {"review_id": "mpzxx92kh2n03qmJ36QvLg", "user_id": "uzwDtZsIHhxRp4xxyaF56g", "business_id": "s0VpsfcyxwqvSGvvTPyPiA", "review": [["This new, larger drive thru Starbucks is absolutely disappointing compared to the smaller one right next door that it replaced. I went to the previous smaller location for 10+ years. \n\nThe staff at the new \"improved\" Starbucks are sweet, but highly inexperienced. It's a bit of an issue when you're paying $7 once or twice a day for a beverage and it is not hot enough or not cold enough. They do not understand how to use their $12,000 espresso machine properly. They don't time their shots. They have no sense of how humidity affects the grind/tamp.\n\nI'm not going to harass the 18 year old barista to re-make a drink three times when they clearly haven't received adequate training. I have thrown my drinks away the last two times I went because they were not enjoyable at all. I plan not to go back even though I live and work within a three mile radius of this Starbucks.\n\nI know to some, it may sound like I am being some kind of coffee elitist, but this is not Dunkin' Donuts. Starbucks have built their reputation on making coffee and espresso drinks and they rightfully charge more money for their product. But, if they do not know how to craft and serve their product, there is no point.  Clearly, they aspire to be the Arby's of the coffee world because they do not train their workers on the basic chemistry of building drinks. For this quality of beverage, I find the Dunkin' Donuts much better. The staff there is well trained in what they do. It's quite sad when the Dunkin' Donuts can get their act together, but a Starbuck's can't. Sad."]], "date": "2020-09-01", "time": "23:17:45", "categories": "Coffee & Tea, Food", "city": "Wilmington", "state": "DE", "stars": 2.5, "business_review_count": 32, "predit_yelp_score": 1.1500000000000001, "actual_yelp_score": 1.0}, {"review_id": "gzx6N7prlPk2p6LKuAAr-A", "user_id": "sLgekUp1uedWpnDsztvkVw", "business_id": "6WbDVtlU7vGaFV9zHexFIw", "review": [["Wow... this Starbucks inside of the Target Store has great service! Love the free wifi to share content  while having a pumpkin spice latte! It  is back! \nMs. Alexus is always happy to serve you with a smile! Great experience!"]], "date": "2016-10-19", "time": "01:05:26", "categories": "Food, Restaurants, Coffee & Tea", "city": "Town and Country", "state": "MO", "stars": 4.0, "business_review_count": 24, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "YaHr7_8vOzf12Y1pZKvkcQ", "user_id": "jrM9-dwX5iBgJeHerj_6kg", "business_id": "bMjwZOISK9cnnF8L5jojDA", "review": [["Great Starbucks location. They are always very fast and very friendly. The only thing is is that the parking lot is kind of small and at the busy times it can be hard to get into park. Iced hazelnut latte hits the spot every time!"]], "date": "2017-07-04", "time": "18:44:22", "categories": "Coffee & Tea, Food", "city": "Tampa", "state": "FL", "stars": 3.0, "business_review_count": 62, "predit_yelp_score": 3.35, "actual_yelp_score": 5.0}, {"review_id": "hHRFcdPJ-MwzqkoOplLacw", "user_id": "BxnOwpS4qqj3M3Yixh4QEw", "business_id": "s6nOfGZJpkZ3JplCO9lGiA", "review": [["This is easily my favorite Starbucks in UC and possibly in Philly overall. Used to sit here all day during undergrad to meet up with friends and get hours of reading/studying done. This was always my secret spot during finals, and I even make it a point to visit whenever I'm back in Philly :)\n\nWhat makes it different - it's clean and a good size (not too crowded) and the staff is friendly. I also love the location; good midpoint between Penn and Drexel and close to Wawa, Sangkee, and other food places if you're looking to take a break while studying. There's another Starbucks a block away on Walnut but it's usually more crowded (although the Walnut Starbucks is more convenient for grabbing drinks in between classes). What I like most about this Starbucks is that it has plenty of natural sunlight and gives off more of a small coffeehouse vibe compared to other [more generic] locations.\n\nA couple of considerations - It gets cold during the winter due to all the windows and the lights are pretty dim in the evening."]], "date": "2015-12-29", "time": "01:01:37", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 4.0, "business_review_count": 57, "predit_yelp_score": 4.675000000000001, "actual_yelp_score": 4.0}, {"review_id": "Pzd4tf49RFBygx7N59ko7w", "user_id": "nRBuwri2nzmFHUdOX9xO1Q", "business_id": "yjXSQDwuI49poc3MA7AGdw", "review": [["So friendly!!! I really enjoyed my visit to Starbucks on Walnut; everyone I spoke to was very kind. The lady that took my drink order told me I'm fabulous and the man I picked my drink up from made a fun joke with me :) I will be back next time I'm in Center City!"]], "date": "2018-05-22", "time": "13:18:34", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 39, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "yCMxn7iPP8uw1u0lpguCOA", "user_id": "oV6DCvkwoiJiwA_FWDYaUw", "business_id": "XoS-hu_i2Dr8VxzeMxLwVA", "review": [["The people that work here are nice. They are friendly and smile frequently. But 80% of the time they get my order wrong!!! I do not use the drive thru either. I always walk in. I think that some of them are stressed out from the volume of customers. Relax dudes, it's only coffee!! I don't mind a little wait! I won't return here. Been here a lot and It's not worth it anymore. Pantano/Speedway is a good one as well as Broadway/Craycroft.  Bummer."]], "date": "2015-03-29", "time": "20:34:07", "categories": "Coffee & Tea, Food", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 74, "predit_yelp_score": 2.525, "actual_yelp_score": 1.0}, {"review_id": "oxKcrOmEhKtgO-LCepbgJw", "user_id": "0peBjzNGJjo1xDyFLjCPkw", "business_id": "ue-Me7wcOixhdHNOEQ6j3Q", "review": [["Best starbucks in Reno. The drinks are always made right (and the baristas there make great recommendations for new drinks to try also) and they are really really fast at making the drinks for you. They're pretty nice there too."]], "date": "2014-10-02", "time": "14:56:19", "categories": "Coffee & Tea, Food, Restaurants", "city": "Reno", "state": "NV", "stars": 3.0, "business_review_count": 46, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 5.0}, {"review_id": "nnCUVol9aZz0lDX37eRpjw", "user_id": "yyXjXfTB0pJAV3B7VqPUNw", "business_id": "QDIayj7bwqoH-rrBfbBZBA", "review": [["This is the worst Starbucks I have ever been too. They are insulting and rude. Messed up orders and copped attitudes toward me. I vary rarely complain but the terrible service I got here was amazing!!\nAnd just to be clear.. I love Starbucks coffee and will happily go to the many many other locations they have. \nIt is this one in particular that will NEVER go to again!!"]], "date": "2019-02-08", "time": "19:18:08", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 2.0, "business_review_count": 66, "predit_yelp_score": 1.05, "actual_yelp_score": 1.0}, {"review_id": "L8tbt99w5p2pfSCV7udL8g", "user_id": "1Lbs2Wlve-o3nKiY5tF78g", "business_id": "PeDuQRFosh1DL10ayTVT_A", "review": [["What a pleasant way to start the day! The staff this morning was beyond pleasant. It is honestly the best way to start your morning when someone sings your name as they place your order, smile and say have a great day, AND they spell your name right on the cup! Thanks ladies!"]], "date": "2019-01-11", "time": "12:55:19", "categories": "Restaurants, Food, Coffee & Tea", "city": "Cherry Hill", "state": "NJ", "stars": 2.0, "business_review_count": 44, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "CKPvpFrHwaqlIodlSrO_xw", "user_id": "qKOWuKXqa_16hmLnbntS1A", "business_id": "Ttg0xnJpjDTlVDKC5iBbdA", "review": [["This starbucks has been open throughout the pandemic with altered hours 6am-6pm. When they are open they have a really great dining room and a private room for studying in the back! I've been through the drive thru quite a lot lately and my drinks are always made correctly here. Also everyone here is very friendly despite the times. If this starbucks was closer to me then this would definitely be my go-to!"]], "date": "2020-05-05", "time": "21:19:38", "categories": "Coffee & Tea, Food", "city": "Sicklerville", "state": "NJ", "stars": 3.0, "business_review_count": 41, "predit_yelp_score": 4.95, "actual_yelp_score": 5.0}, {"review_id": "SPl1B7fbfAb96B6384hILA", "user_id": "RQBGeJ1Nwdcpe7n3gZ0GrA", "business_id": "e-uW1RrJGc0XqB5_Q2HKBA", "review": [["WORST. SERVICE. EVER.  Cashier just stood there and didn't even ask to take my order, then the teenage girls making the drinks see me standing there 10+ mins and won't make my drink. then fills the cup with so much ice my straw can't fit."]], "date": "2018-01-19", "time": "19:20:24", "categories": "Food, Coffee & Tea", "city": "Clementon", "state": "NJ", "stars": 3.0, "business_review_count": 32, "predit_yelp_score": 0.2, "actual_yelp_score": 1.0}, {"review_id": "as43492nalKrmzItFf30GQ", "user_id": "xuCIZAexfaBP8mHMKRup9A", "business_id": "RCy4M2ND4YK0uRbodV_v8g", "review": [["Always a line, but the service is great.  I'm there every morning for a to-go coffee and bagel.  How come they never remember my name or order yet they remember all of the other regular customers?  Am I that forgettable?  Regardless, I still stop by hoping that they'll remember my name.  Oh well."]], "date": "2010-10-14", "time": "13:59:43", "categories": "Coffee & Tea, Food", "city": "New Orleans", "state": "LA", "stars": 3.0, "business_review_count": 73, "predit_yelp_score": 5.0, "actual_yelp_score": 3.0}, {"review_id": "_Ka1shFEWDfCIoQY6G2Ung", "user_id": "KwCQ09KekZxm8s9V4vrH0g", "business_id": "9_uigKs9GCwg9dFKkq_Kfg", "review": [["Unbelievable! Another establishment that serves food allowing an animal to hang out. The employees saw the dog and didn't do anything about it."]], "date": "2018-01-21", "time": "23:31:11", "categories": "Food, Coffee & Tea", "city": "Santa Barbara", "state": "CA", "stars": 2.5, "business_review_count": 74, "predit_yelp_score": 2.45, "actual_yelp_score": 1.0}, {"review_id": "Ocn7rQBqOkc9QFJTD2WnBg", "user_id": "O7dexXHPx8Ay8RCesjtIog", "business_id": "Ks3uMmqFr8b7RLsidq1g_w", "review": [["Tried to use my birthday reward here and was told the system was down and it was impossible to do. Then my iced lemon loaf was more like ice-cold lemon loaf. Otherwise, no problems!\nUpdate: Starbucks customer service credited me for the full amount. Thanks! That said, I should add that the staff at this location  refused to warm up the lemon loaf, saying the melting icing would start a fire in the microwave."]], "date": "2018-12-23", "time": "14:53:34", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 3.5, "business_review_count": 55, "predit_yelp_score": 2.3, "actual_yelp_score": 1.0}, {"review_id": "P6vwXK9UG8Alt60vb_NcXw", "user_id": "YU_Mc1mpgFjvPDVgoH5kjg", "business_id": "BGLwAUo3603af9_Wd06PBw", "review": [["This Starbucks is by far the worst one I have ever been to. I have been waiting almost 45 mins for two Chai tea lattes. I could literally make it myself faster!! Poor system, poor service."]], "date": "2020-01-09", "time": "21:42:45", "categories": "Coffee & Tea, Food", "city": "Brentwood", "state": "TN", "stars": 2.5, "business_review_count": 32, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "jvOvtIdXOFIQK9LMsYPVvQ", "user_id": "IzPbuC9L38XKR4hBIdEiXA", "business_id": "NCHUoBAMTDqI754PICPN9A", "review": [["I'm a gold card member...shamefully or not. I love Starbucks and I went almost everyday in my hometown. This Starbucks has botched my order a few times. The staff is friendly but often distracted with private conversations. I ordered a very specific drink which was lost somewhere behind the counter. I waited a good twenty minutes for one drink, and I had to remind two workers. I still visit this location because it's convenient and I need my Starbucks fix from time to time."]], "date": "2013-02-22", "time": "03:46:15", "categories": "Restaurants, Food, Coffee & Tea", "city": "Isla Vista", "state": "CA", "stars": 3.0, "business_review_count": 99, "predit_yelp_score": 1.675, "actual_yelp_score": 3.0}, {"review_id": "dSVCpOJG_K98y2Cp43bWWA", "user_id": "365KZ7cpWZWywsbd52TaTg", "business_id": "9c1p8TTOG_F55i3yEiVVDQ", "review": [["The only bad thing about this place is on how to get into the place to order your latte. It's hard to get in if your coming from 95. The staff is super friendly and my lattes are always on point. I usually order vanilla lattes and they put just the right amount in it."]], "date": "2014-10-19", "time": "02:37:45", "categories": "Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 70, "predit_yelp_score": 1.675, "actual_yelp_score": 4.0}, {"review_id": "Ng3x0yMdnR5lBu8MO4-4mw", "user_id": "5we2jh81eBsMFR3s0jyZqw", "business_id": "GNrZxUMFyBCjei_-gfVjjg", "review": [["This Starbucks is excellent. They respond quickly and cheerfully no matter how busy they are. I prefer this over the others in the area"]], "date": "2020-03-07", "time": "11:37:09", "categories": "Coffee & Tea, Food", "city": "Wilmington", "state": "DE", "stars": 3.0, "business_review_count": 30, "predit_yelp_score": 4.8999999999999995, "actual_yelp_score": 5.0}, {"review_id": "DblP44jtffw2QvBoB6S8TQ", "user_id": "Oi1qbcz2m2SnwUeztGYcnQ", "business_id": "u-LC1VfzdpBHDNYr2H-Gxw", "review": [["Yet another Starbucks and just as consistent as all the others.  This one has two things going for it that I like.\n\n1. Starbucks is known for their incredibly tight parking lots.  This one is better than most.\n2. They share this parking lot with a Phillie Pretzel Factory.  I prefer a pretzel instead of the overpriced, insane calories of the Starbucks bakery case."]], "date": "2011-07-24", "time": "13:48:40", "categories": "Food, Coffee & Tea", "city": "Broomall", "state": "PA", "stars": 3.5, "business_review_count": 6, "predit_yelp_score": 3.5000000000000004, "actual_yelp_score": 3.0}, {"review_id": "nhRjctR2oXw-rxq_aIow-Q", "user_id": "iynRJODJEEX-YCcacFFOKg", "business_id": "a-MYqHxvpmCz3ZXy2illiA", "review": [["Had the best experience here minus one thing, the table I was sitting at was broken and tipped over spilling all of my drink I had just paid for. I was kinda bummed but got up to grab napkins to clean up my spill. The manager came out right away and asked if I wanted a replacement drink, mopped the mess up right away, and made my drink in front of the line! It was very sweet of her and great customer service! She offered us a new table as soon as she could. Coffee here, as always, is amazing. Definitely come here for good vibes, good coffee, and good service."]], "date": "2017-12-18", "time": "15:51:00", "categories": "Coffee & Tea, Food", "city": "St. Louis", "state": "MO", "stars": 3.0, "business_review_count": 57, "predit_yelp_score": 2.725, "actual_yelp_score": 5.0}, {"review_id": "utTajSN3NfdspK31kqNWkQ", "user_id": "Sp2GV7D-_JLZMPQmDanzPQ", "business_id": "HxdaEwpoXKll0Ze4nhS0XA", "review": [["Located right down stairs from the American Airlines club lounge which made it very convenient for us to head down and grab us some of our fav drinks while waiting for our flight.  Walked right up w/no crowd to place our order -- friendly staff and drinks were wonderful."]], "date": "2020-09-07", "time": "23:19:10", "categories": "Desserts, Coffee & Tea, Food", "city": "Philadelphia", "state": "PA", "stars": 2.0, "business_review_count": 56, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "9UhncZNTqgEbPsrW0FAPUg", "user_id": "D224RQ9WRnWmndZJiQ-kAA", "business_id": "fZ2RkIwoDCcODCOyoBTplg", "review": [["Went today. It was busy since in the mall. I ordered the new cold brew. It seems to move slowly here and when I wanted to get a tea later I skipped it since it seemed busy and I couldn't stand the wait, the staff was friendly though and my drink today and many other times has been done right, it maybe deserves 3.5 stars. A better starbucks than some others."]], "date": "2015-04-07", "time": "00:39:46", "categories": "Coffee & Tea, Food", "city": "King of Prussia", "state": "PA", "stars": 3.0, "business_review_count": 30, "predit_yelp_score": 4.9, "actual_yelp_score": 3.0}, {"review_id": "N9J463VnWoIe0D_eI_OXjA", "user_id": "lEQYqMxfdh6DVZSDbc2X-A", "business_id": "JngvCO_EWSG5r3Mcy_5_9A", "review": [["The staff here is very friendly and efficient.  Love the outdoor seating in the loop.  Sounds odd, but their decaf coffee is best tasting (pike).  I order a Pike half decaf and it is consistent tasting every time while other stores are not."]], "date": "2018-08-25", "time": "01:22:33", "categories": "Restaurants, Food, Coffee & Tea", "city": "University City", "state": "MO", "stars": 3.0, "business_review_count": 24, "predit_yelp_score": 4.925000000000001, "actual_yelp_score": 5.0}, {"review_id": "BtEOsaTY3_Fmq5L795ssMQ", "user_id": "7nFAAqL1iphwAl--VEY-gA", "business_id": "ouXwzUhtm3hnVUo79IebLw", "review": [["There's a 50/50 chance that you will end up with the wrong order going through the drive thru. Take it from someone who goes to Starbucks almost daily, this location is horrible. The drive thru takes FOREVER and then they rush you through just handing you a random drink that's not yours. I've kept track, and they are currently sitting at a 50% accuracy. They under fill every drink and someone's they taste horrible. I avoid this location and only go if I'm shopping near by. Save yourself some trouble and just go to McDonald's down the parking lot and get cheaper coffee that's made correctly. Corporate needs to be on this location NOW. They are starting to lose valuable customers because of the customer service and wait times."]], "date": "2019-09-08", "time": "17:38:17", "categories": "Food, Coffee & Tea, Bakeries", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 58, "predit_yelp_score": 0.5249999999999999, "actual_yelp_score": 1.0}]