[{"review_id": "0y1lPzyzlBchau-lXjviVg", "user_id": "TyENXUFbNWB5x9o1MyV8GQ", "business_id": "s9MfczTRRmvPiZlLBJqEkg", "review": [["I can at least say both times I've been to this location, the food was fresh.\nWe just went this evening. Our total order was 7 crunchy tacos supreme, one burrito supreme, one crunch wrap, and two cinnamon twists. And we asked for hot and fire sauce. \nWe received the soft tacos, one burrito, two crunch wraps, and three cinnamon twists. And hot and mild.\nWent back through, they re-rang the order completely, they asked us just to keep the wrong order, and then brought us 6 hard tacos, 3 soft tacos, a crunch wrap, two cinnamon twists, and no burrito.\nBetween the two orders, we got everything except one hard taco and brought home a ton of extra food. I've never gone to a drive thru before and had the whole entire order wrong, and I've never had a wrong order replaced with another wrong order. We like Taco Bell, we just won't be coming back to this location. Check your bags before you leave, folks!"]], "date": "2021-02-05", "time": "05:40:45", "categories": "Mexican, Tacos, Tex-Mex, Breakfast & Brunch, Fast Food, Restaurants", "city": "Gallatin", "state": "TN", "stars": 2.0, "business_review_count": 20, "predit_yelp_score": 1.85, "actual_yelp_score": 2.0}, {"review_id": "b7t56sOOXFA-rLCD5Ew2-Q", "user_id": "kkPgJv6KBFN15caG7NYYlg", "business_id": "oR3iGLhTW3UiABNEhmMcUg", "review": [["Good gosh, it had been forever since I had last visited a Taco Bell location! It was a pretty decent visit: I liked my soft taco though I wasn't super pleased with my burrito or my fries. My fountain beverage was exactly as expected and I liked the little cinnamon balls I had for dessert. What really wowed me was just how clean the restroom was! I was actually quite impressed! It's rare that I find such a clean, well-maintained fast food restaurant restroom, especially since I was visiting on a holiday. I'm sure I'll return eventually."]], "date": "2019-07-07", "time": "03:07:48", "categories": "Mexican, Fast Food, Restaurants", "city": "Edmonton", "state": "AB", "stars": 1.5, "business_review_count": 6, "predit_yelp_score": 4.7250000000000005, "actual_yelp_score": 3.0}, {"review_id": "GZFGuKJUBFoeEQ_zL0yeEw", "user_id": "9hakePAjNtew4zN2B0TIEg", "business_id": "YFy2pYLTvV8az7GYeuw_Ew", "review": [["Terrible place I'm allergic to sour cream I asked for no sour cream and they gave me it in my food after I asked for no sour cream"]], "date": "2022-01-08", "time": "23:05:57", "categories": "Tex-Mex, Restaurants, Fast Food, Breakfast & Brunch, Tacos, Mexican", "city": "Reno", "state": "NV", "stars": 2.0, "business_review_count": 76, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "RU9S3dsRQbE9sT6HyVkheQ", "user_id": "WCT5pGXQL5eDLIot1xaBfg", "business_id": "ye_NPsD6rRX84zm1SkAO2A", "review": [["I come through the drive-thru for taco salads about once a week, they are always great. Tonight one was awesome and one had the shell cooked in rancid oil...ick, ick, and even a delayed ick. \n\ni actually got back in the car and came back to let them know, because I love taco salads. They offered to give me another meal, etc. I asked for the same thing but I wanted to try the shell first...it was also rancid. they told me they make them fresh every day, which I believe, and it can't be rancid. I don't think they knew what rancid was, when I asked them to try a piece of my dzzo-over they wouldn't.\n\n\nI wish I had heard the manager tell the staff to get rid of anything made in that fryer before I left instead of doubt."]], "date": "2016-01-05", "time": "08:59:48", "categories": "Restaurants, Tacos, Fast Food, Mexican, Breakfast & Brunch, Tex-Mex", "city": "Norristown", "state": "PA", "stars": 2.0, "business_review_count": 37, "predit_yelp_score": 2.475, "actual_yelp_score": 1.0}, {"review_id": "Pv8UWj2dp3lNVieUZNxl6Q", "user_id": "ORWE7Iq66TLk3zB_3O4Vzg", "business_id": "S5a0iHy8KDVmPFnZ1Sze-g", "review": [["My husband and I went there today around 10:40am. We waited in the drive thru about 4 minutes and no one came to take our order. We eventually decided to try going inside but the door was locked. I did notice two young workers sitting in their car...smoking. One of them came running inside the restaurant when they saw we were trying to get in. We ended up leaving and won't return. Unfortunately this appears to be a common issue at this location. Considering the area it is in, I expect more. I contacted corporate about this incident and waiting for a reply."]], "date": "2017-07-04", "time": "05:08:25", "categories": "Fast Food, Tex-Mex, Mexican, Restaurants, Breakfast & Brunch, Tacos", "city": "Carmel", "state": "IN", "stars": 1.5, "business_review_count": 105, "predit_yelp_score": 0.5, "actual_yelp_score": 1.0}, {"review_id": "XSOScqNWikneW_Cy-1cyCg", "user_id": "HpO8v8NAqGgNsRYszRtn1w", "business_id": "KS-SOgTuuK332IFFn1tBow", "review": [["This was a horrible experience and I will never eat at this location again. First, I placed my order on the app. But when I arrived to let the cashier know that I was there,(per the app) she didn't know what I was talking about and the manager said \"it's ok they will call you when it's ready. 8 minutes later another lady comes out and calls my name then the manger tells her to make the order. After another 15 minutes I received my food (fast food my ass). On top of this I had to ask for cups that came with my meal.  As for the environment three employees were sitting in the dining area with me and my son. One of them was talking on their phone loudly and using profanity. I was there with my 12 year old son. Shameful. The food was made well on top of everything thing else the Chalupa shells where over fried hard to eat ( I gave them to my dog).  All in all, what should have took 10 mins took almost 20 min and tasted horrible. I will never eat at this Taco Bell again."]], "date": "2018-11-11", "time": "02:06:29", "categories": "Mexican, Tacos, Breakfast & Brunch, Restaurants, Fast Food", "city": "Indianapolis", "state": "IN", "stars": 1.5, "business_review_count": 27, "predit_yelp_score": 0.325, "actual_yelp_score": 1.0}, {"review_id": "4zHGN5l9-DF7AKjBSyBj9g", "user_id": "fylr6iQLBx_JQclFGO1-Bg", "business_id": "ICSLQrp1gPPNGkwUeUAAtg", "review": [["Ok, so tacobell isn't glamorous and i know that. I don't think it's half bad and I will occasionally get a craving for it. This particular location is newer-ish and i have given it multiple chances, but they just suck. There is no better word for it. I am not sure if they just can't get staffed or what. One instance they ran out of beans...like...tacobell running out of BEANS? I said I didnt care because my order didn't require it too much, but they acted like it was inconvenient for them to make the food. Another time i sat in the line behind one car in the drive thru for 10 minutes and they never took their order. I don't know how long they had already been sitting there, but come on and get it together guys because this location would be really convenient to go to."]], "date": "2018-11-04", "time": "01:51:28", "categories": "Mexican, Tacos, Fast Food, Breakfast & Brunch, Restaurants", "city": "Reno", "state": "NV", "stars": 1.5, "business_review_count": 38, "predit_yelp_score": 0.975, "actual_yelp_score": 1.0}, {"review_id": "WksetA35kGxo8xkMK2spUA", "user_id": "YmIwyQurXBrmla0RJnJDUQ", "business_id": "hNLnKpAYld9vT3d_fH7r5A", "review": [["I order here after work on a typical week day and it is fine but tonight... worst experience yet at a Taco Bell. First and foremost, the door was locked at 8:00 and they were \"letting\" ppl in when they could get to the door. The staff was all young and playing around with each other. There was a family that confronted them that they had not received their food and they blatantly yelled they had and the family was lying. They finally made the food for said family. Someone in the drive-though was called \"slow\" because they couldn't hear the young lady telling her to hold on. Unacceptable to say the least. I cannot imagine my daughter ever acting like these young kids did at her place of employment. I work in HR and all I have to say is you have a big problem on your hands. I will be going to another Taco Bell from now on and telling our friends in the area to do the same."]], "date": "2019-11-11", "time": "01:55:03", "categories": "Restaurants, Tex-Mex, Tacos, Mexican, Breakfast & Brunch, Fast Food", "city": "Indianapolis", "state": "IN", "stars": 2.0, "business_review_count": 24, "predit_yelp_score": 1.5, "actual_yelp_score": 1.0}, {"review_id": "p_OEst0TyFLvECjKZyqqdw", "user_id": "Zn4cjMV5giNqH2kH58J4yg", "business_id": "oFTKJQht60Qbkk9nJlCk5A", "review": [["This location most definitely needs an overhaul. 15 minutes in drive up because the lobby is closed an hour early but plenty of employees leaning around on the counter. An employee outside told me they are short staffed. Kinda ridiculous to make your own hours"]], "date": "2018-03-26", "time": "02:04:37", "categories": "Restaurants, Tex-Mex, Mexican, Tacos, Fast Food, Breakfast & Brunch", "city": "Jefferson", "state": "LA", "stars": 2.0, "business_review_count": 25, "predit_yelp_score": 0.6250000000000001, "actual_yelp_score": 1.0}, {"review_id": "rYks_LgjkQolcXmLRaLrAA", "user_id": "nAKKAXMfFSIDI_SyMXlKHw", "business_id": "p6klcK2owWoH97jHSuOZ7w", "review": [["One of the better locations in the area. Very clean inside and out and I never think twice if I'm craving volcano nachos."]], "date": "2012-01-01", "time": "18:15:19", "categories": "Fast Food, Tex-Mex, Restaurants, Mexican, Tacos", "city": "Tampa", "state": "FL", "stars": 2.0, "business_review_count": 20, "predit_yelp_score": 4.9750000000000005, "actual_yelp_score": 4.0}, {"review_id": "MAG6b2hXbf-8vSmZNbwXWg", "user_id": "-H237nV1rCDE46Vvuwm_Dg", "business_id": "8_21onKUx5a9VGMN1iZBlw", "review": [["Nasty *ss bathroom! Thanks minimum wage for the best you have to offer at a Taco Bell in a college town #nashville."]], "date": "2013-10-27", "time": "04:05:19", "categories": "Tex-Mex, Fast Food, Mexican, Restaurants", "city": "Nashville", "state": "TN", "stars": 2.0, "business_review_count": 21, "predit_yelp_score": 2.5, "actual_yelp_score": 1.0}, {"review_id": "nkeWiWZ5KcpZHySGRC2BBA", "user_id": "6976gBRyzo79c82vzpbJtQ", "business_id": "S9WG-ZBwLVj2eCB6_0P0MQ", "review": [["These guys are the worst. I'm always waiting for 15 minutes AFTER Ordering in the drive through. I ordered at 5:45 giving myself some time to pick up my daughter from gymnastics with hot food. 6:01 and I have not moved from the order screen. Just called gymnastics to let them know I'm stuck. \n\nLame. I wouldn't complain if this was the first time. This is anything but fast food. It's Taco Bell. Not rocket science. Someone manage this franchise."]], "date": "2019-03-28", "time": "01:03:07", "categories": "Tex-Mex, Restaurants, Fast Food, Breakfast & Brunch, Tacos, Mexican", "city": "Reno", "state": "NV", "stars": 2.0, "business_review_count": 74, "predit_yelp_score": 1.5000000000000002, "actual_yelp_score": 1.0}, {"review_id": "dhBlJbzHefFssNbfkVsasg", "user_id": "BCYFG6ZchIN31n7wvF95EQ", "business_id": "tfU_GPrbSnssFQQHnBSkPQ", "review": [["Worst taco bell I've ever eaten at! The meat looked weird not like normal Taco Bell meat! The service was terrible.... dining area dirty! Glass in doors are disgusting handprints fingerprints! Windows dirty! Half the drinks didn't work! Ohhh and don't get the triple melt nachos!!! There is no cheese!!! I had to get a cup for .65 cents WTF...Over all the worst Taco Bell... Pinellas Park one so much better! \n\nMaybe that's why there's hardly anyone here!"]], "date": "2018-04-11", "time": "16:03:25", "categories": "Restaurants, Tex-Mex, Tacos, Fast Food, Breakfast & Brunch, Mexican", "city": "Kenneth City", "state": "FL", "stars": 2.0, "business_review_count": 15, "predit_yelp_score": 0.6499999999999999, "actual_yelp_score": 1.0}, {"review_id": "kprMWqfT9UV5eZoYD6DLtQ", "user_id": "mzL0zHFGyd9866OUljq49g", "business_id": "0TNu_MOiizGa_75jqSaAvA", "review": [["My love for Taco Bell has continued after many years away.  This TB, runs, feels and looks like a Taco Bell should.  The employees were nice, my food got there fast and it was tasty.\n\nI'm a huge fan of the Cheesy Gordita Crunch.  I feel that they (taco bell) truly peaked with the creation of that entree.  It's got everything you could want and the price is nice.\n\nThe Doritos Loco taco is tasty.  I found the shell to be a bit fragile and while I find it to be a novelty, I still enjoyed eating it.\n\nI don't imagine I'll be a regular at this or any taco bell (at least not anymore) this one is perfectly fine to stop at for a bite."]], "date": "2013-05-17", "time": "14:38:01", "categories": "Tex-Mex, Breakfast & Brunch, Restaurants, Fast Food, Mexican, Tacos", "city": "Hamilton", "state": "NJ", "stars": 3.0, "business_review_count": 18, "predit_yelp_score": 4.75, "actual_yelp_score": 4.0}, {"review_id": "p0qtPmboURifJ6_wMnTybA", "user_id": "9zJQxppsDO3erz8eGMSQ4g", "business_id": "B6fIXw9UyF06mXmHPMnFwg", "review": [["I was skeptical by the reviews at first but after driving through this place on a late night I must say it was the best Taco Bell i've ever had! And unfortunately for my own health i've had a lot. Heckin worth it! Nut 10/10"]], "date": "2018-06-07", "time": "20:09:39", "categories": "Mexican, Tacos, Tex-Mex, Restaurants, Fast Food, Breakfast & Brunch", "city": "Ewing", "state": "NJ", "stars": 2.5, "business_review_count": 30, "predit_yelp_score": 3.1999999999999997, "actual_yelp_score": 5.0}, {"review_id": "TKbo29K7hRz5SsIfKe8o9Q", "user_id": "S6UzknYCErhDY2twhaX2BQ", "business_id": "bxjOSldtLatq7jX4j0lKuQ", "review": [["Pretty clean and nice Taco Bell in O'Fallon. The service was very fast and I could tell the food was very fresh. \n\nThe menu is really cool if you ever get a chance to look at it. Taco Bell always seems to have an awesome speciality taco ready to go. I got the Protein Menu burrito which is like 500 calories and 20 grams a protein so eat in moderation. \n\nTaco Bell is a nice alternative to fried fast food, so it has a plus in my book for that. But watch what you order if your a workout freak like me. I normally go weekly on my cheat day. Yes I ordered 4 burritos and Nacho Supreme."]], "date": "2018-08-24", "time": "22:56:29", "categories": "Mexican, Tacos, Tex-Mex, Fast Food, Breakfast & Brunch, Restaurants", "city": "O Fallon", "state": "IL", "stars": 2.0, "business_review_count": 18, "predit_yelp_score": 4.225, "actual_yelp_score": 4.0}, {"review_id": "gpuJI7aGpaZa9kOINyJrOg", "user_id": "g6bCaRNakg_wwF7iRe6L7Q", "business_id": "1DAI96tu5hcP_lvKBHVixw", "review": [["This Taco Bell is not a bad location, but PLEASE make Sure to Check your order. My roommate is a vegetarian, and while she may not admit it, it really upset her whenever she took a bite into her OBVIOUSLY marked meal saying NO MEAT, and it had ground beef all over! Now, I eat meat avidly and get that it could be a mix up, but if you take the time to write in SHARPIE that the meal is meat free, then it should be!!!"]], "date": "2017-03-05", "time": "07:10:31", "categories": "Pizza, Fast Food, Restaurants, Breakfast & Brunch, Mexican, Tex-Mex, Tacos", "city": "Nashville", "state": "TN", "stars": 3.0, "business_review_count": 18, "predit_yelp_score": 2.475, "actual_yelp_score": 3.0}, {"review_id": "qi1E07kNWmTCtQbV96fPiw", "user_id": "QgXmfJtDOVHhXGMYfGhdLw", "business_id": "u4fIQnGqhDC9TZ3pq3AyUQ", "review": [["One of the most poorly run, inefficient fast food restaurants in the area.  Should not be fast food since it take forever.."]], "date": "2015-01-26", "time": "01:44:22", "categories": "Fast Food, Restaurants, Tacos, Mexican, Tex-Mex", "city": "Feasterville", "state": "PA", "stars": 1.5, "business_review_count": 32, "predit_yelp_score": 0.55, "actual_yelp_score": 1.0}, {"review_id": "fVu5BfSL0GWYNkjKUg7V-A", "user_id": "l6I4N-Gh8y1FY2M8ymd3mw", "business_id": "qIzKtmOjBC3CSMmPQ068ew", "review": [["Let me start out by asking this, when you go to your favorite restaurant and order your favorite food you expect it to come the way it always does right? I mean that's why your paying for it so it can be done the way you want it to or at least the way it's shown in the menu. I stopped by Taco Bell yesterday and I ordered 17 freaking dorito hard tacos. When I got home I was so disappointed. As to see that all my tacos had was some meat and a little bit of cheese. No lettuce ! The beat part of the taco. I paid for nothing and am extremely mad."]], "date": "2020-04-20", "time": "21:15:27", "categories": "Tex-Mex, Restaurants, Tacos, Mexican, Fast Food, Breakfast & Brunch", "city": "Smyrna", "state": "TN", "stars": 2.0, "business_review_count": 10, "predit_yelp_score": 1.2249999999999999, "actual_yelp_score": 1.0}, {"review_id": "dnwhuTMQ6tBFK_2EfKiT6w", "user_id": "T6_VM-d3_GvvyOpLuUStuA", "business_id": "1fBiQt1VUpQ9r3mY663mIw", "review": [["There are two Taco Bell locations in Plant City... This one, and the one on James L Redman. This location is amazing, especially compared to the other one. I've had horrible experiences at that other location... So bad, to where I won't even go back. That means I go out of my way and all of the way across town just to visit this one when I'm craving the bell. Why? Every time I visit here they always get my order correct, they always have what we want, (and if they are out of anything, they will post a sign at the speaker) and they always give us generous portions! Our food is never cold or stale, and is always so delicious. Fast & friendly service!"]], "date": "2021-09-30", "time": "03:24:06", "categories": "Breakfast & Brunch, Tacos, Fast Food, Mexican, Restaurants, Tex-Mex", "city": "Plant City", "state": "FL", "stars": 2.0, "business_review_count": 19, "predit_yelp_score": 3.3000000000000003, "actual_yelp_score": 5.0}, {"review_id": "WD7H_vLOCVcbalUAMoRNDg", "user_id": "QZtHp6yOvSVJRVTuJnbGOA", "business_id": "uNZvfcpwTNVxyPe9i1m90g", "review": [["I wish I could always give Taco Bell five stars. This Taco Bell has pros and cons. There's a really friendly guy on the drive thru speaker. You'll know it if you get him.  Food is great because.. Taco Bell. Downsides are I can't sit inside in this one because there is always this beeping that makes me want to throw things.  In addition they are missing and item from our drive thru pretty regularly so make sure you check before you go."]], "date": "2017-02-21", "time": "22:13:58", "categories": "Tex-Mex, Restaurants, Fast Food, Tacos, Mexican, Breakfast & Brunch", "city": "Gilbertsville", "state": "PA", "stars": 2.5, "business_review_count": 16, "predit_yelp_score": 2.7500000000000004, "actual_yelp_score": 3.0}, {"review_id": "lNi75OamvozvjGZV6a-L-A", "user_id": "3cNKTACOnCcbIDHlvRt-PQ", "business_id": "n1gsuLtnpo9Hd3ZF41YCKg", "review": [["Literally the worst Taco Bell I have ever been to. Every single time you go through the drive though it is a solid 20 minutes. Then on more than one occasion you wait to get to the speaker and they tell you they are no longer taking orders at 9:15pm. I will defiantly be driving the extra 10 minutes to avoid this place."]], "date": "2017-12-07", "time": "02:31:54", "categories": "Tex-Mex, Restaurants, Tacos, Mexican, Breakfast & Brunch, Fast Food", "city": "Lawrence", "state": "IN", "stars": 2.0, "business_review_count": 7, "predit_yelp_score": 0.125, "actual_yelp_score": 1.0}, {"review_id": "76yLPxbP7TLcyU-Fi7AtSQ", "user_id": "rb58H7une8HDJX2F-e5Iug", "business_id": "IutQN-u-d_T4Ra0MMHKeIw", "review": [["This was actually a Taco Bell and Pizza Hut Express. I got tacos, but wife wanted bread sticks so it all worked out.\n\nThe $2 meal deals are radically different prices everywhere we go, and this place was no exception charging $2.79. They did come with a large drink, though I wonder if that's all they had left as everyone seemed to be getting one. I would much rather pay less and have to walk up to get re-fills. Oh well. \n\nMy burrito was all right, nothing special but not bad. My wife's pizza was about the same. The bread sticks were worth the trip though, so all is well."]], "date": "2014-01-20", "time": "01:47:51", "categories": "Restaurants, Mexican, Fast Food, Breakfast & Brunch, Tacos, Tex-Mex", "city": "Pinellas Park", "state": "FL", "stars": 2.0, "business_review_count": 24, "predit_yelp_score": 4.95, "actual_yelp_score": 3.0}, {"review_id": "96ik40Yxd44f9-OYr0diMg", "user_id": "lOq1HGS17It8OS2ruQavdg", "business_id": "VorGRaLg9TNWRmWYKcbbKA", "review": [["I have been a Taco Bell VIP since before I could drive and, subsequently, it's one of mine and my family & friends' favorite places to eat. I am especially devastated, however, that they have removed the Mexican pizza, shredded chicken, and pico de gallo from the menu. I love Taco Bell, but that doesn't mean I wanna eat the same thing every time I go there. I can't believe I'm actually going to have to take a step back. I really hope this is only in response to the Covid and they put these things back on their menu as soon as possible.. I am devastated."]], "date": "2020-11-15", "time": "15:21:29", "categories": "Restaurants, Tex-Mex, Mexican, Fast Food, Tacos, Breakfast & Brunch", "city": "Indianapolis", "state": "IN", "stars": 1.5, "business_review_count": 17, "predit_yelp_score": 2.6999999999999997, "actual_yelp_score": 4.0}, {"review_id": "QgnVhYaVIP4NcJzYR6qaGQ", "user_id": "MRcwipUSXVloQulnbcqngg", "business_id": "5tkZfqkwx6axbN9P5UlC8w", "review": [["Food is ok but they must pay employees not to smile. I get the impression they would rather you not bother them."]], "date": "2019-08-22", "time": "18:54:13", "categories": "Restaurants, Tex-Mex, Fast Food, Mexican, Tacos", "city": "Carpinteria", "state": "CA", "stars": 2.5, "business_review_count": 32, "predit_yelp_score": 0.7, "actual_yelp_score": 1.0}, {"review_id": "nUv6WOEeROSczdLxDtTiYg", "user_id": "NXnWmsyvBx8hjmCTFROt2Q", "business_id": "3USsaqu_Dm2NeAJoW6r6_w", "review": [["It is a Taco Bell, so I'm basing this just on other Taco Bells I have been to. Is it authentic Mexican food, no. But that's fine. Sometimes I just want cheap, fast food, and this place usually hits the spot. \n\nThe staff here are always very nice. They genuinely seem to like taking my orders, allowing me to customize things (I hate sour cream and always ask them to take it off anything I order), and there always seems to be someone cleaning in the lobby area when we come in. These are all great things. \n\nThat being said, the drive-thru often gives you the wrong order, partial orders, or they end up putting what seems like extra sour cream on things. When my fiance and I go, we always check the order as we're pulling out of the drive thru because we've failed to in the past and end up getting home missing half an order. Or we have some other person's order, which means they have my delicious Cantina bowl. \n\nSome of the policies are confusing here. They stop making certain things at certain times. No, I'm not talking about breakfast. I mean at 10pm they tell me they cannot make the Cantina bowl. No idea why this is a policy. But on two separate trips I was told at two separate times (one at 10pm, one at 7pm) that they cannot make a Cantina bowl at that time. Ok... confusing. Not sure why. So be prepared for that hassle with certain things. \n\nOverall, it is a Taco Bell. But it is not one of the best Taco Bells in town (despite a staff that seems to be trying hard)."]], "date": "2015-11-06", "time": "20:04:51", "categories": "Restaurants, Mexican, Tex-Mex, Fast Food, Tacos, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 30, "predit_yelp_score": 1.8, "actual_yelp_score": 3.0}, {"review_id": "YlsEr61yhvWqHO4ldSTSbQ", "user_id": "-G_8xD_1cGCPnwyPiLdZEQ", "business_id": "LJ3OPCppT2A4G4oB8vZ9bA", "review": [["A lady (more like piece of trash) yelled at me on the phone and told me she wasn't making my d*** order. This happened on the night of 6/11-6/12."]], "date": "2021-06-12", "time": "06:54:36", "categories": "Restaurants, Breakfast & Brunch, Fast Food, Tacos, Tex-Mex, Mexican", "city": "Saint Petersburg", "state": "FL", "stars": 2.0, "business_review_count": 25, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "5YylPE8ty3MzOl1nao0XmA", "user_id": "B_3DNKSG1191fLMGg-VSDg", "business_id": "aT0FhdLMRjUkJjjANFz7ZA", "review": [["The hours state 7AM-12 but this location was closed at 10 on a Sunday. They need to update the false advertising. Multiple cars were in line believing the location closed at midnight as stated on yelp google and Apple maps. HORRIBLE!"]], "date": "2019-07-01", "time": "03:09:04", "categories": "Breakfast & Brunch, Tacos, Fast Food, Restaurants, Mexican, Tex-Mex", "city": "Saint Louis", "state": "MO", "stars": 2.0, "business_review_count": 42, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "_Cxkh2ZcN4AgoYWlvt8rXg", "user_id": "CoEnKFwK0ba6m7R4i-66DQ", "business_id": "op4ocMBW0jDfKL7YI3PbpQ", "review": [["I've been to this Taco Bell location three times in the last month. This was the first time I have received excellent service from the employees. I was already a bit irritated because of the long line at the drive thru when I got there. However, when I pulled up to place my order, I was greeted with a friendly voice (never, in my 28 years, have I ever experienced a smiling voice via a Taco Bell drive thru voicebox until tonight). When I got to the window, I asked if they had the military discount. The cashier asked the manager, who informed him that they did not. The cashier apologized and thanked me for my service, which I admired the respect he showed. The manager was also very polite and presented himself in a respectable way. Taco Bell definitely had their A-team on tonight! Shoutout to Christopher and the manager on shift tonight!"]], "date": "2019-04-03", "time": "05:01:53", "categories": "Salad, Restaurants, Tex-Mex, Fast Food, Breakfast & Brunch, Mexican, Tacos", "city": "Indianapolis", "state": "IN", "stars": 1.5, "business_review_count": 68, "predit_yelp_score": 3.9, "actual_yelp_score": 4.0}, {"review_id": "mnNKd5RwwiLcpSLdoTomJw", "user_id": "B5OcOUDx_78nULIbL0ubpA", "business_id": "fp_SXpuPXtYySgxsNxG8zg", "review": [["Went in & ordered a cheese quesadilla combo. Andrea, who took my order, had 5 star service. I received my meal in 2 minutes. Only bad thing was that the CHEESE quesadilla had some weird sauce on it. It was a little upsetting because I didn't eat my meal until I was already back at work."]], "date": "2017-08-18", "time": "23:53:17", "categories": "Restaurants, Fast Food, Tex-Mex, Mexican, Tacos, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 3.0, "business_review_count": 19, "predit_yelp_score": 1.475, "actual_yelp_score": 3.0}, {"review_id": "kBHiXpi9QTtWi4374OQaTw", "user_id": "m9VvdW76Q5DO-rotrXgH9A", "business_id": "KPIlgtsj0cTkrXQLCsQe3Q", "review": [["This might be the worse Taco Bell in Reno. I went to get some Nacho fries and a burrito. Got the nacho fry bell grande, and a shredded chicken burrito. The ingredients in both seemed to be spoiled. The sour cream did NOT taste how it should, the chicken tasted absolutely disgusting. Everything about both was probably the worse thing I've ever experienced. I am truly disappointed in this."]], "date": "2019-02-09", "time": "23:07:14", "categories": "Breakfast & Brunch, Restaurants, Fast Food, Tacos, Mexican, Tex-Mex", "city": "Sun Valley", "state": "NV", "stars": 1.5, "business_review_count": 36, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "H4bQ_-jdaUtDx8DBh5MWdw", "user_id": "aIjhpZatARUqC9anHpWj6Q", "business_id": "Hd6U8p2-9k5CWY1ScrYong", "review": [["Worst Taco Bell in the city, very rude and slow. Food sub par at the best. Need people who like their job and treat customers with respect. Don't do full menu, waited ten minutes for someone to wait on us to find out they don't do breakfast (and there was no other customers there). Never again."]], "date": "2014-08-31", "time": "15:20:40", "categories": "Mexican, Restaurants, Fast Food, Tex-Mex", "city": "Philadelphia", "state": "PA", "stars": 1.5, "business_review_count": 15, "predit_yelp_score": 2.525, "actual_yelp_score": 1.0}, {"review_id": "xZAlTmy_hb3gkw10-XO0cA", "user_id": "2fNKxgKEt4oU5x_T_DddeA", "business_id": "VSksu-hdu85Q_2IhBte9rA", "review": [["It's a standard Taco Bell. They may have had a shaky start, but a couple weeks in and things seem normal. We ate there Friday night when it was pretty busy. Service was fine, things appeared clean. When you want Taco Bell, this will do just fine."]], "date": "2015-12-13", "time": "17:15:11", "categories": "Fast Food, Breakfast & Brunch, Tex-Mex, Restaurants, Mexican, Tacos", "city": "Indianapolis", "state": "IN", "stars": 1.5, "business_review_count": 27, "predit_yelp_score": 3.35, "actual_yelp_score": 4.0}, {"review_id": "3w6uIzHoNfM-hcarm5gCWA", "user_id": "q3y2k3IM8HaU5MkiD8DzXg", "business_id": "7zzSq-37WyMeSRrN8-zd6Q", "review": [["This Taco Bell is notorious for a super drive-thru wait. I'm writing this review so you all know what you're getting into when you decide to satisfy your late night Taco Bell cravings. There is a point of no return in the drive thru because of how the lane shifts to where there is only enough room for one car -- so no going back or trying to get out if you get too impatient! \nI've accepted this fact and have had a lot of fun waiting in this drive thru line with a car full of friends listening to early 2000s r&b. So, if you've got the time and want to wait in line for 40+ minutes for your Taco Bell-- just go into it with a good mindset and you'll survive. \nIf you're in a rush, trying to get a meal after a long shift at work and all you want to do is get home- do your mental health a favor and get food somewhere else."]], "date": "2021-02-23", "time": "21:46:20", "categories": "Mexican, Tacos, Restaurants, Tex-Mex, Fast Food, Breakfast & Brunch", "city": "Boise", "state": "ID", "stars": 2.0, "business_review_count": 54, "predit_yelp_score": 3.5250000000000004, "actual_yelp_score": 2.0}, {"review_id": "IihbRAuMXBOInM4zA0CfyQ", "user_id": "gSiwNcaAs6HWdOMt2k23dQ", "business_id": "s9MfczTRRmvPiZlLBJqEkg", "review": [["In Gallatin the drive-thru line is always long. I do not understand this b/c there r a plethora of authentic mexican restaurants which r far superior. Taco Bell is Taco Bell you've been to one you've been to them all. Curse of a chain fast food restaurant"]], "date": "2019-08-13", "time": "06:14:23", "categories": "Mexican, Tacos, Tex-Mex, Breakfast & Brunch, Fast Food, Restaurants", "city": "Gallatin", "state": "TN", "stars": 2.0, "business_review_count": 20, "predit_yelp_score": 1.6, "actual_yelp_score": 3.0}, {"review_id": "GcA5Mhy862Sk43IjxldGGw", "user_id": "aN5ILph2xvQLIfict61yrQ", "business_id": "YFZEUO2lipPqQdWGqPWUew", "review": [["I have ordered from here on occasion for the last 20 years. Only had one bad experience. I got food poisoning from the taco salad. I stick to tacos from now on. The staff has always been nice and never had to wait for food."]], "date": "2020-12-25", "time": "03:49:28", "categories": "Restaurants, Mexican, Tacos, Tex-Mex, Breakfast & Brunch, Fast Food", "city": "Philadelphia", "state": "PA", "stars": 3.5, "business_review_count": 19, "predit_yelp_score": 1.675, "actual_yelp_score": 4.0}, {"review_id": "zx8vtDYChqWWzLqVECh-Xg", "user_id": "zZNXZeqI1Do9PVABdNUUtg", "business_id": "PdT1l1LtQzVYERaYdmYYQQ", "review": [["Store was dirty, spent $25.66, but couldn't get a packet of salt, even when I requested it. No apology offered, apparently a cost cutting measure.  Too expensive to not offer condiments.  Won't be going back, crossed  off my list of places to eat."]], "date": "2021-10-08", "time": "18:40:47", "categories": "Tex-Mex, Tacos, Restaurants, Breakfast & Brunch, Sandwiches, Mexican, Fast Food", "city": "Fishers", "state": "IN", "stars": 3.0, "business_review_count": 25, "predit_yelp_score": 0.07500000000000001, "actual_yelp_score": 1.0}, {"review_id": "7IEm5iUveZawpQlcLv-lIg", "user_id": "39pATG8KVB76WTmQqcu7GQ", "business_id": "VtI_Pm7UjwZjxwsA-uBmWQ", "review": [["The most horrendous horse c r a p I've ever seen. Ordered delivery which is probably on me but there wasn't any meat in the doritos tacos, the cheesy Gordita chicken had no sauce and cold\nChicken. My other three items never arrived. They got the sauce packets right though. Never again."]], "date": "2021-09-17", "time": "02:50:21", "categories": "Restaurants, Fast Food, Breakfast & Brunch, Tex-Mex, Mexican, Tacos", "city": "Upper Darby", "state": "PA", "stars": 3.0, "business_review_count": 22, "predit_yelp_score": 0.025, "actual_yelp_score": 1.0}, {"review_id": "JPH0dfbezXv0-hjG8_dalw", "user_id": "DSXJPnRONoNaQ964ysFRxA", "business_id": "to95MZH1XV_fNLOXNMZQmQ", "review": [["I get annoyed when I go to a place that's open, yet the doors are locked and the staff makes me wait to come in. If you're open, you're open. If the doors were unlocked you wouldn't have to roll your eyes and come unlock it. \n\nOther than that food was quick. Faster that the iced coffee. Which she made and immediatly walked away from making me have to wait then eventually get pissed and have to reach over the counter to get. \n\nUghhhhhh. Why do I do this to myself"]], "date": "2017-10-12", "time": "12:25:57", "categories": "Mexican, Tex-Mex, Tacos, Breakfast & Brunch, Fast Food, Restaurants", "city": "Indianapolis", "state": "IN", "stars": 2.5, "business_review_count": 21, "predit_yelp_score": 2.375, "actual_yelp_score": 2.0}, {"review_id": "pxpOJE8o1DYJY5dEERxEKw", "user_id": "47VRkiLB3Vz6q9gJda6fUA", "business_id": "a55AKfh1XfKzqxDyzswVqA", "review": [["Nicest employees of any fast food spot in the area. It's unreal how much of a difference there is between this Taco Bell and the one in Berlin. Never had a problem with my order at this location and if I did I know they would go out of their way to fix it."]], "date": "2020-07-09", "time": "01:02:22", "categories": "Breakfast & Brunch, Tacos, Restaurants, Fast Food, Mexican", "city": "Sicklerville", "state": "NJ", "stars": 2.5, "business_review_count": 7, "predit_yelp_score": 5.0, "actual_yelp_score": 5.0}, {"review_id": "OGU045ddYdlIFdlAE_b-8w", "user_id": "XnvqIx_KyleffOmrPd9CXA", "business_id": "D1AGSvIci0E53E1Yix1mXA", "review": [["Very bad !!! Rude customers , and that's why it empty !!! No one at the kiosk and argued with us . Hopefully we didn't ordered and left and right after us , the employee had a fight with some other customer as well!!!! Don't go please . Employees sucks !!!"]], "date": "2021-11-11", "time": "20:50:24", "categories": "Mexican, Restaurants, Tex-Mex, Breakfast & Brunch, Fast Food, Tacos", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 14, "predit_yelp_score": 0.42500000000000004, "actual_yelp_score": 1.0}, {"review_id": "uKplQnuCaQwofC8s2ob4tQ", "user_id": "CNkExAVVFI5PgFcFocHlTg", "business_id": "2heF73lJKRlvoWcKJ--95Q", "review": [["This location has been going down the shitter for years, and I've tolerated it because it's close to my job, but today was the last straw. Sorriest looking Taco I've ever seen in my life. You'd think the employees are paying for the toppings out of their own pockets or something. Basically a shell with about a teaspoon of meat, a tablespoon of lettuce and about 11 pieces of cheese. I'm done, I'll start going to the Hardee's across the way."]], "date": "2017-07-07", "time": "19:11:57", "categories": "Restaurants, Mexican, Tacos, Fast Food, Tex-Mex, Breakfast & Brunch", "city": "Belleville", "state": "IL", "stars": 1.0, "business_review_count": 17, "predit_yelp_score": 4.925000000000001, "actual_yelp_score": 1.0}, {"review_id": "me_Qwdn28aE29ynLLvoqfA", "user_id": "oJvNCAQZ8YgV661HB4HaIA", "business_id": "S21zm5nS5nyGM8m7nPCNsg", "review": [["Quick drive thru service that quickly got me order but missed items in my request.  No water available either.. Don't get that one.  The food I did get was hot and yummy for taco bell.  The side order of Chicken is cheap and tastey.  Should have been a three star because the service was friendly...Just missed stuff."]], "date": "2010-10-20", "time": "09:31:21", "categories": "Breakfast & Brunch, Tacos, Mexican, Tex-Mex, Restaurants, Fast Food", "city": "Tampa", "state": "FL", "stars": 2.5, "business_review_count": 29, "predit_yelp_score": 2.9499999999999997, "actual_yelp_score": 2.0}, {"review_id": "dGpvZAtuyLmjA7uYlrJVoA", "user_id": "tGnsETqZ1drukLcsn-yQWQ", "business_id": "JgyGbZKl9OVvDS_umSHlEQ", "review": [["This is the wimpiest \"power bowel\" I have ever received. They ran out of black bean and then i didn't receive a fork. How am I suppose to eat my salad if I don't have anything to eat it with?"]], "date": "2021-07-19", "time": "06:01:20", "categories": "Restaurants, Fast Food, Mexican, Tacos, Tex-Mex, Breakfast & Brunch", "city": "Boise", "state": "ID", "stars": 1.5, "business_review_count": 31, "predit_yelp_score": 0.0, "actual_yelp_score": 1.0}, {"review_id": "Pl9wsHTGW2S7lBekn4ImJw", "user_id": "6o_TlV1KQGJujBY3ZE7ZnQ", "business_id": "c44aUUU2te9GPcSLpRw0Xg", "review": [["This has to be the single worst fast food experience I have ever had I'm my 20 years of life. I pulled up to the drive through before the restaurant closed, had my order taken, and proceeded to wait twenty minutes just to have my drinks dumped out in front of my face and then have a teenager tell me to $&@K off, to my face. I have never felt so disrespected in my life. I have been a loyal Taco Bell fan for many years, but this experience makes Taco Bell look like what comes out of my rear into my toilet after I eat it their food. I will never eat at this establishment again. I hope they go out of business, and the employees who disrespected me lose their jobs."]], "date": "2020-12-13", "time": "05:48:59", "categories": "Mexican, Fast Food, Tacos, Restaurants, Breakfast & Brunch, Tex-Mex", "city": "Ballwin", "state": "MO", "stars": 2.0, "business_review_count": 21, "predit_yelp_score": 0.65, "actual_yelp_score": 1.0}, {"review_id": "HLPDmHuDUjYJyzAo2tgKIA", "user_id": "OkAeaBVEcIF4napv1uDE-w", "business_id": "1Ak3OUTbe60AyCh239s0Jw", "review": [["While dining in, I witnessed several employees and the manager on duty berating one of the other staff members while he was cashing out a customer, when they attempted to give the customer food without finishing the transaction.\n\nThe manager continued to follow the now former employee out of the store calling him degrading names and from what I could see began to throw rocks at him as well.  If this is the way that taco bell expects their employees to act, I will take my business elsewhere and encourage anyone else to do so as well."]], "date": "2021-11-09", "time": "13:40:45", "categories": "Restaurants, Tex-Mex, Mexican, Tacos, Breakfast & Brunch, Fast Food", "city": "Olivette", "state": "MO", "stars": 2.0, "business_review_count": 31, "predit_yelp_score": 1.375, "actual_yelp_score": 1.0}, {"review_id": "cAOJmbTboTJO6iyeI0NmTg", "user_id": "0ZzPXpti555EutMEf4TjTg", "business_id": "T9ipW3BH2_wTUNEGOBpYVQ", "review": [["To say that this the worst Taco Bell I've ever been to would be an understatement. I realize that most people don't read reviews on places as cheap as TB but my hope is that I can save at least one person from this terrible experience. The drive thru wait is always ridiculous 20-30 minutes and I have NEVER received a correct order. I've ordered cheesy bean and rice burritos and triple layer nachos and received them with sour cream on them...sour cream isn't even an ingredient on those! That's if I'm lucky enough to even receive everything I paid for. The corporation needs to step in and clear the place out."]], "date": "2015-06-11", "time": "04:43:12", "categories": "Restaurants, Breakfast & Brunch, Tex-Mex, Mexican, Tacos, Fast Food", "city": "Tucson", "state": "AZ", "stars": 1.5, "business_review_count": 62, "predit_yelp_score": 1.2000000000000002, "actual_yelp_score": 1.0}, {"review_id": "ZzeKgwH4VSifn9YoBOVVTA", "user_id": "4xmJZNRxQP-8O_gZ2Iv42Q", "business_id": "WN8icQ2p9_uUZosXg--jNw", "review": [["This place is good just like any other Taco Bell is for late night munchies. But the only negative about this place is that a homeless man sleeps by the drive-they window which scared the living day lights out of me."]], "date": "2015-12-14", "time": "08:55:46", "categories": "Sandwiches, Mexican, Tacos, Tex-Mex, Restaurants, Fast Food, Breakfast & Brunch", "city": "Tucson", "state": "AZ", "stars": 2.5, "business_review_count": 48, "predit_yelp_score": 2.5, "actual_yelp_score": 3.0}, {"review_id": "zGSwCNJ2Odyx6kJRUO5rkA", "user_id": "J4iEZ8lHDru4hzYSZMoiCQ", "business_id": "88I_hsGjDXPs9uQKrGwq8Q", "review": [["My order was completely incorrect. There was stuff I requested to have omitted on it and stuff that shouldn't have been omitted not on it. I would have gone back but I was on lunch and didn't have time. I know it's fast food and I don't expect gourmet food. I just want the order correct. Really disappointed in them."]], "date": "2014-12-21", "time": "22:10:16", "categories": "Restaurants, Tex-Mex, Fast Food, Breakfast & Brunch, Tacos, Mexican", "city": "Clearwater", "state": "FL", "stars": 2.0, "business_review_count": 29, "predit_yelp_score": 0.2, "actual_yelp_score": 1.0}, {"review_id": "Af7r19vjwW3emT52y4C4Hg", "user_id": "BxyTxSqDjavuwn-qG1ZbzQ", "business_id": "5u-nGdIafPUV_xeRewlYpQ", "review": [["Truly the worst experience I've ever had at a taco bell. \n\nI placed my order without incident. The problems began after I paid for my order. I was told to drive around and that I would be brought my order. Okay. I only ordered 3 items. But I remember that when I worked at taco bell, this was done by some managers to keep our stats up. Okay, I can live with that. I drive around and join what soon becomes a drive-in theater's worth of cars.\n\nI was the second of these cars, but the last to receive a bag. But I'm getting ahead of myself. Renija, the same woman who took my order, came out and asked us if our order was 4 Fiesta potatoes. It was not. I told her very clearly, that it was not. And she understood, I thought.\n\nThe bag I received was not what I ordered. The receipt inside was for, you guessed it, 4 fiesta potatoes. But the food inside was something completely different from either what I ordered or was shown on the receipt. So they had mixed up EVERYBODY'S order.\n\nWhen I approached the door, I found it locked, even though the dining room is scheduled open. Soon, the same woman who had handed me my bag came to the door. I informed her that the bag that she had given me was not my order. She just looked disappointed for a moment. Then she asked me to come into her closed lobby.\n\nAnd I stood in front of that counter for more than 10 minutes while this same woman went back to the drive-through. Another woman continued to mop the lobby behind me as I watched customer after customer come through the drive through, having their orders completed in normal time.\n\nFinally, after another guy arrived at work and came to her window, only then did she remember my existence. She asks me what I ordered and I tell her. \n\nI swear to Zeus, she did every single itrm wrong. But she did throw a complementary cinnamon twists into my bag, so yay. (I hate cinnamon twists. It's like eating stale air.)\n\nI asked for my receipt, because though I haven't done the review in years, I absolutely wanted to \"tell the bell\" about this experience. I am informed that she requires her manager to print me a receipt.\n\nEnter, manager. A young, morbidly obese black woman walking to the drive through register, asking me if I remember how much my order was. Bear in mind, I had been charged for this order around 25 minutes ago. I did not. After about 5 minutes, she gave me the receipt and replaced my complementary stale air with an all ice Baja blast. The manager's mask clung protectively to the manager's chin as it had the entire time I'd been inside, leaving her fake-smile exposed. \n\nEvery single burrito was made incorrectly. Technically the correct burritos, though. And we were ready to go, so we did not complain again."]], "date": "2020-07-19", "time": "15:52:45", "categories": "Mexican, Restaurants, Tex-Mex, Breakfast & Brunch, Fast Food, Tacos", "city": "Kirkwood", "state": "MO", "stars": 1.5, "business_review_count": 52, "predit_yelp_score": 0.5499999999999999, "actual_yelp_score": 1.0}]